Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Have a look at each world's objective view to understand how to write the function. To draw one side of the triangle, draw a smaller recursive triangle (halve the length) and move forward by the requested length. Globally, you have to draw 3 such sides and turn by 120 between each side.
ta: Have a look at each world's objective பார்வை பெறுநர் understand how பெறுநர் write the function. பெறுநர் draw one பக்கம் of the triangle, draw a smaller recursive triangle (halve the length) and move forward by the requested length. Globally, you have பெறுநர் draw 3 such sides and turn by 120 between each side.

source: We will now draw our first recursive function with the turtle. The goal is to draw different kind of spirals with the same function, which prototype is the following:
ta: We will now draw our first recursive சார்பு with the turtle. The goal is பெறுநர் draw different kind of spirals with the same function, which prototype is the following:

source: To help you understanding how to write it, here is an example of how the parameters change during one specific call:
ta: பெறுநர் உதவி you understanding how பெறுநர் write it, here is an example of how the parameters change during one specific call:

source: Note that you only have to write the function, not the initial call. Each world will provide a specific set of initial parameters (use the combobox to switch to other worlds). For example, the "Square Pyramid" world will call your function as follows:
ta: குறிப்பு that you only have பெறுநர் write the function, not the initial call. Each world will provide a specific கணம் of initial parameters (use the combobox பெறுநர் ஆளி, நிலைமாறி பெறுநர் மற்றொன்று worlds). க்கு example, the "Square Pyramid" world will call your சார்பு அச் follows:

source: This exercise is not really an exercise in that sense that you just have to click on the Execute button to get the reward: All the needed code is already provided. Instead, you can here explore the possibilities of the code you just wrote by changing the parameters of the call to the <code>spiral</code> function. You can move on to the next exercise if you are short on time, and come back later to play around.
ta: This exercise is not really an exercise in that புலன் that you just have பெறுநர் click on the Execute button பெறுநர் get the reward: அனைத்தும் the needed குறியீடு is already provided. Instead, you can here explore the possibilities of the குறியீடு you just wrote by changing the parameters of the call பெறுநர் the <code>spiral</code> function. You can move on பெறுநர் the அடுத்தது exercise if you அரே குறுக்கு on time, and come பின் later பெறுநர் play around.

source: Here are some of the figures that you can produce with your <code>Spiral</code> function, provided that you come with the right parameters. You can switch to the creative mode (from the Exercise menu) to disable the world comparison when you explore with these spirals.
ta: Here அரே some of the figures that you can produce with your <code>Spiral</code> function, provided that you come with the வலது parameters. You can ஆளி, நிலைமாறி பெறுநர் the creative பயன்முறை (from the Exercise menu) பெறுநர் முடக்கு the world comparison when you explore with these spirals.

source: If you discover a cool figure, don't forget to send your parameters (menu Help/feedback) so that we can add it to the list!
ta: If you கண்டுபிடி a cool figure, don't forget பெறுநர் send your parameters (menu Help/feedback) so that we can கூட்டு it பெறுநர் the list!

source: Dragon curve (1)
ta: Dragon வளைவு (1)

source: The dragon curve is a classical example of recursive method.
ta: The dragon வளைவு is a classical example of recursive method.

source: The definition of this curve is the following:
ta: The definition of this வளைவு is the following:

source: the dragon curve of order 1 is a vector between to arbitrary points P and Q,
ta: the dragon வளைவு of order 1 is a திசையன் between பெறுநர் arbitrary பிரிவகம் P and Q,

source: the dragon curve of order n is the dragon curve of order n-1 between P and R, followed by the same curve of order n-1 between Q and R, where PRQ is an isosceles triangle with angle R being a right angle, and R being at the right of the PQ vector. Thus, if P and Q coordinates are (x, y) and (z, t), the coordinate (u, v) of R are given by:
ta: the dragon வளைவு of order n is the dragon வளைவு of order n-1 between P and R, followed by the same வளைவு of order n-1 between Q and R, where PRQ is an isosceles triangle with angle R being a வலது angle, and R being at the வலது of the PQ vector. Thus, if P and Q coordinates அரே (x, y) and (z, t), the ஆயம் (u, v) of R அரே given by:

source: u = (x + z)/2 + (t - y)/2 v = (y + t)/2 - (z - x)/2
ta: உ = (x + z)/2 + (t - y)/2 v = (y + t)/2 - (z - x)/2

source: The prototype of the method drawing the curve is the following:
ta: The prototype of the method drawing the வளைவு is the following:

source: You should use the method <code>setPos(x,y)</code> to put your turtle at coordinates (x,y) and the method <code>moveTo(z,t)</code> to draw a line between the turtle position and the point(z,t).
ta: You should use the method <code>setPos(x,y)</code> பெறுநர் put your turtle at coordinates (x,y) and the method <code>moveTo(z,t)</code> பெறுநர் draw a வரி between the turtle position and the point(z,t).

source: The dragon curve (2)
ta: The dragon வளைவு (2)

source: Previous solution induce that the turtle teleports to other location, or at the very least, that it moves its pen up during the drawing. Indeed, the end of the drawing of the first recursive call does not match the beginning of the second recursive call. That is why we had to use the method <code>setPos()</code>
ta: Previous நீர்மக்கூழ் induce that the turtle teleports பெறுநர் மற்றொன்று location, or at the very least, that it moves its pen மேலே during the drawing. Indeed, the end of the drawing of the first recursive call does not match the beginning of the second recursive call. That is why we had பெறுநர் use the method <code>setPos()</code>

source: In this lesson, you will write a recursive method allowing to draw the dragon curve without taking the pen up. For that, we need another recursive method drawing the mirror side of the curve.
ta: In this lesson, you will write a recursive method allowing பெறுநர் draw the dragon வளைவு without taking the pen up. க்கு that, we need another recursive method drawing the mirror பக்கம் of the curve.

source: The prototype of the <code>dragon()</code> method remains unchanged from previous exercise:
ta: The prototype of the <code>dragon()</code> method remains unchanged இருந்து previous exercise:

source: The new point's coordinate (u, v) introduced by the <code>dragon()</code> are:
ta: The புதிய point's ஆயம் (u, v) introduced by the <code>dragon()</code> are:

source: The new point's coordinate (u, v) introduced by the <code>dragonReverse()</code> are:
ta: The புதிய point's ஆயம் (u, v) introduced by the <code>dragonReverse()</code> are:

source: u = (x + z)/2 - (t - y)/2 v = (y + t)/2 + (z - x)/2
ta: உ = (x + z)/2 - (t - y)/2 v = (y + t)/2 + (z - x)/2

source: To make the work of each method recursiv more visible, the line painted by the <code>dragon()</code> must be red (<code>Color.red</code>) while the line painted by the <code>dragonReverse()</code> must be blue (<code>Color.blue</code>).
ta: பெறுநர் make the வேலை of each method recursiv more visible, the வரி painted by the <code>dragon()</code> must be சிவப்பு (<code>Color.red</code>) while the வரி painted by the <code>dragonReverse()</code> must be நீலம் (<code>Color.blue</code>).

source: Here comes the super classical exercise on recursion along with some variations. If you have any other nice variations, please submit them. At some point, someone should also probably contribute these variations to wikipedia, as only the base problem is nicely described there.
ta: Here comes the super classical exercise on recursion along with some variations. If you have any மற்றொன்று nice variations, please submit them. At some point, someone should also probably பங்களிப்பு these variations பெறுநர் wikipedia, அச் only the காரம் problem is nicely described there.

source: The Interleaved and Split variations come from the following article: "Exploring Recursion with Variations on the Towers of Hanoi", Daniel W. Palmer. Available at http://www.ccscjournal.willmitchell.info/Vol12-96/No2a/Daniel%20W%20Palmer.pdf
ta: The Interleaved and Split variations come இருந்து the following article: "Exploring Recursion with Variations on the Towers of Hanoi", Daniel W. Palmer. Available at http://www.ccscjournal.willmitchell.info/Vol12-96/No2a/Daniel%20W%20Palmer.pdf

source: The Linear Hanoi is briefly discussed in the article presenting the Linear Twin Towers of Hanoi: "The Linear Twin Towers of Hanoi Problem", Steven Minsker (ACM SIGCSE Bulletin Volume 39 Issue 4, December 2007). This article can only be accessed through the paywall of the editor, sorry.
ta: The நேரியல் Hanoi is briefly discussed in the article presenting the நேரியல் Twin Towers of Hanoi: "The நேரியல் Twin Towers of Hanoi Problem", Steven Minsker (ACM SIGCSE Bulletin தொகுதி 39 சிக்கல் 4, கா-மார்கழி 2007). This article can only be accessed through the paywall of the editor, sorry.

source: The 3-colors Towers of Hanoi problem was presented on this web page: http://www.cut-the-knot.org/recurrence/TricolorHanoiAuto.shtml
ta: The 3-colors Towers of Hanoi problem was presented on this விரலிடைத் தோல் page: http://www.cut-the-knot.org/recurrence/TricolorHanoiAuto.shtml

source: The Cyclic Towers of Hanoi was proposed by M.D. Atkinson in an article of 1981 titled "The cyclic towers of Hanoi" (Information Processing Letters, Volume 13:3). The article is available at http://www.cs.otago.ac.nz/staffpriv/mike/Papers/Hanoi/CyclicHanoi.pdf.
ta: The Cyclic Towers of Hanoi was proposed by M.D. Atkinson in an article of 1981 titled "The cyclic towers of Hanoi" (Information Processing Letters, தொகுதி 13:3). The article is available at http://www.cs.otago.ac.nz/staffpriv/mike/Papers/Hanoi/CyclicHanoi.pdf.

source: This is an application exercise of recursion, that you should master to take this lesson.
ta: This is an application exercise of recursion, that you should master பெறுநர் take this lesson.

source: The Tower of Hanoi or Towers of Hanoi, also called the Tower of Brahma or Towers of Brahma, is a mathematical game or puzzle. It consists of three pegs, and a number of disks of different sizes which can slide onto any peg. The puzzle starts with the disks in a neat stack in ascending order of size on one peg, the smallest at the top, thus forming a pyramid.
ta: The Tower of Hanoi or Towers of Hanoi, also called the Tower of Brahma or Towers of Brahma, is a mathematical game or puzzle. It consists of three pegs, and a எண் of disks of different sizes which can slide onto any peg. The puzzle starts with the disks in a neat stack in ஏறுதல் order of அளவு on one peg, the smallest at the top, thus forming a pyramid.

source: The objective of the puzzle is to move the entire stack to another peg, obeying the following rules:
ta: The objective of the puzzle is பெறுநர் move the entire stack பெறுநர் another peg, obeying the following rules:

source: Only one disk may be moved at a time.
ta: Only one disk சி-வைகாசி be moved at a time.

source: Each move consists of taking the upper disk from one of the pegs and sliding it onto another peg, on top of the other disks that may already be present on that peg.
ta: Each move consists of taking the upper disk இருந்து one of the pegs and sliding it onto another peg, on மேலே of the மற்றொன்று disks that சி-வைகாசி already be present on that peg.

source: No disk may be placed on top of a smaller disk.
ta: இல்லை disk சி-வைகாசி be placed on மேலே of a smaller disk.

source: Write the core of the method: <code>[!java|c]void [/!]hanoi[!c]Rec[/!]([!java|c]int [/!]height[!scala]:Int[/!], [!java|c]int [/!]src[!scala]:Int[/!], [!java|c]int [/!]other[!scala]:Int[/!],[!java|c]int [/!]dst[!scala]:Int[/!])</code>
ta: Write the வயிரம் of the method: <code>[!java|c]void [/!]hanoi[!c]Rec[/!]([!java|c]int [/!]height[!scala]:Int[/!], [!java|c]int [/!]src[!scala]:Int[/!], [!java|c]int [/!]other[!scala]:Int[/!],[!java|c]int [/!]dst[!scala]:Int[/!])</code>

source: This method will recursively solve the presented problem. The first parameter named <code>height</code> is the height of the tower to move; The second parameter <code>src</code> is the index of the initial tower, the third parameter <code>other</code> is the index of the unused peg while the fourth parameter <code>dst</code> is the index of the expected final tower.
ta: This method will recursively solve the presented problem. The first கூறளவு named <code>height</code> is the height of the tower பெறுநர் move; The second கூறளவு <code>src</code> is the குறியெண் of the initial tower, the third கூறளவு <code>other</code> is the குறியெண் of the unused peg while the fourth கூறளவு <code>dst</code> is the குறியெண் of the expected final tower.

source: A key to solving this puzzle is to recognize that it can be solved by breaking the problem down into a collection of smaller problems and further breaking those problems down into even smaller problems until a solution is reached.
ta: A key பெறுநர் solving this puzzle is பெறுநர் recognize that it can be solved by breaking the problem down into a collection of smaller problems and further breaking those problems down into இரட்டை smaller problems until a நீர்மக்கூழ் is reached.

source: label the pegs A, B, C (these labels may move at different steps)
ta: சிட்டை the pegs A, B, C (these சிட்டைகள் சி-வைகாசி move at different steps)

source: let n be the total number of discs (the height of the initial tower)
ta: let n be the total எண் of discs (the height of the initial tower)

source: number the discs from 1 (smallest, topmost) to n (largest, bottommost)
ta: எண் the discs இருந்து 1 (smallest, topmost) பெறுநர் n (largest, bottommost)

source: To move n discs from peg A to peg C:
ta: பெறுநர் move n discs இருந்து peg A பெறுநர் peg C:

source: move n−1 discs from A to B. This leaves disc number n alone on peg A
ta: move n−1 discs இருந்து A பெறுநர் B. This leaves வட்டு எண் n alone on peg A

source: move disc number n from A to C
ta: move வட்டு எண் n இருந்து A பெறுநர் C

source: move n−1 discs from B to C so they sit on disc number n
ta: move n−1 discs இருந்து B பெறுநர் C so they sit on வட்டு எண் n

source: In this classical variation of the Towers of Hanoi, you are given 4 pegs with 2 stacks, one white and one black. You should mix the two stacks as depicted in the Objective world. As previously, you cannot move a disk on a smaller disk.
ta: In this classical variation of the Towers of Hanoi, you அரே given 4 pegs with 2 stacks, one வெள்ளை and one black. You should mix the two stacks அச் depicted in the Objective world. அச் previously, you cannot move a disk on a smaller disk.

source: You will probably need to reuse the <code>hanoi()</code> method that you wrote in the previous exercise.
ta: You will probably need பெறுநர் reuse the <code>hanoi()</code> method that you wrote in the previous exercise.

source: Please show me an intermediate step
ta: Please காட்டு me an intermediate படி

source: If your initial situation is as follows:
ta: If your initial situation is அச் follows:

source: then you have the following situation right before the main recursive call:
ta: then you have the following situation வலது before the main recursive call:

source: Given one interleaved stack (e.g. resulting from the previous exercise), you should build two separate stacks. In other words, your code should revert the operations done to solve the previous exercise.
ta: Given one interleaved stack (e.g. resulting இருந்து the previous exercise), you should உருவாக்கு two separate stacks. In மற்றொன்று words, your குறியீடு should revert the operations முடிந்தது பெறுநர் solve the previous exercise.

source: You will need an extra function that can move an interleaved stack of n pairs of disks, without changing the relative positions of disks of the same size.
ta: You will need an extra சார்பு that can move an interleaved stack of n pairs of disks, without changing the relative positions of disks of the same size.

source: Surprisingly, our solution to split the towers generates much more moves than our solution to interleave them. As both problems are symmetric, this should not be.
ta: Surprisingly, our நீர்மக்கூழ் பெறுநர் split the towers generates much more moves than our நீர்மக்கூழ் பெறுநர் interleave them. அச் both problems அரே symmetric, this should not be.

source: Can you make the split tower as efficient as the interleaved one?
ta: Can you make the split tower அச் efficient அச் the interleaved one?

source: The source of discrepancy is an inefficient problem decomposition. Satisfied that it merely worked, we looked no futher for a better solution. Keeping the disks of the interleaved tower in the correct order during every move is unnecessary. In fact, we can avoid moving the interleaved tower at all. A better problem decomposition splits the pair of disks into two colored towers as they are removed from the interleaved tower.
ta: The மூலம் of discrepancy is an inefficient problem decomposition. Satisfied that it merely worked, we looked இல்லை futher க்கு a better solution. Keeping the disks of the interleaved tower in the சரியான order during every move is unnecessary. In fact, we can avoid moving the interleaved tower at all. A better problem decomposition splits the பேரிக்காய் of disks into two colored towers அச் they அரே removed இருந்து the interleaved tower.

source: You need to be more explicit
ta: You need பெறுநர் be more explicit

source: First split the first (n-1) pairs of disks from the interleaved stack into a white tower and a black tower (calling recursively your main function).
ta: First split the first (n-1) pairs of disks இருந்து the interleaved stack into a வெள்ளை tower and a கருப்பு tower (calling recursively your main function).

source: Then move the large white disk on its target pole.
ta: Then move the large வெள்ளை disk on its target pole.

source: Then move the (n-1) smaller white disks on top of the large one.
ta: Then move the (n-1) smaller வெள்ளை disks on மேலே of the large one.

source: Then move the large black disk on its target pole.
ta: Then move the large கருப்பு disk on its target pole.

source: Then move the smaller black disks in position.
ta: Then move the smaller கருப்பு disks in position.

source: Again, our previous solution is working, but it is far from being optimal. When moving the towers, we use the algorithm for 3 pegs even if we have 4 pegs. Of course, movements to the last peg are restricted since it contains the other stack, but we can always store the smallest disk on top of the other stack before moving our stack.
ta: Again, our previous நீர்மக்கூழ் is working, but it is far இருந்து being optimal. When moving the towers, we use the படிமுறை க்கு 3 pegs இரட்டை if we have 4 pegs. Of course, movements பெறுநர் the last peg அரே restricted since it contains the மற்றொன்று stack, but we can எப்போதும் store the smallest disk on மேலே of the மற்றொன்று stack before moving our stack.

source: For that, we need to devise a new function <code>hanoi_fast(height, src, free, full, dst)</code> that moves the stack from <code>src</code> to <code>dst</code> using <code>free</code>, but storing the smallest disk onto <code>full</code> beforehand.
ta: க்கு that, we need பெறுநர் devise a புதிய சார்பு <code>hanoi_fast(height, src, free, full, dst)</code> that moves the stack இருந்து <code>src</code> பெறுநர் <code>dst</code> using <code>free</code>, but storing the smallest disk onto <code>full</code> beforehand.

source: The <code>hanoi_fast(height, src, free, full, dst)</code> function is not recursive. It moves the first disk and then call the regular <code>hanoi()</code> function.
ta: The <code>hanoi_fast(height, src, free, full, dst)</code> சார்பு is not recursive. It moves the first disk and then call the regular <code>hanoi()</code> function.

source: This change greatly improve the performance, as you can see below. Of course, this trick could also be used for the interleaved algorithm, leading as expected to the exact same performance.
ta: This change greatly improve the performance, அச் you can see below. Of course, this trick could also be used க்கு the interleaved algorithm, leading அச் expected பெறுநர் the exact same performance.

source: As a conclusion, most of us are satisfied with a working solution and we easily overlook possibilities to improve the problem decomposition. <b>You</b> should not do that ;)
ta: அச் a conclusion, பெரும்பாலானவை of us அரே satisfied with a working நீர்மக்கூழ் and we easily overlook possibilities பெறுநர் improve the problem decomposition. <b>You</b> should not do that ;)

source: Linear Towers of Hanoi
ta: நேரியல் Towers of Hanoi

source: This is a classical variation over the Towers of Hanoi where some moves are forbidden. Specifically, disks cannot move directly between the left-most and the right-most pegs. The middle peg must be involved in every moves.
ta: This is a classical variation வீச்சலகு the Towers of Hanoi where some moves அரே forbidden. Specifically, disks cannot move directly between the left-most and the right-most pegs. The middle peg must be involved in every moves.

source: Beside of that extra complexity, the problem remains unchanged: you are requested to move the whole stack of disks from one extremity peg to the other one. You can only move one disk at a time, and a bigger disk cannot be placed over a smaller one.
ta: Beside of that extra complexity, the problem remains unchanged: you அரே requested பெறுநர் move the whole stack of disks இருந்து one extremity peg பெறுநர் the மற்றொன்று one. You can only move one disk at a time, and a bigger disk cannot be placed வீச்சலகு a smaller one.

source: As with the classical version, it is much easier to produce a recursive solution, and you are absolutely able to devise this solution if you think hard enough about it.
ta: அச் with the classical version, it is much easier பெறுநர் produce a recursive solution, and you அரே absolutely able பெறுநர் devise this நீர்மக்கூழ் if you think hard enough பற்றி it.

source: The standard recursive algorithm for classical Hanoi is of complexity <i>2^n-1</i> where the standard recursive algorithm for this variation is of complexity <i>3^n-1</i>.
ta: The தரநிலை recursive படிமுறை க்கு classical Hanoi is of complexity <i>2^n-1</i> where the தரநிலை recursive படிமுறை க்கு this variation is of complexity <i>3^n-1</i>.

source: The standard recursive algorithm for classical Hanoi involves two recursive calls sandwiching one movement of the largest disk, the standard recursive algorithm for Linear Hanoi involves three recursive calls sandwiched around two movements of the same disk.
ta: The தரநிலை recursive படிமுறை க்கு classical Hanoi involves two recursive calls sandwiching one movement of the largest disk, the தரநிலை recursive படிமுறை க்கு நேரியல் Hanoi involves three recursive calls sandwiched around two movements of the same disk.

source: Linear Twin Towers of Hanoi
ta: நேரியல் Twin Towers of Hanoi
