Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: This world was invented by Lyn Turbak, at Wellesley College. It is full of Buggles, little animals understanding simple orders, and offers numerous possibilities of interaction with the world: taking or dropping objects, paint the ground, hit walls, etc.
ta: This world was invented by Lyn Turbak, at Wellesley College. It is full of Buggles, little animals understanding simple orders, and offers numerous possibilities of உள்வினை with the world: taking or dropping objects, paint the ground, hit walls, etc.

source: Methods understood by buggles
ta: முறைகள் understood by buggles

source: <b>Moving</b>
ta: <b>நகர்கிறது</b>

source: (See also the note on exceptions, below)
ta: (கீழே உள்ள விதிவிலக்குகள் பற்றிய குறிப்பையும் பார்க்கவும்)

source: <b>Turn left
ta: <b>இடப்பக்கம் திரும்பு

source: Turn right
ta: வலதுபுறம் திரும்பு

source: Turn back
ta: பின்னே திரும்பு

source: Moving forward
ta: முன்னோக்கி நகர்தல்

source: <b>Get X coordinate
ta: <b>Get ஃச் ஆயம்

source: Get Y coordinate
ta: Get ஒய் ஆயம்

source: Set X coordinate
ta: கணம் ஃச் ஆயம்

source: Set Y coordinate
ta: கணம் ஒய் ஆயம்

source: Set position</b>
ta: கணம் position</b>

source: Note that the point (0,0) is on the top left corner, as it is often the case in Computer Science.
ta: குறிப்பு that the புள்ளியம் (0,0) is on the மேலே இடது corner, அச் it is often the case in கணிப்பொறி, கணிணி Science.

source: Set the color of the body</b>
ta: கணம் the color of the body</b>

source: <b>Look for a wall forward
ta: <b>Look க்கு a wall forward

source: Look for a wall backward</b>
ta: Look க்கு a wall backward</b>

source: Set heading</b>
ta: கணம் heading</b>

source: Check whether the buggle is currently <b>selected in the interface</b>
ta: சரிபார் whether the buggle is currently <b>selected in the interface</b>

source: Brush up
ta: மின்தொடி மேலே

source: Get brush position</b>
ta: Get மின்தொடி position</b>

source: <b>Change the brush color
ta: <b>Change the மின்தொடி color

source: <b>Look for a baggle on the ground
ta: <b>Look க்கு a baggle on the ground

source: Look for a baggle in bag
ta: Look க்கு a baggle in bag

source: (see the note on exceptions)
ta: (see the குறிப்பு on exceptions)

source: <b>Look for a message
ta: <b>Look க்கு a செய்தி

source: Add a message
ta: கூட்டு a செய்தி

source: Read the message
ta: Read the செய்தி

source: Name in [!thelang]
ta: பெயர் in [!thelang]

source: Pointing North
ta: Pointing வடக்கு

source: Pointing East
ta: Pointing கிழக்கு

source: Pointing South
ta: Pointing தெற்கு

source: Pointing West
ta: Pointing மேற்கு

source: Note on exceptions
ta: குறிப்பு on exceptions

source: Regular buggles throw a BuggleWallException exception if you ask them to traverse a wall. They throw a NoBaggleUnderBuggleException exception if you ask them to pickup a baggle from an empty cell, or a AlreadyHaveBaggleException exception if they already carry a baggle. Trying to drop a baggle on a cell already containing one throws an AlreadyHaveBaggleException exception. Dropping a baggle when you have none throws a DontHaveBaggleException.
ta: Regular buggles throw a BuggleWallException exception if you ask them பெறுநர் traverse a wall. They throw a NoBaggleUnderBuggleException exception if you ask them பெறுநர் pickup a baggle இருந்து an வெறுமை cell, or a AlreadyHaveBaggleException exception if they already carry a baggle. Trying பெறுநர் drop a baggle on a கலன் already containing one throws an AlreadyHaveBaggleException exception. Dropping a baggle when you have எதுவுமில்லை throws a DontHaveBaggleException.

source: SimpleBuggles (ie, the one used in first exercises) display an error message on problem so that you don't need to know what an exception is.
ta: SimpleBuggles (ie, the one used in first exercises) காட்சி an பிழை செய்தி on problem so that you don't need பெறுநர் know what an exception is.

source: This world is a simplistic testing environment largely inspired from the http://codingbat.com invented by Nick Parlente.
ta: This world is a simplistic testing சூழல் largely inspired இருந்து the http://codingbat.com invented by Nick Parlente.

source: The typical exercises are very short ones, aiming at improving the tactical programming abilities of the students. That is to say that you will be presented a quite long list of very little exercises about rather simple things. The idea is to train you on these issues until they become automatic to you.
ta: The typical exercises அரே very குறுக்கு ones, aiming at improving the tactical programming abilities of the students. That is பெறுநர் say that you will be presented a quite long பட்டியல் of very little exercises பற்றி rather simple things. The idea is பெறுநர் train you on these issues until they become automatic பெறுநர் you.

source: In contrary to the other worlds, the BatWorld does not provide any fancy abstraction nor visualization. You have to fill a function, which gets called for a bunch of parameter sets, and that's it.
ta: In contrary பெறுநர் the மற்றொன்று worlds, the BatWorld does not provide any fancy abstraction nor visualization. You have பெறுநர் fill a function, which gets called க்கு a bunch of கூறளவு sets, and that's it.

source: For more information, you should refer to the CodingBat.com documentation, which contains for example a very useful documentation on boolean operators: http://codingbat.com/doc/ifboolean.html
ta: க்கு more information, you should refer பெறுநர் the CodingBat.com documentation, which contains க்கு example a very useful ஆவணப்படுத்துதல் on boolean operators: http://codingbat.com/doc/ifboolean.html

source: First steps
ta: First படிகள்

source: This first lesson will lead your first steps in programming. It is intended for beginners. List of seen notions per exercise:
ta: This first பாடம் will ஈயம் your first படிகள் in programming. It is intended க்கு beginners. பட்டியல் of seen notions per exercise:

source: While loops
ta: While வளையங்கள்

source: Variables
ta: மாறிகள்

source: For loops
ta: க்கு வளையங்கள்

source: Do/While loops
ta: Do/While வளையங்கள்

source: Methods
ta: முறைகள்

source: Switch
ta: ஆளி, நிலைமாறி

source: Java Instructions
ta: சாவா Instructions

source: Writing more complex programs
ta: Writing more அணைவு திட்டங்கள்

source: Storing and manipulating data
ta: Storing and manipulating தகவல்கள்

source: Do .. while loops
ta: Do .. while வளையங்கள்

source: Methods returning a result
ta: முறைகள் returning a result

source: Methods with parameters
ta: முறைகள் with parameters

source: Even more pattern to draw
ta: இரட்டை more pattern பெறுநர் draw

source: Buggle Dance Revolution
ta: Buggle Dance சுற்று

source: Buggle Dance Revolution 2
ta: Buggle Dance சுற்று 2

source: Slug Hunting
ta: குருட்டடி Hunting

source: Slug Tracking
ta: குருட்டடி Tracking

source: Traversal by column
ta: Traversal by நெடுவரிசை

source: Traversal by line
ta: Traversal by வரி

source: Diagonal Traversal
ta: மூலைவிட்டம் Traversal

source: Meaning of the symbols
ta: Meaning of the குறியிடுகள்

source: You will learn the very basics of programming. At least, you will be presented the most important concepts, allowing you to read most simple algorithms. You will not be able to write or read full programs because you will still not know about objects, but you will master what is called "Tactical programming", meaning that you will master the syntax enough to not have any issue with it, allowing you to focus on the fundamental problems of what you want to solve instead of struggling with syntactic difficulties.
ta: You will learn the very basics of programming. At least, you will be presented the பெரும்பாலானவை important concepts, allowing you பெறுநர் read பெரும்பாலானவை simple algorithms. You will not be able பெறுநர் write or read full திட்டங்கள் because you will still not know பற்றி objects, but you will master what is called "Tactical programming", meaning that you will master the syntax enough பெறுநர் not have any சிக்கல் with it, allowing you பெறுநர் குவி on the fundamental problems of what you want பெறுநர் solve instead of struggling with syntactic difficulties.

source: This first lesson will lead your first steps in programming. It is intended for beginners.
ta: This first பாடம் will ஈயம் your first படிகள் in programming. It is intended க்கு beginners.

source: If you are not sure, go for this lesson that will teach you the bases of programming.
ta: If you அரே not sure, go க்கு this பாடம் that will teach you the bases of programming.

source: Welcome to the PLM
ta: Welcome பெறுநர் the PLM

source: The goal of this first exercise is to instruct your buggle to move forward by one step. Switch between the views on the right for more info. <i>World</i> depicts the world as it is now, while <i>Objective</i> depicts what you should get.
ta: The goal of this first exercise is பெறுநர் instruct your buggle பெறுநர் move forward by one step. ஆளி, நிலைமாறி between the காட்சிகள் on the வலது க்கு more info. <i>World</i> depicts the world அச் it is now, while <i>Objective</i> depicts what you should get.

source: Buggles are little animals obeying any order you may give them. Currently, you must use the [!thelang/] programming language for that, but you can change the language from the menu, or by clicking the icon in the status bar.
ta: Buggles அரே little animals obeying any order you சி-வைகாசி give them. Currently, you must use the [!thelang/] programming மொழி க்கு that, but you can change the மொழி இருந்து the menu, or by clicking the icon in the நிலை bar.

source: How to proceed?
ta: How பெறுநர் proceed?

source: Write your program in the "Code" pane. It should read as follows:
ta: Write your திட்டம் in the "Code" pane. It should read அச் follows:

source: Do not forget the final <code>;</code> which tells the compiler that the instruction is over (yes, computers are so dumb that they cannot <i>guess</i> obvious stuff like this).
ta: Do not forget the final <code>;</code> which tells the தொகுப்பி that the instruction is வீச்சலகு (yes, computers அரே so dumb that they cannot <i>guess</i> obvious stuff like this).

source: Once done, click on Run to execute your code.
ta: Once done, click on ஓடு பெறுநர் execute your code.

source: If your code contains errors, that's perfectly OK: Even talented programmers struggle on their code. The computer will display error messages in the console to help you fixing them. These messages may sound scary at first glance, but don't panic. The compiler is only somehow limited in its communication abilities, but it's not mean. If you look closer, the solution to solve your issue is written somewhere in those cryptic messages. You will see, with a bit of habit, we get used to it.
ta: If your குறியீடு contains errors, that's perfectly OK: இரட்டை talented programmers struggle on their code. The கணிப்பொறி, கணிணி will காட்சி பிழை செய்திகள் in the console பெறுநர் உதவி you fixing them. These செய்திகள் சி-வைகாசி sound scary at first glance, but don't panic. The தொகுப்பி is only somehow limited in its communication abilities, but it's not mean. If you look closer, the நீர்மக்கூழ் பெறுநர் solve your சிக்கல் is written somewhere in those cryptic messages. You will see, with a துணுக்கு of habit, we get used பெறுநர் it.

source: Currently, the PLM is configured to accept [!thelang] programs, but it can also accept [!java]Python or Scala[/!][!scala]Java or Python[/!][!python]Java or Scala[/!] programs. Either click on the language icon at the very bottom right of the window, or head to the <tt>Language/Computer</tt> menu item to change it.
ta: Currently, the PLM is configured பெறுநர் ஏற்றுக்கொள் [!thelang] programs, but it can also ஏற்றுக்கொள் [!java]Python or Scala[/!][!scala]Java or Python[/!][!python]Java or Scala[/!] programs. Either click on the மொழி icon at the very கீழே வலது of the window, or head பெறுநர் the <tt>Language/Computer</tt> பட்டியல் item பெறுநர் change it.

source: Congratulations! You just wrote your first program! You got the idea now: programming is nothing more than giving simple instructions to the computer that blindly apply them. The main difficulty is to explain stuff to something as stupid as a computer...
ta: Congratulations! You just wrote your first program! You got the idea now: programming is nothing more than giving simple instructions பெறுநர் the கணிப்பொறி, கணிணி that blindly இடு them. The main difficulty is பெறுநர் explain stuff பெறுநர் something அச் stupid அச் a computer...

source: Our second program will be a bit more complicated, but not much. The goal for your buggle is simply to draw a house (a box), and hide inside. Check the objective world to see exactly what this means.
ta: Our second திட்டம் will be a துணுக்கு more complicated, but not much. The goal க்கு your buggle is simply பெறுநர் draw a house (a box), and மறை inside. சரிபார் the objective world பெறுநர் see exactly what this means.

source: For that, you will need <code>forward()</code>, <code>left()</code> and <code>right()</code>. Use your brush to mark the ground as you walk. Start marking the ground with <code>brushDown()</code>, and stop it with <code>brushUp()</code> afterward (e.g., to enter your house without marking its ground).
ta: க்கு that, you will need <code>forward()</code>, <code>left()</code> and <code>right()</code>. Use your மின்தொடி பெறுநர் mark the ground அச் you walk. தொடங்கு marking the ground with <code>brushDown()</code>, and நிறுத்து it with <code>brushUp()</code> afterward (e.g., பெறுநர் enter your house without marking its ground).

source: Programs are mainly suites of method calls, which are no more than a list of simple orders given to the machine. It is very similar to a recipe stating <i>Melt the chocolate pieces, add sugar, cool the mix and serve</i>. [!thelang] wants to have the instructions separated by semi-columns (;)[!python|scala] or by new lines[/!], and followed by parenthesis. Our little receipe would thus be written in the following way[!python|scala] (you can also add semi-columns at the end of the lines, but this is not mandatory)[/!].
ta: திட்டங்கள் அரே mainly suites of method calls, which அரே இல்லை more than a பட்டியல் of simple orders given பெறுநர் the machine. It is very similar பெறுநர் a recipe stating <i>Melt the சாக்லேட் pieces, கூட்டு sugar, cool the mix and serve</i>. [!thelang] wants பெறுநர் have the instructions separated by semi-columns (;)[!python|scala] or by புதிய lines[/!], and followed by parenthesis. Our little receipe would thus be written in the following way[!python|scala] (you can also கூட்டு semi-columns at the end of the lines, but this is not mandatory)[/!].

source: Do not write it all on one line only even if the computer would accept it [!python|scala](provided that you don't omit the semi-columns)[/!]. This is a <b>really bad idea</b>, hindering the readability. <i>Programs must be written for people to read, and only incidentally for machines to execute,</i> as said Harold Abelson.
ta: Do not write it அனைத்தும் on one வரி only இரட்டை if the கணிப்பொறி, கணிணி would ஏற்றுக்கொள் it [!python|scala](provided that you don't omit the semi-columns)[/!]. This is a <b>really bad idea</b>, hindering the readability. <i>Programs must be written க்கு people பெறுநர் read, and only incidentally க்கு machines பெறுநர் execute,</i> அச் said Harold Abelson.

source: There is a limited set of instructions that buggles understand, and we will eventually learn how to define new ones. For now, there is a method for each button of the interactive control panel. To achieve the same effect than the <b>forward</b> button (making the buggle moving one step forward), you need to write the following in the editor:
ta: There is a limited கணம் of instructions that buggles understand, and we will eventually learn how பெறுநர் define புதிய ones. க்கு now, there is a method க்கு each button of the interactive control panel. பெறுநர் achieve the same விளைவு than the <b>forward</b> button (making the buggle moving one படி forward), you need பெறுநர் write the following in the ஆசிரியர்:

source: Likewise, to achieve the same effect than the <b>[!java|scala|python]backward[/!][!c]stepBackward[/!]</b>, <b>left</b> and <b>right</b> buttons, you need to use respectively:
ta: Likewise, பெறுநர் achieve the same விளைவு than the <b>[!java|scala|python]backward[/!][!c]stepBackward[/!]</b>, <b>left</b> and <b>right</b> buttons, you need பெறுநர் use respectively:

source: The <b>mark</b> button is a bit particular, since it correspond to two methods: the first one moves the pen up while the second moves it down.
ta: The <b>mark</b> button is a துணுக்கு particular, since it correspond பெறுநர் two methods: the first one moves the pen மேலே while the second moves it down.

source: The buggle offers other methods, that are presented from the "Help/about this world" menu and will be introduced on need.
ta: The buggle offers மற்றொன்று methods, that அரே presented இருந்து the "Help/about this world" பட்டியல் and will be introduced on need.

source: Now that we know how to draw things on the board, we'll enjoy this ability and draw a beautiful G on the board (check Objective panel for details on what is expected).
ta: Now that we know how பெறுநர் draw things on the board, we'll enjoy this திறமை and draw a beautiful G on the board (check Objective panel க்கு details on what is expected).

source: When you write a quite complex program, it is sometimes useful to <b>add comments</b> to simplify the code reviews afterward. Here for example, it's quite easy to get lost in the drawing process, and you may want to add comments like <i>vertical bar done</i> or <i>finished drawing the G. Time to move back to initial position</i>. Commenting your code is almost mandatory if you (or someone else) want to read it afterward, although over-commenting (describing obvious stuff) is a bad idea as the important idea get lost in the noise.
ta: When you write a quite அணைவு program, it is sometimes useful பெறுநர் <b>add comments</b> பெறுநர் simplify the குறியீடு reviews afterward. Here க்கு example, it's quite easy பெறுநர் get lost in the drawing process, and you சி-வைகாசி want பெறுநர் கூட்டு comments like <i>vertical மதுக்கூடம் done</i> or <i>finished drawing the G. Time பெறுநர் move பின் பெறுநர் initial position</i>. Commenting your குறியீடு is almost mandatory if you (or someone else) want பெறுநர் read it afterward, although over-commenting (describing obvious stuff) is a bad idea அச் the important idea get lost in the noise.

source: There is [!java]three[/!][!python|scala|c]two[/!] types of comments in [!thelang], instructing the [!java|scala|c]compiler[/!][!python]interpreter[/!] to not read the text you add for humans:
ta: There is [!java]three[/!][!python|scala|c]two[/!] வகைகள் of comments in [!thelang], instructing the [!java|scala|c]compiler[/!][!python]interpreter[/!] பெறுநர் not read the உரை you கூட்டு க்கு humans:

source: <b>Comments on a single line</b>. When the [!java|scala|c]compiler[/!][!python]interpreter[/!] encounters the symbol [!java|scala|c]//[/!][!python]#[/!], it ignores the end of the line.
ta: <b>Comments on a ஒற்றை line</b>. When the [!java|scala|c]compiler[/!][!python]interpreter[/!] encounters the symbol [!java|scala|c]//[/!][!python]#[/!], it ignores the end of the line.

source: <b>Comments on several lines</b>. The [!java|scala|c]compiler[/!][!python]interpreter[/!] ignores anything placed between [!java|scala|c]the symbols /* and */ even if they are placed on differing lines.[/!] [!python]a line beginning with ''' until the next line ending with '''.[/!]
ta: <b>Comments on several lines</b>. The [!java|scala|c]compiler[/!][!python]interpreter[/!] ignores anything placed between [!java|scala|c]the குறியிடுகள் /* and */ இரட்டை if they அரே placed on differing lines.[/!] [!python]a வரி beginning with ''' until the அடுத்தது வரி ending with '''.[/!]

source: methodCallReadByThe[!java|scala|c]Compiler[/!][!python]Interpreter[/!]()[!java|c];[/!] <span class="comment">[!java|scala|c]//[/!][!python]#[/!] all this is ignored</span> otherCall()[!java|c];[/!] [!java|scala|c]<span class="comment">/* This is</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> also ignored */</span>[/!] [!python]<span class="comment">''' This is</span> <span class="comment">also ignored '''</span>[/!] yetAnotherCall()[!java|c];[/!]
ta: methodCallReadByThe[!java|scala|c]Compiler[/!][!python]Interpreter[/!]()[!java|c];[/!] <span class="comment">[!java|scala|c]//[/!][!python]#[/!] அனைத்தும் this is ignored</span> otherCall()[!java|c];[/!] [!java|scala|c]<span class="comment">/* This is</span> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <span class="comment"> also ignored */</span>[/!] [!python]<span class="comment">''' This is</span> <span class="comment">also ignored '''</span>[/!] yetAnotherCall()[!java|c];[/!]

source: There is a third kind of comments in Java, between /** and */, which are read by a specific program called JavaDoc to generate automatically the documentation explaining how to use the code. These comments must follow a very precise formalism.
ta: There is a third kind of comments in Java, between /** and */, which அரே read by a specific திட்டம் called JavaDoc பெறுநர் generate automatically the ஆவணப்படுத்துதல் explaining how பெறுநர் use the code. These comments must follow a very precise formalism.

source: The comments on several lines are often used to document how to use the code, while others are more used to describe how this code works.
ta: The comments on several வரிகள் அரே often used பெறுநர் ஆவணம் how பெறுநர் use the code, while others அரே more used பெறுநர் describe how this குறியீடு works.

source: Programs made of simple suite of instructions similar to previous exercise are quite boring. They always do the same thing, and cannot react to external conditions. A <b>conditional</b> let the program adapt by doing something like <i>if it's raining, take an umbrella</i>.
ta: திட்டங்கள் made of simple suite of instructions similar பெறுநர் previous exercise அரே quite boring. They எப்போதும் do the same thing, and cannot react பெறுநர் external conditions. A <b>conditional</b> let the திட்டம் adapt by doing something like <i>if it's raining, take an umbrella</i>.

source: If the condition is true, the code of the next block will be executed and then it will continue with the rest of the code. If the condition is false, the next block is ignored and the execution continues after it. The conditional block can contain several instructions, it can even contain other tests, along with their sub-blocks.
ta: If the condition is true, the குறியீடு of the அடுத்தது block will be executed and then it will தொடரவும் with the rest of the code. If the condition is false, the அடுத்தது block is ignored and the execution continues after it. The conditional block can contain several instructions, it can இரட்டை contain மற்றொன்று tests, along with their sub-blocks.
