Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Write a function that computes the Nth element of the sequence.
ta: Write a சார்பு that computes the Nth தனிமம் of the sequence.

source: You just received the traveling notes of your old aunt who traveled accross the country of the Buggles' Islands. She wrote down the altitude every kilometer during her trip, resulting in a sequence of numbers as follows.
ta: You just received the traveling notes of your old aunt who traveled accross the நாடு of the Buggles' Islands. சீ wrote down the குத்துயரம் every kilometer during her trip, resulting in a வரிசை of numbers அச் follows.

source: Here is a cut of the islands on that path:
ta: Here is a வெட்டு of the islands on that path:

source: /***\ /*\ &lt;-- 2 meters above the see level /***********\ /*******\ &lt;-- 1 meter above the see level *************************** &lt;-- see level | | | | | | | | | | | | | | 0 0 1 1 2 2 1 1 0 1 2 1 1 0 &lt;-- altitude on each point
ta: /***\ /*\ &lt;-- 2 meters above the see level /***********\ /*******\ &lt;-- 1 அளவி above the see level *************************** &lt;-- see level | | | | | | | | | | | | | | 0 0 1 1 2 2 1 1 0 1 2 1 1 0 &lt;-- குத்துயரம் on each point

source: This example is constituted of four levels of island:
ta: This example is constituted of நான்கு, நாலடி, நான்கடி levels of island:

source: 2 2 (the mountain topping the left island)
ta: 2 2 (the mountain topping the இடது island)

source: 1 2 1 1 (the right island)
ta: 1 2 1 1 (the வலது island)

source: Could you write a little program to compute the amount of levels in a given sequence of altitudes? Actually, there is an iterative and a recursive solution to that problem.
ta: Could you write a little திட்டம் பெறுநர் compute the amount of levels in a given வரிசை of altitudes? Actually, there is an iterative and a recursive நீர்மக்கூழ் பெறுநர் that problem.

source: We will now write our own methods. It somehow comes down to extending the buggle vocabulary by teaching it new tricks.
ta: We will now write our own methods. It somehow comes down பெறுநர் extending the buggle vocabulary by teaching it புதிய tricks.

source: For example, we saw in a previous exercise how to ask the buggle to go get the baggle in front of it, and bring it back. If there is several baggles on the board, and if we want to bring all of them on the bottom line, you have to repeat this code several times, or include it in a loop. In any case, you should avoid to duplicate your code to keep it pleasant to read and easily understandable. It would be better if the buggle could obey an <code>goAndGet()</code> order just like it understands a <code>[!c]stepForward()[/!][!scala|java|python]forward()[/!]</code> one.
ta: க்கு example, we saw in a previous exercise how பெறுநர் ask the buggle பெறுநர் go get the baggle in front of it, and bring it back. If there is several baggles on the board, and if we want பெறுநர் bring அனைத்தும் of them on the கீழே line, you have பெறுநர் repeat this குறியீடு several times, or include it in a loop. In any case, you should avoid பெறுநர் duplicate your குறியீடு பெறுநர் keep it pleasant பெறுநர் read and easily understandable. It would be better if the buggle could obey an <code>goAndGet()</code> order just like it understands a <code>[!c]stepForward()[/!][!scala|java|python]forward()[/!]</code> one.

source: Defining methods
ta: Defining முறைகள்

source: The [!thelang] syntax to write a simple method called <code>goAndGet</code> is the following:
ta: The [!thelang] syntax பெறுநர் write a simple method called <code>goAndGet</code> is the following:

source: The method body [!java|scala|c](between curly braces)[/!][!python](the indented block)[/!] will be executed when we call the method later on (that is, when we write <code>goAndGet()</code> somewhere in our code). This method body can contain as many instructions as you want, and any construction we saw so far (for, while, if, etc). [!java|c]The <code>void</code> keyword means that this method does not return any result. For example, the <code>isOverBaggle()</code> method does return a result, which is a [!c]int[/!][!java]boolean[/!] indicating whether or not the buggle is located over a baggle. We will soon learn to define such methods too. For now, just write <code>void</code> at this location.[/!]
ta: The method body [!java|scala|c](between curly braces)[/!][!python](the indented block)[/!] will be executed when we call the method later on (that is, when we write <code>goAndGet()</code> somewhere in our code). This method body can contain அச் many instructions அச் you want, and any construction we saw so far (for, while, if, etc). [!java|c]The <code>void</code> keyword means that this method does not return any result. க்கு example, the <code>isOverBaggle()</code> method does return a result, which is a [!c]int[/!][!java]boolean[/!] indicating whether or not the buggle is located வீச்சலகு a baggle. We will soon learn பெறுநர் define such முறைகள் too. க்கு now, just write <code>void</code> at this location.[/!]

source: Documenting methods
ta: Documenting முறைகள்

source: You should strive to document your code to keep it readable. When you write it, its purpose and limitations are clear to you, but most of the time, this does not last for long. You will soon forget about the details of every specific method, and this day you will be happy to read its documentation. In the following example, we use the specific formalism of [!java]javadoc[/!][!scala]scaladoc[/!][!python]pydoc[/!], a program that extracts the documentation of [!thelang] source code to produce html pages. The main advantage is that it allows to keep the documentation near to the code. So, when you change your code, you have less chances to forget to update the documentation.
ta: You should strive பெறுநர் ஆவணம் your குறியீடு பெறுநர் keep it readable. When you write it, its purpose and limitations அரே clear பெறுநர் you, but பெரும்பாலானவை of the time, this does not last க்கு long. You will soon forget பற்றி the details of every specific method, and this நாள் you will be happy பெறுநர் read its documentation. In the following example, we use the specific formalism of [!java]javadoc[/!][!scala]scaladoc[/!][!python]pydoc[/!], a திட்டம் that extracts the ஆவணப்படுத்துதல் of [!thelang] மூலம் குறியீடு பெறுநர் produce உஉகுமொ pages. The main advantage is that it allows பெறுநர் keep the ஆவணப்படுத்துதல் near பெறுநர் the code. So, when you change your code, you have less chances பெறுநர் forget பெறுநர் புதுப்பிப்பு the documentation.

source: [!java|scala][!java]javadoc[/!][!scala]scaladoc[/!] comments begin with the <code>/**</code> marker (with two asterisks). They must be placed right before the method they document for the tool to find them.[/!] [!python]pydoc comments should be placed at the beginning of the method body so that the tool finds them. They should be placed between <code>"""</code>, which mark multi-line strings in python.[/!] The first line should be a brief description of what this method does while any subsequent lines should provide any important details about the method.
ta: [!java|scala][!java]javadoc[/!][!scala]scaladoc[/!] comments begin with the <code>/**</code> marker (with two asterisks). They must be placed வலது before the method they ஆவணம் க்கு the கருவி பெறுநர் கண்டுபிடி them.[/!] [!python]pydoc comments should be placed at the beginning of the method body so that the கருவி finds them. They should be placed between <code>"""</code>, which mark multi-line சரங்கள் in python.[/!] The first வரி should be a brief விவரம் of what this method does while any subsequent வரிகள் should provide any important details பற்றி the method.

source: [!java|scala]/** * Go, retrieves the baggle in front of the buggle, and brings it back * * Does not check for walls, so be careful to not call it when walls are present. */[/!] [!java]void goAndGet() {[/!] [!scala]def goAndGet() {[/!] [!python]def goAndGet(): """Go, retrieves the baggle in front of the buggle, and brings it back. Does not check for walls, so be careful to not call it when walls are present."""[/!] actions()[!java];[/!] to()[!java];[/!] do()[!java];[/!] [!java|scala]}[/!]
ta: [!java|scala]/** * Go, retrieves the baggle in front of the buggle, and brings it பின் * * Does not சரிபார் க்கு walls, so be careful பெறுநர் not call it when walls அரே present. */[/!] [!java]void goAndGet() {[/!] [!scala]def goAndGet() {[/!] [!python]def goAndGet(): """Go, retrieves the baggle in front of the buggle, and brings it back. Does not சரிபார் க்கு walls, so be careful பெறுநர் not call it when walls அரே present."""[/!] actions()[!java];[/!] to()[!java];[/!] do()[!java];[/!] [!java|scala]}[/!]

source: Most programming language forbid the use of spaces in method and variable identifiers (=their names). Accented letters are sometimes allowed (as in [!thelang]), but they can lead to portability issues between operating systems and should thus be avoided when possible.
ta: பெரும்பாலானவை programming மொழி forbid the use of இடங்கள் in method and variable identifiers (=their names). Accented letters அரே sometimes allowed (as in [!thelang]), but they can ஈயம் பெறுநர் portability issues between operating systems and should thus be avoided when possible.

source: Across all programming languages, there is two main conventions to name variables and methods. The first one, consists in concatenating all words with only the first letter of each word in upper case. "go and get" becomes goAndGet(). It is called CamelCase because identifiers written this way graphically remind of a camel back. The other convention, called snake_case, is to write every words in lower case, separated with underscores symbols (_). "go and get" becomes go_and_get().
ta: Across அனைத்தும் programming languages, there is two main conventions பெறுநர் பெயர் மாறிகள் and methods. The first one, consists in concatenating அனைத்தும் சொற்கள் with only the first letter of each சொல் in upper case. "go and get" becomes goAndGet(). It is called CamelCase because identifiers written this way graphically remind of a camel back. The மற்றொன்று convention, called snake_case, is பெறுநர் write every சொற்கள் in lower case, separated with underscores குறியிடுகள் (_). "go and get" becomes go_and_get().

source: Which convention to use is the topic of heated discussion across developers, but each programming language has its own habits. In Python, Perl and the C language, the snake_case is often used for methods and variables. Java and Scala prefer the lowerCamelCase (the very first letter is lower case) for that.
ta: Which convention பெறுநர் use is the topic of heated discussion across developers, but each programming மொழி has its own habits. In Python, பெர்ல் and the C language, the snake_case is often used க்கு முறைகள் and variables. சாவா and Scala prefer the lowerCamelCase (the very first letter is lower case) க்கு that.

source: The CamelCase convention is used everywhere in PLM because this program is written in Java itself, so we kept our habits when adding new languages. But the fact that the Python bindings of PLM use the CamelCase instead of the snake_case is considered as a bug that we will fix in further releases.
ta: The CamelCase convention is used everywhere in PLM because this திட்டம் is written in சாவா itself, so we kept our habits when adding புதிய languages. But the fact that the பைதான் bindings of PLM use the CamelCase instead of the snake_case is considered அச் a பிழை that we will fix in further releases.

source: The goal of this exercise is to write a method called <code>goAndGet()</code> which does the same than in a previous exercises (move forward until over a baggle, pick it up, move back to initial position, drop baggle).
ta: The goal of this exercise is பெறுநர் write a method called <code>goAndGet()</code> which does the same than in a previous exercises (move forward until வீச்சலகு a baggle, pick it up, move பின் பெறுநர் initial position, drop baggle).

source: This exercise is a bit different because you will not write all of the code executed by the buggle. Instead, you should only write one method that get called automagically added when you click on <b>Start</b>. Your buggle calls your <code>goAndGet()</code> method on each row, until the baggle is found. [!python|scala]The code for that is already provided under the <code>goAndGet()</code> method, but you probably don't want to change it.[/!] [!java]You don't need to write the code calling <code>goAndGet()</code> yourself. It's automagically there already, even if you cannot see it.[/!]
ta: This exercise is a துணுக்கு different because you will not write அனைத்தும் of the குறியீடு executed by the buggle. Instead, you should only write one method that get called automagically added when you click on <b>Start</b>. Your buggle calls your <code>goAndGet()</code> method on each row, until the baggle is found. [!python|scala]The குறியீடு க்கு that is already provided under the <code>goAndGet()</code> method, but you probably don't want பெறுநர் change it.[/!] [!java]You don't need பெறுநர் write the குறியீடு calling <code>goAndGet()</code> yourself. It's automagically there already, இரட்டை if you cannot see it.[/!]

source: But for that to work, you have to actually write this <code>goAndGet()</code> method now.
ta: But க்கு that பெறுநர் work, you have பெறுநர் actually write this <code>goAndGet()</code> method now.

source: We now would like to teach the buggle to build a doghouse. The naive approach consists in directly writing the needed code as follows. This works because the buggle of this exercise leaves a red path as it moves.
ta: We now would like பெறுநர் teach the buggle பெறுநர் உருவாக்கு a doghouse. The naive approach consists in directly writing the needed குறியீடு அச் follows. This works because the buggle of this exercise leaves a சிவப்பு பாதை அச் it moves.

source: It becomes harder when we want to draw two doghouses: we have to rewrite the same code twice, which is not really handy. When the code becomes a bit long as this one, it becomes easier to see why we insist since a while on the pure evilness that code duplication represents. Indeed, if you realize that an error sneaked into a code that you copied at several locations, you will have to fix it several times. And mind your back if you forget one of these locations.
ta: It becomes harder when we want பெறுநர் draw two doghouses: we have பெறுநர் rewrite the same குறியீடு twice, which is not really handy. When the குறியீடு becomes a துணுக்கு long அச் this one, it becomes easier பெறுநர் see why we insist since a while on the pure evilness that குறியீடு படியீடு represents. Indeed, if you realize that an பிழை sneaked into a குறியீடு that you copied at several locations, you will have பெறுநர் fix it several times. And mind your பின் if you forget one of these locations.

source: There is even a name to this good principle in programming: DRY/SPOT, which means "Don't Repeat Yourself / Single Point Of Truth". The latter part means that each information must be written in only one location of your program to avoid the differing locations to get out of synch when you modify your code.
ta: There is இரட்டை a பெயர் பெறுநர் this good principle in programming: DRY/SPOT, which means "Don't Repeat Yourself / ஒற்றை புள்ளியம் Of Truth". The latter பகுதி means that each செய்தி must be written in only one location of your திட்டம் பெறுநர் avoid the differing locations பெறுநர் get out of synch when you modify your code.

source: So, let's apply this good principle and <b>factorize our code</b>, ie to write it only once, for example in a method. You should even to go further by factorizing the method body with a <code>for</code> loop, as seen previously. If you do it correctly (what you should), you can use the method <code>left()</code> only once.
ta: So, let's இடு this good principle and <b>factorize our code</b>, ie பெறுநர் write it only once, க்கு example in a method. You should இரட்டை பெறுநர் go further by factorizing the method body with a <code>for</code> loop, அச் seen previously. If you do it correctly (what you should), you can use the method <code>left()</code> only once.

source: The goal of this exercise is to write a method called <code>dogHouse</code> achieving the same result than the code above, but with a for loop to keep it short. The buggle will call your creation to create several dog houses around its world.
ta: The goal of this exercise is பெறுநர் write a method called <code>dogHouse</code> achieving the same result than the குறியீடு above, but with a க்கு loop பெறுநர் keep it short. The buggle will call your creation பெறுநர் create several dog houses around its world.

source: Your goal (here and in any well written program) is to write the simplest possible code. For that, you have to decompose your work in sub-steps, and write a specific method for each sub-step.
ta: Your goal (here and in any well written program) is பெறுநர் write the simplest possible code. க்கு that, you have பெறுநர் decompose your வேலை in sub-steps, and write a specific method க்கு each sub-step.

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V. A possible decomposition is to write a method in charge of drawing a V from the current position. Its prototype can be: <code>[!java|c]void [/!]makeV()</code>
ta: If you observe carefully the picture பெறுநர் draw, it is constituted of நான்கு, நாலடி, நான்கடி பாகங்கள் depicting a வரிசைப்படுத்து of V. A possible decomposition is பெறுநர் write a method in மின்னூட்டு of drawing a V இருந்து the மின்னோட்ட்ம், ஓட்டம் position. Its prototype can be: <code>[!java|c]void [/!]makeV()</code>

source: In this method, you should use the methods <code>brushUp()</code> and <code>brushDown()</code> to mark the ground (you may want to factorize this in another method). It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
ta: In this method, you should use the முறைகள் <code>brushUp()</code> and <code>brushDown()</code> பெறுநர் mark the ground (you சி-வைகாசி want பெறுநர் factorize this in another method). It சி-வைகாசி be wise பெறுநர் write the <code>makeV()</code> so that it places directly the buggle in position க்கு the அடுத்தது V.

source: Your turn. Your code should not be longer than 4 lines (not counting <code>makeV</code>)...
ta: Your turn. Your குறியீடு should not be longer than 4 வரிகள் (not counting <code>makeV</code>)...

source: We will now reproduce an even bigger geometrical drawing. Once again, you can see the model by clicking on the "Objective" tab.
ta: We will now reproduce an இரட்டை bigger geometrical drawing. Once again, you can see the மாதிரியுரு by clicking on the "Objective" tab.

source: You can naturally reuse all the code you typed in previous exercise (select the other exercise, do Ctrl-C, come back to the code of this exercise, do Ctrl-V).
ta: You can naturally reuse அனைத்தும் the குறியீடு you typed in previous exercise (select the மற்றொன்று exercise, do Ctrl-C, come பின் பெறுநர் the குறியீடு of this exercise, do Ctrl-V).

source: But you want to keep your code as simple as possible. For that, define new methods to deal simply with the repetitions in the pattern. For example, a method <code>makePattern()</code> achieving the pattern of previous example seems to be a good idea (but this may not be enough).
ta: But you want பெறுநர் keep your குறியீடு அச் simple அச் possible. க்கு that, define புதிய முறைகள் பெறுநர் deal simply with the repetitions in the pattern. க்கு example, a method <code>makePattern()</code> achieving the pattern of previous example seems பெறுநர் be a good idea (but this சி-வைகாசி not be enough).

source: Why don't you give it a shot? The main code method shouldn't take more than 2 lines (included in a for loop)
ta: Why don't you give it a shot? The main குறியீடு method shouldn't take more than 2 வரிகள் (included in a க்கு loop)

source: As you can imagine, you have to reproduce the geometric drawing depicted in the "Objectives" tab. As you can see, it is even bigger than the previous one.
ta: அச் you can imagine, you have பெறுநர் reproduce the geometric drawing depicted in the "Objectives" tab. அச் you can see, it is இரட்டை bigger than the previous one.

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Your turn...
ta: You thus have பெறுநர் declare இரட்டை more முறைகள் பெறுநர் use the repetitions of the pattern and factorize your code. Your turn...

source: Functions
ta: செயல்பாடுகள்

source: Quite often, you want to write a method that compute some value and returns it. Methods returning results are called <b>functions</b>. Writing a function is not really harder than writing a simple method. [!java|c]You simply have to specify the data type of expected results before the function name (where we previously had <code>void</code>).[/!] [!scala]You simply have to add a colon (:) after the parenthesis and write the type of data that your function will return, and add an equal sign (=). This syntax is actually rather close to defining a variable, with its type, that is actually a function.[/!] You can use the <code>return</code> instruction anywhere in your function body to specify that the computation is done (the function is not further executed), and that the result is the value following the <code>return</code> keyword.
ta: Quite often, you want பெறுநர் write a method that compute some மதிப்பு and returns it. முறைகள் returning முடிவுகள் அரே called <b>functions</b>. Writing a சார்பு is not really harder than writing a simple method. [!java|c]You simply have பெறுநர் specify the தகவல்கள் வகை of expected முடிவுகள் before the சார்பு பெயர் (where we previously had <code>void</code>).[/!] [!scala]You simply have பெறுநர் கூட்டு a பெருங்குடல் (:) after the parenthesis and write the வகை of தகவல்கள் that your சார்பு will return, and கூட்டு an equal sign (=). This syntax is actually rather மூடு பெறுநர் defining a variable, with its type, that is actually a function.[/!] You can use the <code>return</code> instruction anywhere in your சார்பு body பெறுநர் specify that the computation is முடிந்தது (the சார்பு is not further executed), and that the result is the மதிப்பு following the <code>return</code> keyword.

source: [!java|c]double pi() {[/!][!scala]def pi(): Double = {[/!][!python]def pi():[/!] return 3.14159[!java|c];[/!] [!java|scala|c]}[/!]
ta: [!java|c]double pi() {[/!][!scala]def pi(): இரட்டை = {[/!][!python]def pi():[/!] return 3.14159[!java|c];[/!] [!java|scala|c]}[/!]

source: Actually, you can also use that <code>return</code> keyword in methods that do not return any result, to interupt the computation. Of course, you should not provide any value to return in that case.
ta: Actually, you can also use that <code>return</code> keyword in முறைகள் that do not return any result, பெறுநர் interupt the computation. Of course, you should not provide any மதிப்பு பெறுநர் return in that case.
