Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: The idea is to traverse all elements of the array, and to insert each of them into its proper position in the already sorted part of the array. When we look at an element x, the situation is the following: any elements to the left of the array are already sorted, and we have to insert x at its position in the array.
ta: The idea is பெறுநர் traverse அனைத்தும் elements of the array, and பெறுநர் செருகவும் each of them into its proper position in the already sorted பகுதி of the array. When we look at an தனிமம் ஃச், the situation is the following: any elements பெறுநர் the இடது of the array அரே already sorted, and we have பெறுநர் செருகவும் ஃச் at its position in the array.

source: The pseudo-code of this algorithm is thus the following:
ta: The pseudo-code of this படிமுறை is thus the following:

source: For each i in [1,len-1] # Cell 0 is already sorted when considered alone store the value of i in a variable v copy the cell i-1 into i if i-1 contains a value bigger than v copy the cell i-2 into i-1 if i-2 contains a value bigger than v copy the cell i-3 into i-2 if i-3 contains a value bigger than v copy the cell i-4 into i-3 if i-4 contains a value bigger than v ... copy v into the last cell copied above
ta: க்கு each i in [1,len-1] # கலன் 0 is already sorted when considered alone store the மதிப்பு of i in a variable v நகலெடு the கலன் i-1 into i if i-1 contains a மதிப்பு bigger than v நகலெடு the கலன் i-2 into i-1 if i-2 contains a மதிப்பு bigger than v நகலெடு the கலன் i-3 into i-2 if i-3 contains a மதிப்பு bigger than v நகலெடு the கலன் i-4 into i-3 if i-4 contains a மதிப்பு bigger than v ... நகலெடு v into the last கலன் copied above

source: Naturally, you should use a loop to write the big permutation within the given loop. Writing it this way would be really ... counter-productive.
ta: Naturally, you should use a loop பெறுநர் write the big வரிசைமாற்றம், வரிசைவகுதி within the given loop. Writing it this way would be really ... counter-productive.

source: If you've always wondered what computer science researchers do nowadays, here is part of the answer: They improve fundamental algorithms so that others can write efficient programs.
ta: If you've எப்போதும் wondered what கணிப்பொறி, கணிணி science researchers do nowadays, here is பகுதி of the விடை: They improve fundamental algorithms so that others can write efficient programs.

source: Other variation of insertion sort
ta: மற்றொன்று variation of insertion வரிசைப்படுத்து

source: TreeSort builds a binary search tree to sort them. It leads to a O(n log(n)) on average, but O(n^2) in worst cases. We won't study this algorithm here since understanding its behavior requires to know what a binary tree is, what is beyond our present goals.
ta: TreeSort builds a இருமம் தேடல் tree பெறுநர் வரிசைப்படுத்து them. It இழுதுகள் பெறுநர் a O(n log(n)) on average, but O(n^2) in worst cases. We won't study this படிமுறை here since understanding its behavior requires பெறுநர் know what a இருமம் tree is, what is beyond our present goals.

source: There is other variations over the insertion sort, such as PatienceSort which builds piles of values and sort each pile afterward. This algorithm presents a 0(n log(n)) timing worst case and a 0(n) space complexity. LibrarySort (proposed in 2004) also trades a bit space in exchange for time since it provide a time complexity of O(n log(n)) but needs to store some more data.
ta: There is மற்றொன்று variations வீச்சலகு the insertion sort, such அச் PatienceSort which builds piles of values and வரிசைப்படுத்து each pile afterward. This படிமுறை presents a 0(n log(n)) நேரவிவரம் worst case and a 0(n) இடைவெளி complexity. LibrarySort (proposed in 2004) also trades a துணுக்கு இடைவெளி in exchange க்கு time since it provide a time complexity of O(n log(n)) but needs பெறுநர் store some more data.

source: Wikipedia provides a detailled description of all these algorithms we cannot present here because of time constraints.
ta: Wikipedia provides a detailled விவரம் of அனைத்தும் these algorithms we cannot present here because of time constraints.

source: This algorithm is named after its author, Donald Shell, who published it in 1959. It can be seen as an application of the CombSort idea (let elements having a long path to travel take shortcuts) to the insertion sort (CombSort is a variation of BubbleSort). Instead of comparing adjacent values during the insertion sort, it compares values separated by a bigger gap. The bigger the gap, the faster the elements are moved to their final destination, but also the less precise is this move. It is thus mandatory to apply the algorithm with a serie of decreasing gaps. At the last step, when the gap is one, InsertionSort is used, but onto an array which is almost already sorted by previous steps.
ta: This படிமுறை is named after its author, Donald Shell, who published it in 1959. It can be seen அச் an application of the CombSort idea (let elements having a long பாதை பெறுநர் travel take shortcuts) பெறுநர் the insertion வரிசைப்படுத்து (CombSort is a variation of BubbleSort). Instead of comparing adjacent values during the insertion sort, it compares values separated by a bigger gap. The bigger the gap, the faster the elements அரே moved பெறுநர் their final destination, but also the less precise is this move. It is thus mandatory பெறுநர் இடு the படிமுறை with a serie of decreasing gaps. At the last step, when the gap is one, InsertionSort is used, but onto an array which is almost already sorted by previous steps.

source: Donald Shell propose <code>len/2</code> as initial value of the gap, and then to divide it by 2 at each step. The pseudo-code is thus the following:
ta: Donald ஓடு propose <code>len/2</code> அச் initial மதிப்பு of the gap, and then பெறுநர் divide it by 2 at each step. The pseudo-code is thus the following:

source: gap=len/2 while gap>0: apply InsertionSort, comparing i-gap and i, then i-2gap and i-gap, then i-3gap and i-2gap, etc.
ta: gap=len/2 while gap>0: இடு InsertionSort, comparing i-gap and i, then i-2gap and i-gap, then i-3gap and i-2gap, etc.

source: Just like in CombSort, the sequence of values taken by the gap is crucial for Shell sort performance. In some rare pathological cases, the sequence we used above can lead to a O(n^2) performance. Other sequences were proposed: the Hibbard's increments of 2k − 1 lead to a complexity of O(n^(3/2)) in worst cases. Pratt's increments 2^i3^j lead to a O(nlog(n)log(n) performance in worst cases. The existance of a sequence leading to a O(n log(n)) was precluded by Poonen, Plaxton, and Suel. Thanks to this performance, ShellSort is a valid candidate for array of several hundred thousands when correctly implemented.
ta: Just like in CombSort, the வரிசை of values taken by the gap is crucial க்கு ஓடு வரிசைப்படுத்து performance. In some rare pathological cases, the வரிசை we used above can ஈயம் பெறுநர் a O(n^2) performance. மற்றொன்று வரிசைகள் were proposed: the Hibbard's increments of 2k − 1 ஈயம் பெறுநர் a complexity of O(n^(3/2)) in worst cases. Pratt's increments 2^i3^j ஈயம் பெறுநர் a O(nlog(n)log(n) performance in worst cases. The existance of a வரிசை leading பெறுநர் a O(n log(n)) was precluded by Poonen, Plaxton, and Suel. Thanks பெறுநர் this performance, ShellSort is a valid candidate க்கு array of several hundred thousands when correctly implemented.

source: In our case, the array are ways too small to benefit of these optimizations. If you ever need to do so, take as initial gap the biggest value of the targeted serie still smaller than the array size, and then use decreasing values of the serie.
ta: In our case, the array அரே ways too small பெறுநர் benefit of these optimizations. If you ever need பெறுநர் do so, take அச் initial gap the biggest மதிப்பு of the targeted serie still smaller than the array size, and then use decreasing values of the serie.

source: Interestingly enough, determining the best gap sequence for shell sort turns into a research issue of our century in computer science. For example, an article of 2001 introduces the following sequence, which seems to be optimal in practice for arrays of size up to 10^5: {1, 4, 10, 23, 57, 132, 301, 701, 1750} (Marcin Ciura, Best Increments for the Average Case of Shellsort, 13th International Symposium on Fundamentals of Computation Theory, LNCS 2001; Vol. 2138).
ta: Interestingly enough, determining the best gap வரிசை க்கு ஓடு வரிசைப்படுத்து turns into a research சிக்கல் of our century in கணிப்பொறி, கணிணி science. க்கு example, an article of 2001 introduces the following sequence, which seems பெறுநர் be optimal in practice க்கு arrays of அளவு மேலே பெறுநர் 10^5: {1, 4, 10, 23, 57, 132, 301, 701, 1750} (Marcin Ciura, Best Increments க்கு the Average Case of Shellsort, 13th International Symposium on Fundamentals of Computation Theory, LNCS 2001; Vol. 2138).

source: Selection Sort
ta: தேர்வு வரிசைப்படுத்து

source: In this exercise we will implement another classical algorithm: selection sort.
ta: In this exercise we will implement another classical algorithm: தேர்வு sort.

source: The idea is simply to select for each cell of the array the smallest value from the part not already sorted. Thus for the first cell, it takes the smallest value over the whole array. For the second one, it takes the second smallest value, which is the smallest value from the cell not already sorted. You of course don't have to sort the last cell of the array, that is already sorted when you consider it.
ta: The idea is simply பெறுநர் தேர்ந்தெடு க்கு each கலன் of the array the smallest மதிப்பு இருந்து the பகுதி not already sorted. Thus க்கு the first cell, it takes the smallest மதிப்பு வீச்சலகு the whole array. க்கு the second one, it takes the second smallest value, which is the smallest மதிப்பு இருந்து the கலன் not already sorted. You of course don't have பெறுநர் வரிசைப்படுத்து the last கலன் of the array, that is already sorted when you consider it.

source: More generally, for the cell N, it looks the cell M in [N;len] containing the smallest possible value of the interval. Then, it swaps the content of cell N with the one of cell M.
ta: More generally, க்கு the கலன் N, it looks the கலன் M in [N;len] containing the smallest possible மதிப்பு of the interval. Then, it swaps the content of கலன் N with the one of கலன் M.

source: Another classical algorithm which idea is based on the selection of good elements is HeapSort, but it uses a heap data structure which we did not see yet. Simply remember that HeapSort provides a O(n log n) performance in worst case, which is why it is a very interesting algorithm in practice.
ta: Another classical படிமுறை which idea is based on the தேர்வு of good elements is HeapSort, but it uses a heap தகவல்கள் structure which we did not see yet. Simply remember that HeapSort provides a O(n log n) performance in worst case, which is why it is a very interesting படிமுறை in practice.

source: We saw that CocktailSort improve a bit for turtles (i.e. small values near to the end of the array), but it is still possible to achieve better. ComboSort comes down to providing them a short cut: instead of comparing adjacent values, we compare values separated by a gap bigger than 1. That way, turtles will traverse <i>gap</i> cells at each traversal. Naturally, we have to apply the algorithm with decreasing gaps, and finish with <i>gap=1</i> to ensure that the array is correctly sorted afterward. Choosing the right gap and how to decrease it is a difficult question, but in practice, dividing it by 1.3 after each traversal leads to good performance. Here is the corresponding pseudo-code:
ta: We saw that CocktailSort improve a துணுக்கு க்கு turtles (i.e. small values near பெறுநர் the end of the array), but it is still possible பெறுநர் achieve better. ComboSort comes down பெறுநர் providing them a குறுக்கு cut: instead of comparing adjacent values, we compare values separated by a gap bigger than 1. That way, turtles will traverse <i>gap</i> cells at each traversal. Naturally, we have பெறுநர் இடு the படிமுறை with decreasing gaps, and finish with <i>gap=1</i> பெறுநர் ensure that the array is correctly sorted afterward. Choosing the வலது gap and how பெறுநர் decrease it is a difficult question, but in practice, dividing it by 1.3 after each traversal இழுதுகள் பெறுநர் good performance. Here is the corresponding pseudo-code:

source: One tricky part is that we want to divide gap, that is an integer (of type Int), by 1.3, that is a Double. The type system of scala won't let us do this, because such discrepancy usually denotes a programmer error. As this is not an error this time, we have to convert gap to Double for the time of the operation, and then convert the result back to Int to store it into gap. This should be written this way:
ta: One tricky பகுதி is that we want பெறுநர் divide gap, that is an முழு எண் (of வகை Int), by 1.3, that is a Double. The வகை மண்டலம் of scala won't let us do this, because such discrepancy usually denotes a நிரலி (device), நிரலர் (person) error. அச் this is not an பிழை this time, we have பெறுநர் convert gap பெறுநர் இரட்டை க்கு the time of the operation, and then convert the result பின் பெறுநர் Int பெறுநர் store it into gap. This should be written this way:

source: This is rather verbose, but actually, this notation is not very complex. And remember that the type checker is your friend. It's picky and sometimes annoying (as on this one), but it often catches weird bugs that would have been a pain to debug if not catch by the type checker. And since the Scala's authors are pragmatic, the previous expression can be simplified:
ta: This is rather verbose, but actually, this notation is not very complex. And remember that the வகை checker is your friend. It's எடுத்துரை and sometimes annoying (as on this one), but it often catches weird bugs that would have been a pain பெறுநர் debug if not catch by the வகை checker. And since the Scala's ஆசிரியர்கள் அரே pragmatic, the previous கோவை can be simplified:

source: <code>toDouble</code> and <code>toInt</code> are just shortcuts for the corresponding expressions <code>asInstanceOf[Double]</code> and <code>asInstanceOf[Int]</code>. It's not very generic, but it's very handy.
ta: <code>toDouble</code> and <code>toInt</code> அரே just shortcuts க்கு the corresponding expressions <code>asInstanceOf[Double]</code> and <code>asInstanceOf[Int]</code>. It's not very generic, but it's very handy.

source: This algorithm was invented by Wlodek Dobosiewicz in 1980, and later rediscovered and popularized by Stephen Lacey and Richard Box, who described it in Byte Magazine in April 1991.
ta: This படிமுறை was invented by Wlodek Dobosiewicz in 1980, and later rediscovered and popularized by Stephen Lacey and Richard Box, who described it in Byte Magazine in ப-சித்திரை 1991.

source: The authors of this algorithm observed that the performance is increased if we make sure that the last values of the gap are (11, 8, 6, 4, 3, 2, 1) rather than (9, 6, 4, 3, 2, 1) or (10, 7, 5, 3, 2, 1). Rework the code of CombSort to ensure just after the gap update that if it is 9 or 10, we should use 11 instead.
ta: The ஆசிரியர்கள் of this படிமுறை observed that the performance is increased if we make sure that the last values of the gap அரே (11, 8, 6, 4, 3, 2, 1) rather than (9, 6, 4, 3, 2, 1) or (10, 7, 5, 3, 2, 1). Rework the குறியீடு of CombSort பெறுநர் ensure just after the gap புதுப்பிப்பு that if it is 9 or 10, we should use 11 instead.

source: The Gnome sort is similar to insertion sort, but the elements are moved in position by a serie of swaps just like in bubble sort. It is named after the supposed behavior of garden gnomes when they sort flower pots. Here is a description of the algorithm by its author:
ta: The Gnome வரிசைப்படுத்து is similar பெறுநர் insertion sort, but the elements அரே moved in position by a serie of swaps just like in bubble sort. It is named after the supposed behavior of garden gnomes when they வரிசைப்படுத்து flower pots. Here is a விவரம் of the படிமுறை by its author:

source: Gnome Sort is based on the technique used by the standard Dutch Garden Gnome (Du.: tuinkabouter). Here is how a garden gnome sorts a line of flower pots. Basically, he looks at the flower pot next to him and the one immediately after ; if they are in the right order he steps one pot forward, otherwise he swaps them and steps one pot backwards. Boundary conditions: if there is no previous pot, he steps forwards; if there is no pot next to him, he is done. <i>—Dick Grune</i>
ta: Gnome வரிசைப்படுத்து is based on the technique used by the தரநிலை டச்சு Garden Gnome (Du.: tuinkabouter). Here is how a garden gnome sorts a வரி of flower pots. Basically, he looks at the flower pot அடுத்தது பெறுநர் him and the one உடனடியாக after ; if they அரே in the வலது order he படிகள் one pot forward, otherwise he swaps them and படிகள் one pot backwards. Boundary conditions: if there is இல்லை previous pot, he படிகள் forwards; if there is இல்லை pot அடுத்தது பெறுநர் him, he is done. <i>—Dick Grune</i>

source: The Dutch Flag Problem
ta: The டச்சு Flag Problem

source: This problem was first proposed by E.W Dijkstra in 1976 (in the chapter 14 of his book "A Discipline of Programming"). It is a very classical variation of the sorting algorithms since then. It is sometimes useful in real life, but it became famous for its pedagogical properties: its complexity is not trivial, but not complex either. It can easily be formally proven, but it's not absolutely trivial either.
ta: This problem was first proposed by E.W Dijkstra in 1976 (in the பாடங்கள் 14 of his book "A Discipline of Programming"). It is a very classical variation of the sorting algorithms since then. It is sometimes useful in real life, but it became famous க்கு its pedagogical properties: its complexity is not trivial, but not அணைவு either. It can easily be formally proven, but it's not absolutely trivial either.

source: A temporal view could be welcomed.
ta: A temporal பார்வை could be welcomed.

source: Other exercises, for example with 2 colors only or with more than 3 colors, could generalize the proposed approach.
ta: மற்றொன்று exercises, க்கு example with 2 colors only or with more than 3 colors, could generalize the proposed approach.

source: This is a classical sorting problem, constituting a variation over the insertion sort.
ta: This is a classical sorting problem, constituting a variation வீச்சலகு the insertion sort.

source: Your work is to sort all the colors of the Dutch flag, and the only provided primitive is to exchange two given lines. In addition, you should not create any additional variables (but a few indices).
ta: Your வேலை is பெறுநர் வரிசைப்படுத்து அனைத்தும் the colors of the டச்சு flag, and the only provided தொடக்கநிலை is பெறுநர் exchange two given lines. In addition, you should not create any additional மாறிகள் (but a few indices).

source: If you think carefully, this can be done in linear time, where you sort a line at each iteration of the loop. You may want to check again the <a href="plm://lessons.sort.basic/insertion.AlgInsertionSort">insertion sort</a>, of which the Dutch Flag sort is a variation. The main difference is that you have 3 insertion points, not only one...
ta: If you think carefully, this can be முடிந்தது in நேரியல் time, where you வரிசைப்படுத்து a வரி at each மறுசெய்கை of the loop. You சி-வைகாசி want பெறுநர் சரிபார் again the <a href="plm://lessons.sort.basic/insertion.AlgInsertionSort">insertion sort</a>, of which the டச்சு Flag வரிசைப்படுத்து is a variation. The main வேறுபாடு is that you have 3 insertion points, not only one...

source: I need an hint to start
ta: I need an hint பெறுநர் தொடங்கு

source: Do a traversal over your data, saving 3 indices:
ta: Do a traversal வீச்சலகு your data, saving 3 indices:

source: <code>afterBlue</code> is initialized to 0. Make sure that every cell below <code>afterBlue</code> is filled with blue elements.
ta: <code>afterBlue</code> is initialized பெறுநர் 0. Make sure that every கலன் below <code>afterBlue</code> is filled with நீலம் elements.

source: <code>whiteRed</code> is initialized to size-1. Make sure that every cell after <code>whiteRed</code> is filled with red elements.
ta: <code>whiteRed</code> is initialized பெறுநர் size-1. Make sure that every கலன் after <code>whiteRed</code> is filled with சிவப்பு elements.

source: <code>beforeWhite</code> is initialized to size-1. Make sure that every cell after <code>beforeWhite</code> and before <code>whiteRed</code> is filled with white elements.
ta: <code>beforeWhite</code> is initialized பெறுநர் size-1. Make sure that every கலன் after <code>beforeWhite</code> and before <code>whiteRed</code> is filled with வெள்ளை elements.

source: Note that the unsorted cells are always between <code>afterBlue</code> and <code>beforeWhite</code>.
ta: குறிப்பு that the unsorted cells அரே எப்போதும் between <code>afterBlue</code> and <code>beforeWhite</code>.

source: At each step of your traversal, check the color of the cell at <code>afterBlue</code> and do the required exchanges. The loop ending condition is when <code>afterBlue</code> becomes larger than <code>beforeWhite</code>.
ta: At each படி of your traversal, சரிபார் the color of the கலன் at <code>afterBlue</code> and do the required exchanges. The loop ending condition is when <code>afterBlue</code> becomes larger than <code>beforeWhite</code>.

source: The colors are represented through the following constants: BLUE, WHITE and RED. You can use them directly in your code.
ta: The colors அரே represented through the following constants: BLUE, வெள்ளை and RED. You can use them directly in your code.

source: Provided functions
ta: Provided செயல்பாடுகள்

source: Swap the lines number <code>x</code> and <code>y</code>.
ta: Swap the வரிகள் எண் <code>x</code> and <code>y</code>.

source: Returns the amount of lines on this flag.
ta: Returns the amount of வரிகள் on this flag.

source: Returns whether the current world is selected in the interface.
ta: Returns whether the மின்னோட்ட்ம், ஓட்டம் world is தேர்ந்தெடுக்கப்பட்டது in the interface.

source: This universe is very simple, with only five functions provided.
ta: This அண்டம் is very simple, with only five செயல்பாடுகள் provided.

source: Returns the size of the stack, that is the amount of pancakes it contains.
ta: Returns the அளவு of the stack, that is the amount of pancakes it contains.

source: Returns the radius of the pancake passed as argument, with the rank of the top-most pancake being 0.
ta: Returns the ஆரம் of the pancake passed அச் argument, with the rank of the top-most pancake being 0.

source: Returns whether the pancake passed as argument upside-down, that is, if its burned side is on top. As usual, the top-most pancake is of rank 0.
ta: Returns whether the pancake passed அச் argument upside-down, that is, if its burned பக்கம் is on top. அச் usual, the top-most pancake is of rank 0.

source: Flips the <code>amount</code> first pancakes composing the stack, from the top of it.
ta: Flips the <code>amount</code> first pancakes composing the stack, இருந்து the மேலே of it.

source: This activity is inspired by a problem first introduced in 1975 by Harry Dweighter in the American Mathematical Monthly. The question is not only to sort the pancakes, but to determine <code>f(n)</code> the <i>minimal</i> amount of flips mandated to sort any stack of size <code>n</code>.
ta: This செய்கைப்பாடு is inspired by a problem first introduced in 1975 by Harry Dweighter in the அமேரிகன் Mathematical Monthly. The கேள்வி is not only பெறுநர் வரிசைப்படுத்து the pancakes, but பெறுநர் determine <code>f(n)</code> the <i>minimal</i> amount of flips mandated பெறுநர் வரிசைப்படுத்து any stack of அளவு <code>n</code>.
