Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list with only the <code>N</code> last elements.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an முழு எண் <code>N</code>, return the பட்டியல் with only the <code>N</code> last elements.

source: Your solution should be linear in time, but you will probably need to define several functions to achieve that complexity.
ta: Your நீர்மக்கூழ் should be நேரியல் in time, but you will probably need பெறுநர் define several செயல்பாடுகள் பெறுநர் achieve that complexity.

source: I cannot do it in linear time
ta: I cannot do it in நேரியல் time

source: The trick is to compute only once (and beforehand) how many elements you should keep.
ta: The trick is பெறுநர் compute only once (and beforehand) how many elements you should keep.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list without the <code>N</code> first elements.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an முழு எண் <code>N</code>, return the பட்டியல் without the <code>N</code> first elements.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list without the <code>N</code> last elements.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an முழு எண் <code>N</code>, return the பட்டியல் without the <code>N</code> last elements.

source: Reverse
ta: தலைகீழ்

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return a new list with all elements in reverse order.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return a புதிய பட்டியல் with அனைத்தும் elements in தலைகீழ் order.

source: This function is very important and you should not pass that challenge. Your solution should be linear in time, with the help of helper functions.
ta: This சார்பு is very important and you should not கணவாய் that challenge. Your நீர்மக்கூழ் should be நேரியல் in time, with the உதவி of helper functions.

source: You need an helper function in which the result is accumulated (built) at each step.
ta: You need an helper சார்பு in which the result is accumulated (built) at each step.

source: Given two [!scala]List[Int][/!][!java|python]recursive list[/!] <code>l1</code> and <code>l2</code>, return a new list with all elements of <code>l1</code> followed by the elements of <code>l2</code>.
ta: Given two [!scala]List[Int][/!][!java|python]recursive list[/!] <code>l1</code> and <code>l2</code>, return a புதிய பட்டியல் with அனைத்தும் elements of <code>l1</code> followed by the elements of <code>l2</code>.

source: You need to modify <code>l1</code> beforehand so that the computations at each step of the recursion are in constant time.
ta: You need பெறுநர் modify <code>l1</code> beforehand so that the computations at each படி of the recursion அரே in மாறா, மாறிலி time.

source: All Different
ta: அனைத்தும் Different

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return true if any two elements of the list are different (ie, if no element appears more than once in the list).
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return true if any two elements of the பட்டியல் அரே different (ie, if இல்லை தனிமம் appears more than once in the list).

source: The simplest solution is in O(n²), meaning that it runs in quadratic time. You will probably have to define one extra function for that. Another much more complex solution runs in O(n log(n)).
ta: The simplest நீர்மக்கூழ் is in O(n²), meaning that it runs in quadratic time. You will probably have பெறுநர் define one extra சார்பு க்கு that. Another much more அணைவு நீர்மக்கூழ் runs in O(n log(n)).

source: This lesson allows to experiment with recursive algorithms.
ta: This பாடம் allows பெறுநர் experiment with recursive algorithms.

source: What can I do to improve this lesson?
ta: What can I do பெறுநர் improve this lesson?

source: As usual, there are several things that could be done in this lesson to improve it further:
ta: அச் usual, there அரே several things that could be முடிந்தது in this பாடம் பெறுநர் improve it further:

source: The arrowhead curve is also interesting: http://www.mathcurve.com/fractals/sierpinski/sierpinskitriangle.shtml
ta: The arrowhead வளைவு is also interesting: http://www.mathcurve.com/fractals/sierpinski/sierpinskitriangle.shtml

source: The dragon curve could be explained as a L-system: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/heighway.htm
ta: The dragon வளைவு could be explained அச் a L-system: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/heighway.htm

source: The dragon2 curve is called the twin dragon: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/twindragon.htm
ta: The dragon2 வளைவு is called the twin dragon: http://ecademy.agnesscott.edu/~lriddle/ifs/heighway/twindragon.htm

source: The space filling curves could be added (Peano, Hildebert, etc). See: http://teachout1.net/village/fill.html
ta: The இடைவெளி filling curves could be added (Peano, Hildebert, etc). See: http://teachout1.net/village/fill.html

source: Discover the recursive way of thinking by drawing trees and other figures with the Logo turtle.
ta: கண்டுபிடி the recursive way of சிந்திக்கிறேன் by drawing trees and மற்றொன்று figures with the அடையாளம் turtle.

source: Today, we will meet the small cousines of the buggles: the turtles. In fact, turtles are much olders than the buggles. They were invented in the 70's by a scientific from MIT called Seymour Papert to help teaching programming, and the buggles are a variation on the idea invented by Lyn Turbak from Wellesley College later.
ta: Today, we will meet the small cousines of the buggles: the turtles. In fact, turtles அரே much olders than the buggles. They were invented in the 70's by a scientific இருந்து MIT called Seymour Papert பெறுநர் உதவி teaching programming, and the buggles அரே a variation on the idea invented by Lyn Turbak இருந்து Wellesley College later.

source: Turtles are thus a bit like buggles, but smaller. Just like buggles, you can order them to move forward, to turn, to move backward, etc. Just like buggles, they leave a line on their path when they move (but the line is much smaller).
ta: Turtles அரே thus a துணுக்கு like buggles, but smaller. Just like buggles, you can order them பெறுநர் move forward, பெறுநர் turn, பெறுநர் move backward, etc. Just like buggles, they leave a வரி on their பாதை when they move (but the வரி is much smaller).

source: The main difference is that where buggles can only move of right angles, turtles can move of any arbitrary angles specified by a real number (a double). This gives them much more liberty in their movings. The buggles can do several other tricks, like reading and writting messages, picking or dropping objects, and there is sometimes walls in their worlds (but all this is completely above the capacities of turtles).
ta: The main வேறுபாடு is that where buggles can only move of வலது angles, turtles can move of any arbitrary angles specified by a real எண் (a double). This gives them much more liberty in their movings. The buggles can do several மற்றொன்று tricks, like படித்தல் and writting messages, picking or dropping objects, and there is sometimes walls in their worlds (but அனைத்தும் this is completely above the capacities of turtles).

source: From a practical point of view, most of the methods you knew about buggles still work with turtles, with some minor adaptations. In particular, the <code>forward()</code> method takes the amount of steps to do not as an integer, but as a [!python]point number[/!][!java|scala|c]double[/!] (see "About this world" for more details).
ta: இருந்து a practical புள்ளியம் of view, பெரும்பாலானவை of the முறைகள் you knew பற்றி buggles still வேலை with turtles, with some minor adaptations. In particular, the <code>forward()</code> method takes the amount of படிகள் பெறுநர் do not அச் an integer, but அச் a [!python]point number[/!][!java|scala|c]double[/!] (see "About this world" க்கு more details).

source: It's simply a point number. Example:
ta: It's simply a புள்ளியம் number. Example:

source: double x = 3.72; x + 1.234 // Value = 4.954 x + 2. // Value = 5.72 (2. means 2.0) x + 2 // [!java|c]Value = 5.72 (2 automatically converted to 2.0)[/!][!scala]Type error (+ operator don't mix Double and Int); manual conversion mandatory[/!] x * 2. // Value = 7.44 x / 2. // Value = 1.86 [!java|c](int) x[/!][!scala]x.asInstanceOf[Int][/!] // Value = 1 (“casting to int”, converted to integer by truncating) Math.round(x) // Value = 2 (1.86 rounded to nearest integer) Math.floor(x) // Value = 1 (1.86 rounded toward minus infinity) Math.floor(-5.12) // Value = -6 (rounded toward minus infinity) Math.ceiling(x) // Value = 2 (1.86 rounded toward plus infinity) Math.ceiling(-5.12) // Value = -5 (rounded toward plus infinity) [!java|c](double) 17[/!][!scala]17.asInstanceOf[Double][/!] // Value = 17.0 (“casted to double”, converted to double)
ta: இரட்டை ஃச் = 3.72; x + 1.234 // மதிப்பு = 4.954 x + 2. // மதிப்பு = 5.72 (2. means 2.0) x + 2 // [!java|c]Value = 5.72 (2 automatically converted பெறுநர் 2.0)[/!][!scala]Type பிழை (+ operator don't mix இரட்டை and Int); manual conversion mandatory[/!] x * 2. // மதிப்பு = 7.44 x / 2. // மதிப்பு = 1.86 [!java|c](int) x[/!][!scala]x.asInstanceOf[Int][/!] // மதிப்பு = 1 (“casting பெறுநர் int”, converted பெறுநர் முழு எண் by truncating) Math.round(x) // மதிப்பு = 2 (1.86 rounded பெறுநர் nearest integer) Math.floor(x) // மதிப்பு = 1 (1.86 rounded toward minus infinity) Math.floor(-5.12) // மதிப்பு = -6 (rounded toward minus infinity) Math.ceiling(x) // மதிப்பு = 2 (1.86 rounded toward plus infinity) Math.ceiling(-5.12) // மதிப்பு = -5 (rounded toward plus infinity) [!java|c](double) 17[/!][!scala]17.asInstanceOf[Double][/!] // மதிப்பு = 17.0 (“casted பெறுநர் double”, converted பெறுநர் double)

source: Even if this is the first exercise on the recursivity lesson, the code you have to write is not recursive. The goal is to get familiar with the turtle world before getting on serious matter.
ta: இரட்டை if this is the first exercise on the recursivity lesson, the குறியீடு you have பெறுநர் write is not recursive. The goal is பெறுநர் get familiar with the turtle world before getting on serious matter.

source: You must reproduce a simple geometrical painting constituted of four 100 steps long squares (see the objective world for more details). It is obviously a good idea to write a method to draw a square, and then use it in your code.
ta: You must reproduce a simple geometrical painting constituted of நான்கு, நாலடி, நான்கடி 100 படிகள் long squares (see the objective world க்கு more details). It is obviously a good idea பெறுநர் write a method பெறுநர் draw a square, and then use it in your code.

source: Have a look at each world's objective view to understand how to write the function.
ta: Have a look at each world's objective பார்வை பெறுநர் understand how பெறுநர் write the function.

source: Snow flake
ta: பனி flake

source: We will now draw snow flakes using the Koch fractal. A fractal is a geometric pattern repeated at every scale.
ta: We will now draw பனி flakes using the கோச் fractal. A fractal is a geometric pattern repeated at every scale.

source: The general form is a triangle, with each side given by several recursive calls. Your work is only to write the code of the <code>snowSide</code> method so that it draws one side of the triangle. To make it easier, each sides are represented in a specific color. Just draw the red things (without changing your pen color), and the other colors will be drawn automatically.
ta: The பொது form is a triangle, with each பக்கம் given by several recursive calls. Your வேலை is only பெறுநர் write the குறியீடு of the <code>snowSide</code> method so that it draws one பக்கம் of the triangle. பெறுநர் make it easier, each sides அரே represented in a specific color. Just draw the சிவப்பு things (without changing your pen color), and the மற்றொன்று colors will be drawn automatically.

source: Observe the drawing in each world's objective to understand the pattern's logic, and then reproduce it. At level 0, the Koch curve is just a straight line. At level 1, the curve is divided in three thirds, and the middle part is replaced by the two sides of an equilateral triangle of the same length as the segment being removed. At level 2, the process is repeated, whith each segments split in three parts and the middle part being replaced by the two sides of an equilateral triangle.
ta: Observe the drawing in each world's objective பெறுநர் understand the pattern's logic, and then reproduce it. At நிலை 0, the கோச் வளைவு is just a straight line. At நிலை 1, the வளைவு is divided in three thirds, and the middle பகுதி is replaced by the two sides of an equilateral triangle of the same length அச் the segment being removed. At நிலை 2, the process is repeated, whith each segments split in three பாகங்கள் and the middle பகுதி being replaced by the two sides of an equilateral triangle.

source: The pseudo-code of the general case is the following:
ta: The pseudo-code of the பொது case is the following:

source: Draw recursively a smaller segment Turn 60 degrees to the left Draw recursively a smaller segment Turn 120 degrees to the right Draw recursively a smaller segment Turn 60 degrees to the left Draw recursively a smaller segment
ta: Draw recursively a smaller segment Turn 60 degrees பெறுநர் the left Draw recursively a smaller segment Turn 120 degrees பெறுநர் the right Draw recursively a smaller segment Turn 60 degrees பெறுநர் the left Draw recursively a smaller segment

source: As you can see, the function forward() is not called from the recursive case, only in the base case when there is no recursive call.
ta: அச் you can see, the சார்பு forward() is not called இருந்து the recursive case, only in the காரம் case when there is இல்லை recursive call.

source: Here are the results of the first levels of recursion.
ta: Here அரே the முடிவுகள் of the first levels of recursion.

source: You must write the <code>snowSide()</code> method, which is recursive but <b>do not call snowFlake from snowSide</b>, or you will get very strange and unexpected behaviors.
ta: You must write the <code>snowSide()</code> method, which is recursive but <b>do not call snowFlake இருந்து snowSide</b>, or you will get very strange and unexpected behaviors.

source: Snow square
ta: பனி square

source: This exercise is a variation over the snow flake that we saw previously. The main difference is that we are growing little squares instead of triangles on the sides of the figure.
ta: This exercise is a variation வீச்சலகு the பனி flake that we saw previously. The main வேறுபாடு is that we அரே growing little squares instead of triangles on the sides of the figure.

source: As previously, your <code>squareSide</code> function should only draw one side of the figure, and the template will call it for all sides automatically (with one color per side).
ta: அச் previously, your <code>squareSide</code> சார்பு should only draw one பக்கம் of the figure, and the template will call it க்கு அனைத்தும் sides automatically (with one color per side).

source: Snow pentagon
ta: பனி ஐங்கோணம்

source: Here comes yet another variation of the Koch curve. This time, we grow little pentagons (ie, polygons with five sides each). I'm sure you get it now.
ta: Here comes yet another variation of the கோச் curve. This time, we grow little pentagons (ie, polygons with five sides each). I'm sure you get it now.

source: Another difference with earlier is that the length is not divided by three at each step anymore, but multiplied by 0.4. The curve looks better this way :)
ta: Another வேறுபாடு with earlier is that the length is not divided by three at each படி anymore, but multiplied by 0.4. The வளைவு looks better this way :)

source: We draw only one side in this exercise so your code will be called only once this time.
ta: We draw only one பக்கம் in this exercise so your குறியீடு will be called only once this time.

source: Snow hexagon
ta: பனி hexagon

source: This time, we will draw the curve that is known as the (6, 0.14)-Koch curve. This means that you have to grow 6-sided polygons on the segments, and that the length should be multiplied by 0.14 at each recursion level.
ta: This time, we will draw the வளைவு that is known அச் the (6, 0.14)-Koch curve. This means that you have பெறுநர் grow 6-sided polygons on the segments, and that the length should be multiplied by 0.14 at each recursion level.

source: For the record, the original Koch curve is the (3, 1/3)-Koch curve, the Snow square would be (4,1/3)-Koch curve while the Snow pentagon is also called the (5, 0.4)-Koch curve. If you want, you can switch to the creative mode in the menu and explore freely other Koch curves. Just change the initial call to hexaKoch to what you want.
ta: க்கு the record, the original கோச் வளைவு is the (3, 1/3)-Koch curve, the பனி square would be (4,1/3)-Koch வளைவு while the பனி ஐங்கோணம் is also called the (5, 0.4)-Koch curve. If you want, you can ஆளி, நிலைமாறி பெறுநர் the creative பயன்முறை in the பட்டியல் and explore freely மற்றொன்று கோச் curves. Just change the initial call பெறுநர் hexaKoch பெறுநர் what you want.

source: For further reference, please see <a href="http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm">http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm</a>.
ta: க்கு further reference, please see <a href="http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm">http://ecademy.agnesscott.edu/~lriddle/ifs/kcurve/kcurve.htm</a>.

source: The Crab curve is not exactly a Koch curve, but that's still a fractal and it's built rather similarly. This time, we grow square triangle on the side of the figure: the angle is 45 degrees, and the length is divided by [!java|scala]Math.sqrt(2)[/!][!python]math.sqrt(2)[/!][!c]sqrt(2);[/!] at each step.
ta: The Crab வளைவு is not exactly a கோச் curve, but that's still a fractal and it's built rather similarly. This time, we grow square triangle on the பக்கம் of the figure: the angle is 45 degrees, and the length is divided by [!java|scala]Math.sqrt(2)[/!][!python]math.sqrt(2)[/!][!c]sqrt(2);[/!] at each step.

source: Check the figures produced by the first steps of recursion to understand the pattern.
ta: சரிபார் the figures produced by the first படிகள் of recursion பெறுநர் understand the pattern.

source: Bibliographical note
ta: Bibliographical குறிப்பு

source: This curve, also called the Lévy C curve was invented in 1938 by the French mathematician Paul Lévy. As usual, the wikipedia page is very instructive, and the page provide very good additions: <a href="http://www.mathcurve.com/fractals/c/c.shtml">http://www.mathcurve.com/fractals/c/c.shtml</a>.
ta: This curve, also called the Lévy C வளைவு was invented in 1938 by the பிரஞ்சு mathematician பால் Lévy. அச் usual, the wikipedia page is very instructive, and the page provide very good additions: <a href="http://www.mathcurve.com/fractals/c/c.shtml">http://www.mathcurve.com/fractals/c/c.shtml</a>.

source: We will now draw trees. For that, we will write a method using double recursion following this prototype
ta: We will now draw trees. க்கு that, we will write a method using இரட்டை recursion following this prototype

source: To draw a tree of four levels, you have to draw a trunk of the given length, turn right of the given angle, draw a tree of level 3, turn left twice of the given angle, draw another tree of level 3, and come back to your initial location. Don't forget to come back to the initial location!
ta: பெறுநர் draw a tree of நான்கு, நாலடி, நான்கடி levels, you have பெறுநர் draw a முண்டம் of the given length, turn வலது of the given angle, draw a tree of நிலை 3, turn இடது twice of the given angle, draw another tree of நிலை 3, and come பின் பெறுநர் your initial location. Don't forget பெறுநர் come பின் பெறுநர் the initial location!

source: If a tree's trunk is of length 'len', the trunk of the next level tree will be of length 'len*shrink'.
ta: If a tree's முண்டம் is of length 'len', the முண்டம் of the அடுத்தது நிலை tree will be of length 'len*shrink'.

source: At the end, here is the pseudo-code of the general case (you should add the base case yourself):
ta: At the end, here is the pseudo-code of the பொது case (you should கூட்டு the காரம் case yourself):

source: Move forward of the desired length Draw (recursively) the right subtree Draw (recursively) the left subtree Move back to your initial position
ta: Move forward of the desired length Draw (recursively) the வலது subtree Draw (recursively) the இடது subtree Move பின் பெறுநர் your initial position

source: Don't forget to add the base case to your code, or your buggle will enter an infinite loop. Then, drawing the right subtree comes down to turn right and then draw the subtree.
ta: Don't forget பெறுநர் கூட்டு the காரம் case பெறுநர் your code, or your buggle will enter an கந்தழி, முடிவிலி loop. Then, drawing the வலது subtree comes down பெறுநர் turn வலது and then draw the subtree.

source: As you can see, each recursion level is represented by a distinctive color. For that, you have to call the <code>current(step)</code>, passing the current recursion level as a parameter. This will pick the right color for you. Don't erase your great colors when you move back to your initial location.
ta: அச் you can see, each recursion நிலை is represented by a distinctive color. க்கு that, you have பெறுநர் call the <code>current(step)</code>, passing the மின்னோட்ட்ம், ஓட்டம் recursion நிலை அச் a parameter. This will pick the வலது color க்கு you. Don't erase your great colors when you move பின் பெறுநர் your initial location.

source: If you get your function wrong, this can easily become hairly to debug as your errors will appear at each level of the recursion, completely changing the drawing. For debugging purpose, you can use the <code>subtree()</code> that will draw a correct subtree. This function is then very similar to the one you are trying to write. The only difference is that <code>subtree()</code> only draws in black. So, you can use it instead of a recursive call to debug your code, but you have to change for a proper recursive call to your own code (once it works) to get the colors right, and pass the exercise.
ta: If you get your சார்பு wrong, this can easily become hairly பெறுநர் debug அச் your errors will appear at each நிலை of the recursion, completely changing the drawing. க்கு debugging purpose, you can use the <code>subtree()</code> that will draw a சரியான subtree. This சார்பு is then very similar பெறுநர் the one you அரே trying பெறுநர் write. The only வேறுபாடு is that <code>subtree()</code> only draws in black. So, you can use it instead of a recursive call பெறுநர் debug your code, but you have பெறுநர் change க்கு a proper recursive call பெறுநர் your own குறியீடு (once it works) பெறுநர் get the colors right, and கணவாய் the exercise.

source: The fractal we will now draw is formed of a big triangle inside which several smaller triangles are embedded. The prototype of the function to draw it is the following:
ta: The fractal we will now draw is formed of a big triangle inside which several smaller triangles அரே embedded. The prototype of the சார்பு பெறுநர் draw it is the following:
