Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: <code>new</code> means that we want to create something, and <code>[!java]int[10][/!][!scala]Array[Int](10)[/!]</code> means that it is an array of 10 integer values. In return, an array of 10 integer cells is created in memory, and the <code>T</code> variable <b>references</b> this array.
ta: <code>new</code> means that we want பெறுநர் create something, and <code>[!java]int[10][/!][!scala]Array[Int](10)[/!]</code> means that it is an array of 10 முழு எண் values. In return, an array of 10 முழு எண் cells is உருவாக்கப்பட்டது in memory, and the <code>T</code> variable <b>references</b> this array.

source: The size of an array is fixed and cannot be changed after the creation of the array. The size of a <code>T</code> array can be retrieve by consulting the variable <code>T.length</code>.
ta: The அளவு of an array is fixed and cannot be changed after the creation of the array. The அளவு of a <code>T</code> array can be retrieve by consulting the variable <code>T.length</code>.

source: While allocating, you can specify the size with a variable: <code>[!java]int[] T = new int[i];[/!][!scala]var T = new Array[Int](i);[/!]</code> In this case, the array's size will be set to the value of <code>i</code> <i>when <code>new</code> gets called</i>. The size of the array still cannot be modified: even if the variable <code>i</code> changes afterward, the size remains to the value given when it was allocated. [!java]Also, it is forbidden to write something like <code>int T[10];</code> when declaring the variable. You are required to use the <code>new</code> instruction to allocate it, as in <code>int[] T = new int[10];</code> [/!]
ta: While allocating, you can specify the அளவு with a variable: <code>[!java]int[] T = புதிய int[i];[/!][!scala]var T = புதிய Array[Int](i);[/!]</code> In this case, the array's அளவு will be கணம் பெறுநர் the மதிப்பு of <code>i</code> <i>when <code>new</code> gets called</i>. The அளவு of the array still cannot be மாற்றியமைக்கப்பட்ட: இரட்டை if the variable <code>i</code> changes afterward, the அளவு remains பெறுநர் the மதிப்பு given when it was allocated. [!java]Also, it is forbidden பெறுநர் write something like <code>int T[10];</code> when declaring the variable. You அரே required பெறுநர் use the <code>new</code> instruction பெறுநர் allocate it, அச் in <code>int[] T = புதிய int[10];</code> [/!]

source: Declaration and initialization
ta: சாற்றுதல் and முன்னமைவு

source: To know the size of the array to allocate, the compiler counts the provided values. This code is equivalent to:
ta: பெறுநர் know the அளவு of the array பெறுநர் allocate, the தொகுப்பி counts the provided values. This குறியீடு is equivalent இதற்கு:

source: [!java]int[] T = new int[10]; T[0] = 1; T[1] = 2; ... T[9] = 10;[/!][!scala]var T = new Array[Int](10); T(0) = 1 T(1) = 2 ... T(9) = 10[/!]
ta: [!java]int[] T = புதிய int[10]; T[0] = 1; T[1] = 2; ... T[9] = 10;[/!][!scala]var T = புதிய Array[Int](10); T(0) = 1 T(1) = 2 ... T(9) = 10[/!]

source: It is also equivalent to:
ta: It is also equivalent இதற்கு:

source: [!java]int[] T = new int[10]; for (int i=0; i&lt;T.length; i++) { T[i] = i+1; }[/!][!scala]var T = new Array[Int](10); for (i &lt;- 0 to T.length-1) { T(i) = i+1 }[/!]
ta: [!java]int[] T = புதிய int[10]; for (int i=0; i&lt;T.length; i++) { T[i] = i+1; }[/!][!scala]var T = புதிய Array[Int](10); for (i &lt;- 0 பெறுநர் T.length-1) { T(i) = i+1 }[/!]

source: It is perfectly OK to pass [!python]a list[/!][!java|scala]an array[/!] to a method as a parameter. This method can then use this parameter as if it were defined locally:
ta: It is perfectly சரி பெறுநர் கணவாய் [!python]a list[/!][!java|scala]an array[/!] பெறுநர் a method அச் a parameter. This method can then use this கூறளவு அச் if it were defined locally:

source: [!java]int[] tab = new int[10];[/!][!scala]var tab = new Array[Int] (10)[/!][!python]tab = [1, 3, 5, 7, 9][/!] [!java|scala]<span class="comment">// Values initialization omitted</span> [/!]if (has42First(tab))[!java|scala] {[/!][!python]:[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] do something</span> [!java|scala]}[/!]
ta: [!java]int[] தாவல் = புதிய int[10];[/!][!scala]var தாவல் = புதிய Array[Int] (10)[/!][!python]tab = [1, 3, 5, 7, 9][/!] [!java|scala]<span class="comment">// Values முன்னமைவு omitted</span> [/!]if (has42First(tab))[!java|scala] {[/!][!python]:[/!] <span class="comment">[!java|scala]//[/!][!python]#[/!] do something</span> [!java|scala]}[/!]

source: If you want to allocate and initialize the array in one shoot, that's a bit more complicated as the compiler has to know the type of the parameter you are creating. For that, use the following (ugly) construct:
ta: If you want பெறுநர் allocate and initialize the array in one shoot, that's a துணுக்கு more complicated அச் the தொகுப்பி has பெறுநர் know the வகை of the கூறளவு you அரே creating. க்கு that, use the following (ugly) construct:

source: if (has42First( new int[] {1, 3, 5, 7, 9} ) { <span class="comment">// do something</span> }
ta: if (has42First( புதிய int[] {1, 3, 5, 7, 9} ) { <span class="comment">// do something</span> }

source: Methods can also return [!java|scala]arrays[/!][!python]lists[/!] as result without any complication. Here is a method that returns [!java|scala]an array[/!][!python]a list[/!] of the requested size, filled with 42s.
ta: முறைகள் can also return [!java|scala]arrays[/!][!python]lists[/!] அச் result without any complication. Here is a method that returns [!java|scala]an array[/!][!python]a list[/!] of the requested size, filled with 42s.

source: [!java]int[] fill42(int size) { int[] res = new int[size]; for (int i=0; i&lt;size; i++) res[i] = 42; return res; }[/!][!scala]def fill42(size:Int):Array[Int] = { var res = new Array[int] (size) for (i &lt;- 0 to size -1) { res(i) = 42; } return res; }[/!][!python]def fill42(size): res = [] for i in range(size): res.append(42) return res[/!]
ta: [!java]int[] fill42(int size) { int[] res = புதிய int[size]; க்கு (int i=0; i&lt;size; i++) res[i] = 42; return res; }[/!][!scala]def fill42(size:Int):Array[Int] = { var res = புதிய Array[int] (size) க்கு (i &lt;- 0 பெறுநர் அளவு -1) { res(i) = 42; } return res; }[/!][!python]def fill42(size): res = [] க்கு i in range(size): res.append(42) return res[/!]

source: At least! After this long explanation, we can come back to the exercise.
ta: At least! After this long explanation, we can come பின் பெறுநர் the exercise.

source: Your mission is rather simple actually. Your code should save the color pattern observed on the first row into [!java|scala]an array[/!][!python]a list[/!]. [!python]The easiest is to create an empty list, and then <code>append()</code> the colors one after the others as you read them (with <code>getGroundColor()</code>).[/!] [!java|scala]For that, you should declare and allocate an array of <code>Color</code>. Beware, there is several worlds, of differing size; use <code>getWorldHeight()</code> to retrieve the size of the current world. Once the array allocated, fill it by reading the ground color in each locations (with <code>getGroundColor()</code>).[/!]
ta: Your mission is rather simple actually. Your குறியீடு should சேமி the color pattern observed on the first நிரை into [!java|scala]an array[/!][!python]a list[/!]. [!python]The easiest is பெறுநர் create an வெறுமை list, and then <code>append()</code> the colors one after the others அச் you read them (with <code>getGroundColor()</code>).[/!] [!java|scala]For that, you should declare and allocate an array of <code>Color</code>. Beware, there is several worlds, of differing size; use <code>getWorldHeight()</code> பெறுநர் retrieve the அளவு of the மின்னோட்ட்ம், ஓட்டம் world. Once the array allocated, fill it by படித்தல் the ground color in each locations (with <code>getGroundColor()</code>).[/!]

source: Once you managed to read and save the pattern on the first row, you have to reapply the pattern on every rows, for example by executing <code>getWorldHeight()</code> times a method written specifically for this.
ta: Once you managed பெறுநர் read and சேமி the pattern on the first row, you have பெறுநர் reapply the pattern on every rows, க்கு example by executing <code>getWorldHeight()</code> பெருக்கல் a method written specifically க்கு this.

source: This exercise is similar to the previous one: you have to reproduce the color pattern of the first cell into the other ones.
ta: This exercise is similar பெறுநர் the previous one: you have பெறுநர் reproduce the color pattern of the first கலன் into the மற்றொன்று ones.

source: The first difference is that the world is bordered of walls: you thus have to slightly modify your trajectory to ensure that the buggle does not crash into a wall. The simpler for that is to handle the first cell out of the <code>for</code> loop and do only <code>getWorldHeight()-1</code> steps in the loop.
ta: The first வேறுபாடு is that the world is bordered of walls: you thus have பெறுநர் slightly modify your எறிபாதை பெறுநர் ensure that the buggle does not crash into a wall. The simpler க்கு that is பெறுநர் கைப்பிடி the first கலன் out of the <code>for</code> loop and do only <code>getWorldHeight()-1</code> படிகள் in the loop.

source: The other difference is that the offset to apply between columns is not fixed, but written on the first cell of each column. To get the info as an integer, we can use:
ta: The மற்றொன்று வேறுபாடு is that the offset பெறுநர் இடு between columns is not fixed, but written on the first கலன் of each column. பெறுநர் get the செய்தி அச் an integer, we can use:

source: <code>readMessage()</code> gets the message on the ground as a [!java|scala]String[/!][!python]string[/!], while <code>[!java]Integer.parseInt(str)[/!][!scala]str.toInt[/!][!python]int(str)[/!]</code> transforms the string <code>str</code> into an integer by <i>reading</i> it.
ta: <code>readMessage()</code> gets the செய்தி on the ground அச் a [!java|scala]String[/!][!python]string[/!], while <code>[!java]Integer.parseInt(str)[/!][!scala]str.toInt[/!][!python]int(str)[/!]</code> transforms the சரம் <code>str</code> into an முழு எண் by <i>reading</i> it.

source: Then, to pick the right color, the easier is to use the <code>%</code> (modulo) operator. For example, <code>(i + 5) % size</code> allows to retrieve the <code>i</code>th cell of an array of size <code>size</code> with an offset of <code>5</code>.
ta: Then, பெறுநர் pick the வலது color, the easier is பெறுநர் use the <code>%</code> (modulo) operator. க்கு example, <code>(i + 5) % size</code> allows பெறுநர் retrieve the <code>i</code>th கலன் of an array of அளவு <code>size</code> with an offset of <code>5</code>.

source: Searching for a given value
ta: Searching க்கு a given மதிப்பு

source: The goal of this exercise is to search the cell of a given value, and return its position.
ta: The goal of this exercise is பெறுநர் தேடல் the கலன் of a given value, and return its position.

source: To that extend, you should fill the method <code>indexOf()</code>, which parameters are the array to explore, and the value to search. If the value <code>lookingFor</code> is not in the array <code>tab</code>, the method should return -1.
ta: பெறுநர் that extend, you should fill the method <code>indexOf()</code>, which parameters அரே the array பெறுநர் explore, and the மதிப்பு பெறுநர் search. If the மதிப்பு <code>lookingFor</code> is not in the array <code>tab</code>, the method should return -1.

source: The idea of the algorithm is to sweep over the whole array, checking the value of each cell. If it's the searched value, you should return the index of the cell currently checked.
ta: The idea of the படிமுறை is பெறுநர் sweep வீச்சலகு the whole array, checking the மதிப்பு of each cell. If it's the searched value, you should return the குறியெண் of the கலன் currently checked.

source: Remember that indices begin at 0 and not at 1. So, if there is 3 cells, their indices will be 0, 1 and 2. There would not be any cell numbered 3.
ta: Remember that indices begin at 0 and not at 1. So, if there is 3 cells, their indices will be 0, 1 and 2. There would not be any கலன் numbered 3.

source: Remember also that the amount of cells in an array can be retrieved using the <code>length</code> attribute. So, if your array is called <code>tab</code>, its size can be retrieved as <code>tab.length</code>. Note that there is no () after <code>length</code>. An attribute is a sort of variable embedded in another object (here, the array).
ta: Remember also that the amount of cells in an array can be retrieved using the <code>length</code> attribute. So, if your array is called <code>tab</code>, its அளவு can be retrieved அச் <code>tab.length</code>. குறிப்பு that there is இல்லை () after <code>length</code>. An பண்புக்கூறு is a வரிசைப்படுத்து of variable embedded in another பொருள் (here, the array).

source: So, the last value of an array is given by <code>tab[tab.length - 1]</code>.
ta: So, the last மதிப்பு of an array is given by <code>tab[tab.length - 1]</code>.

source: Remember also that the amount of cells in an array can be retrieved with the <code>len()</code> function. So, if your array is called <code>tab</code>, its size can be retrieved as <code>len(tab)</code>.
ta: Remember also that the amount of cells in an array can be retrieved with the <code>len()</code> function. So, if your array is called <code>tab</code>, its அளவு can be retrieved அச் <code>len(tab)</code>.

source: So, the last value of an array is given by <code>tab[ len(tab) - 1]</code>.
ta: So, the last மதிப்பு of an array is given by <code>tab[ len(tab) - 1]</code>.

source: Index of the maximum value
ta: குறியெண் of the பெருமம் மதிப்பு

source: In this exercise, you must compute the index of the tab cell containing the biggest value.
ta: In this exercise, you must compute the குறியெண் of the தாவல் கலன் containing the biggest value.

source: For that, fill the <code>indexOfMaximum()</code> method. Its parameter is the array to explore. Should the array contain the searched value several times, you should return the index of the first occurrence.
ta: க்கு that, fill the <code>indexOfMaximum()</code> method. Its கூறளவு is the array பெறுநர் explore. Should the array contain the searched மதிப்பு several times, you should return the குறியெண் of the first occurrence.

source: To solve this exercise, you should sweep over the whole array. For each value, if it's bigger than the biggest value you saw so far, you must save this new champion and its position. You will thus need 2 extra variables; the initial value of the champion could be the value of the first cell.
ta: பெறுநர் solve this exercise, you should sweep வீச்சலகு the whole array. க்கு each value, if it's bigger than the biggest மதிப்பு you saw so far, you must சேமி this புதிய champion and its position. You will thus need 2 extra variables; the initial மதிப்பு of the champion could be the மதிப்பு of the first cell.

source: Average value
ta: Average மதிப்பு

source: The objective of this exercise is to compute the average value of the integer values stored in an array.
ta: The objective of this exercise is பெறுநர் compute the average மதிப்பு of the முழு எண் values stored in an array.

source: You have to fill the body of the method <code>average()</code> which takes as parameter the array of integers of which it computes and returns the average value. Please note that this method must return an integer.
ta: You have பெறுநர் fill the body of the method <code>average()</code> which takes அச் கூறளவு the array of integers of which it computes and returns the average value. Please குறிப்பு that this method must return an integer.

source: To compute the average value of an integer, it is necessary to traverse the whole array and to compute the sum of all its values (so you will need a variable to store this temporary result), then you have to divide this sum by the size of the array.
ta: பெறுநர் compute the average மதிப்பு of an integer, it is necessary பெறுநர் traverse the whole array and பெறுநர் compute the sum of அனைத்தும் its values (so you will need a variable பெறுநர் store this temporary result), then you have பெறுநர் divide this sum by the அளவு of the array.

source: In Java, you can get the size of an array <code>myarray</code> by consulting its <code>length</code> attribute (in other words, <code>myarray.length</code>). Notice that there is no parenthesis after <code>length</code>.
ta: In Java, you can get the அளவு of an array <code>myarray</code> by consulting its <code>length</code> பண்புக்கூறு (in மற்றொன்று words, <code>myarray.length</code>). Notice that there is இல்லை parenthesis after <code>length</code>.

source: In python, retrieving the size of an array <code>myarray</code> is as easy as calling <code>len(myarray)</code>.
ta: In python, retrieving the அளவு of an array <code>myarray</code> is அச் easy அச் calling <code>len(myarray)</code>.

source: Maximal value
ta: Maximal மதிப்பு

source: In this exercise, you must compute the maximal value contained in an array. For that, fill the <code>maximum()</code> method, which parameter is the array to explore.
ta: In this exercise, you must compute the maximal மதிப்பு contained in an array. க்கு that, fill the <code>maximum()</code> method, which கூறளவு is the array பெறுநர் explore.

source: To compute this value, sweep over the whole parameter. For each value, if it's bigger than the biggest value you saw so far, you must save this value somewhere to remember it afterward. You thus need an extra variable, which can be initialized to the value of the first array cell.
ta: பெறுநர் compute this value, sweep வீச்சலகு the whole parameter. க்கு each value, if it's bigger than the biggest மதிப்பு you saw so far, you must சேமி this மதிப்பு somewhere பெறுநர் remember it afterward. You thus need an extra variable, which can be initialized பெறுநர் the மதிப்பு of the first array cell.

source: Occurrence of a value
ta: Occurrence of a மதிப்பு

source: In this exercise, you must compute the amount of occurrences of a given value in an array (that is, the amount of time that this value appears in the array). For that, fill the <code>occurrences()</code> method, which returns the number of occurrence of <code>lookingFor</code> in <code>tab</code>.
ta: In this exercise, you must compute the amount of occurrences of a given மதிப்பு in an array (that is, the amount of time that this மதிப்பு appears in the array). க்கு that, fill the <code>occurrences()</code> method, which returns the எண் of occurrence of <code>lookingFor</code> in <code>tab</code>.

source: To compute this value, simply sweep over the array counting for the amount of cells containing the searched value. You thus need an extra variable for that.
ta: பெறுநர் compute this value, simply sweep வீச்சலகு the array counting க்கு the amount of cells containing the searched value. You thus need an extra variable க்கு that.

source: Maxima and Minima
ta: பெருமம் and சிறுமம்

source: In this exercise, you must return the difference between the maxima (i.e., the largest value of the array) and the minima (i.e., its smallest value). The returned value is then a positive number. Beware, you can only do one traversal of the array to gather all informations that you need.
ta: In this exercise, you must return the வேறுபாடு between the பெருமம் (i.e., the largest மதிப்பு of the array) and the சிறுமம் (i.e., its smallest value). The returned மதிப்பு is then a நேரமம் number. Beware, you can only do one traversal of the array பெறுநர் gather அனைத்தும் informations that you need.

source: Second Biggest Value
ta: Second Biggest மதிப்பு

source: In this exercise, you must compute the second maximal value contained in an array, i.e. the value that becomes the maximum if you remove every instance of the current maximum from the array.
ta: In this exercise, you must compute the second maximal மதிப்பு contained in an array, i.e. the மதிப்பு that becomes the பெருமம் if you அகற்று every instance of the மின்னோட்ட்ம், ஓட்டம் பெருமம் இருந்து the array.

source: As usual, you should gather the information in only one traversal of the array. You can assume that the second biggest value actual exists (there is at least two distinct values in the array), and that all values in the array are greater than [!python] -100000000.[/!] [!java|scala]<code>Integer.MIN_VALUE</code> (which is the smallest representable integer existing in [!thelang]).[/!]
ta: அச் usual, you should gather the செய்தி in only one traversal of the array. You can assume that the second biggest மதிப்பு actual exists (there is at least two distinct values in the array), and that அனைத்தும் values in the array அரே greater than [!python] -100000000.[/!] [!java|scala]<code>Integer.MIN_VALUE</code> (which is the smallest representable முழு எண் existing in [!thelang]).[/!]

source: This exercise was converted to PLM from the excellent exercising site http://codingbat.com/
ta: This exercise was converted பெறுநர் PLM இருந்து the excellent exercising site http://codingbat.com/

source: Given an array of integers, return the number of times that two 6's are next to each other in the array. Also count instances where the second "6" is actually a 7.
ta: Given an array of integers, return the எண் of பெருக்கல் that two 6's அரே அடுத்தது பெறுநர் each மற்றொன்று in the array. Also எண்ணுங்கள் instances where the second "6" is actually a 7.

source: Given an array of integers, return the number of 9's in the array.
ta: Given an array of integers, return the எண் of 9's in the array.

source: Given an array of integers, return true if one of the first 4 elements in the array is a 9. The array length may be less than 4.
ta: Given an array of integers, return true if one of the first 4 elements in the array is a 9. The array length சி-வைகாசி be less than 4.

source: Given an array of integers, we'll say that a triple is a value appearing 3 times in a row in the array. Return true if the array does not contain any triples.
ta: Given an array of integers, we'll say that a மும்மை is a மதிப்பு appearing 3 பெருக்கல் in a நிரை in the array. Return true if the array does not contain any triples.

source: Given an array of integers, return true if it contains a 2, 7, 1 pattern -- a value, followed by the value plus 5, followed by the initial value minus 1. So, 2,7,1 is such a pattern because 7 is 5+2 and 1 is 2-1. 3,8,2 is also such a pattern.
ta: Given an array of integers, return true if it contains a 2, 7, 1 pattern -- a value, followed by the மதிப்பு plus 5, followed by the initial மதிப்பு minus 1. So, 2,7,1 is such a pattern because 7 is 5+2 and 1 is 2-1. 3,8,2 is also such a pattern.

source: Additionally the 271 counts even if the "1" differs by 2 or less from the correct value.
ta: Additionally the 271 counts இரட்டை if the "1" differs by 2 or less இருந்து the சரியான value.

source: Golomb sequence
ta: Golomb வரிசை

source: The Golomb sequence is a non-decreasing integer sequence where a(n) is the number of times that n occurs in the sequence, with a(1) = 1.
ta: The Golomb வரிசை is a non-decreasing முழு எண் வரிசை where a(n) is the எண் of பெருக்கல் that n occurs in the sequence, with a(1) = 1.

source: Since a(1)=1, it means that 1 occurs only once in the sequence, so a(2) must be different. Since the sequence is non-decreasing, a(2) must be greater than 1. Since a(2)>1, the digit 2 must appear more than one time in the sequence. So a(2)=2.
ta: Since a(1)=1, it means that 1 occurs only once in the sequence, so a(2) must be different. Since the வரிசை is non-decreasing, a(2) must be greater than 1. Since a(2)>1, the digit 2 must appear more than one time in the sequence. So a(2)=2.

source: Since a(2)=2, there is two 2 in the sequence, so we know the value of a(3). And so on for the other values of the sequence.
ta: Since a(2)=2, there is two 2 in the sequence, so we know the மதிப்பு of a(3). And so on க்கு the மற்றொன்று values of the sequence.
