Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: In this universe you pilot a lunar lander. At each simulation step you're given the lander's position, speed, angle and thrust and must issue a command adjusting its angle and thrust.
ta: In this அண்டம் you pilot a lunar lander. At each பாவனை படி you're given the lander's position, speed, angle and thrust and must சிக்கல் a கட்டளை adjusting its angle and thrust.

source: Get the X and Y position of the lander.
ta: Get the ஃச் and ஒய் position of the lander.

source: Get the horizontal and vertical speed of the lander.
ta: Get the horizontal and vertical விரைவு of the lander.

source: Get or set the angle of the lander.
ta: Get or கணம் the angle of the lander.

source: An angle of 0° denotes a vertical position where the "head" of the lander points up. This is the angle you must land with. A positive angle denotes a left-leaning lander, a negative angle a right-leaning one. You cannot lean more than by ±90°, and the angle can vary by at most ±5° in one step.
ta: An angle of 0° denotes a vertical position where the "head" of the lander பிரிவகம் up. This is the angle you must land with. A நேரமம் angle denotes a left-leaning lander, a எதிர்மம் angle a right-leaning one. You cannot lean more than by ±90°, and the angle can vary by at பெரும்பாலானவை ±5° in one step.

source: Get or set the thrust of the lander.
ta: Get or கணம் the thrust of the lander.

source: You can only increment or decrement the thrust by 1 between two simulation steps, so if the current thrust is 2 and you ask for 4, you'll only get 3 in the next step. If you ask for less than 0 (resp. more than 4), everything will be as if you had asked for 0 (resp. 4).
ta: You can only increment or decrement the thrust by 1 between two பாவனை steps, so if the மின்னோட்ட்ம், ஓட்டம் thrust is 2 and you ask க்கு 4, you'll only get 3 in the அடுத்தது step. If you ask க்கு less than 0 (resp. more than 4), everything will be அச் if you had asked க்கு 0 (resp. 4).

source: Get the remaining fuel in the lander. At each step of the simulation the lander consumes as many fuel units as the current thrust. Once you run out of fuel you're in free fall so beware!
ta: Get the remaining எரிபொருள் in the lander. At each படி of the பாவனை the lander consumes அச் many எரிபொருள் units அச் the மின்னோட்ட்ம், ஓட்டம் thrust. Once you ஓடு out of எரிபொருள் you're in free fall so beware!

source: Get the vertices of the ground's profile from left to right. [!java|scala]You can retrieve the X and Y coordinates of each point with the corresponding methods of your point: <code>p.x()</code> and <code>p.y()</code>.[/!] [!python]Each point is an array of two integers denoting respectively the X and Y coordinates of that point.[/!]
ta: Get the vertices of the ground's சுயவிவரம் இருந்து இடது பெறுநர் right. [!java|scala]You can retrieve the ஃச் and ஒய் coordinates of each புள்ளியம் with the corresponding முறைகள் of your point: <code>p.x()</code> and <code>p.y()</code>.[/!] [!python]Each புள்ளியம் is an array of two integers denoting respectively the ஃச் and ஒய் coordinates of that point.[/!]

source: Congratulations! You won a (one-way) trip to Mars in a cereal box. NASA was kind enough to donate the Lunar Excursion Module for this mission, so that's what you'll be flying.
ta: Congratulations! You வோன் a (one-way) trip பெறுநர் Mars in a cereal box. NASA was kind enough பெறுநர் நன்கொடை the Lunar Excursion தொகுதி க்கு this mission, so that's what you'll be flying.

source: Before you take off, you must go through some basic landing simulation. You shouldn't have to fly the lander if all goes as planned but, as they say, "better safe than sorry".
ta: Before you take off, you must go through some அடிப்படை தரையிறக்கம் simulation. You shouldn't have பெறுநர் fly the lander if அனைத்தும் goes அச் planned but, அச் they say, "better safe than sorry".

source: Your mission is to <b>land the lander with a vertical speed of at most 10 m/s.</b> There are two ways you can influence the lander's course: by adjusting its angle or by adjusting its thrust. In this simulation we only care about adjusting the thrust, expressed in m/s².
ta: Your mission is பெறுநர் <b>land the lander with a vertical விரைவு of at பெரும்பாலானவை 10 m/s.</b> There அரே two ways you can influence the lander's course: by adjusting its angle or by adjusting its thrust. In this பாவனை we only care பற்றி adjusting the thrust, expressed in m/s².

source: The [!python]<code>step()</code> function[/!][!scala|java|c]code[/!] that you should write now will be called every 0.1 second during the simulation. Make sure that your code does not last too long, with no while loop! It should only set the desired thrust of the next simulation step, by calling <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code> where <code>desiredThrust</code> is some integer between 0 and 4 (that is, a thrust between 0 m/s² and 4 m/s²). You can only increment or decrement the thrust by 1 between two simulation steps, so if the current thrust is 2 and you ask for 4, you'll only get 3 in the next step. If you ask for less than 0 (resp. more than 4), everything will be as if you had asked for 0 (resp. 4).
ta: The [!python]<code>step()</code> function[/!][!scala|java|c]code[/!] that you should write now will be called every 0.1 second during the simulation. Make sure that your குறியீடு does not last too long, with இல்லை while loop! It should only கணம் the desired thrust of the அடுத்தது பாவனை step, by calling <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code> where <code>desiredThrust</code> is some முழு எண் between 0 and 4 (that is, a thrust between 0 m/s² and 4 m/s²). You can only increment or decrement the thrust by 1 between two பாவனை steps, so if the மின்னோட்ட்ம், ஓட்டம் thrust is 2 and you ask க்கு 4, you'll only get 3 in the அடுத்தது step. If you ask க்கு less than 0 (resp. more than 4), everything will be அச் if you had asked க்கு 0 (resp. 4).

source: In order to take informed decisions, you can query the lander's state. In this simulation you'll probably be interested in its vertical position: <code>[!java]double [/!]getY()[!scala]:Double[/!]</code>, and its vertical speed: <code>[!java]double [/!]getSpeedY()[!scala]:Double[/!]</code>. You can also ask for the thrust via <code>[!java]int [/!]getThrust()[!scala]:Integer[/!]</code> in case you don't remember what you asked for. Remember that Mars' gravity is 3.711 m/s², it might come in handy.
ta: In order பெறுநர் take informed decisions, you can query the lander's state. In this பாவனை you'll probably be interested in its vertical நிலை: <code>[!java]double [/!]getY()[!scala]:Double[/!]</code>, and its vertical speed: <code>[!java]double [/!]getSpeedY()[!scala]:Double[/!]</code>. You can also ask க்கு the thrust வழிமம் <code>[!java]int [/!]getThrust()[!scala]:Integer[/!]</code> in case you don't remember what you asked for. Remember that Mars' gravity is 3.711 m/s², it might come in handy.

source: One last thing: the lander is pretty small so you don't have much fuel. At each step of the simulation the lander consumes as many fuel units as the current thrust. Once you run out of fuel you're in free fall so beware! You can consult the remaining amount of available fuel units using <code>[!java]int [/!]getFuel()[!scala]:Integer[/!]</code>.
ta: One last thing: the lander is pretty small so you don't have much fuel. At each படி of the பாவனை the lander consumes அச் many எரிபொருள் units அச் the மின்னோட்ட்ம், ஓட்டம் thrust. Once you ஓடு out of எரிபொருள் you're in free fall so beware! You can consult the remaining amount of available எரிபொருள் units using <code>[!java]int [/!]getFuel()[!scala]:Integer[/!]</code>.

source: Locate a Landing Zone
ta: Locate a தரையிறக்கம் மண்டலம்

source: After 200 days of traveling space and eating cereals you finally reach Mars. Time to land at last!
ta: After 200 days of traveling இடைவெளி and eating cereals you finally reach Mars. Time பெறுநர் land at last!

source: The lander is on autopilot and all you have to do is look around and tell it where to land. The lander must <b>land on a flat zone</b> if you want to remain in one piece. You indicate the lander where to land by modifying the <code>getLandingZone</code> function so that it returns a [!java|scala]<code>Segment</code> representing the zone of your choice.
ta: The lander is on autopilot and அனைத்தும் you have பெறுநர் do is look around and tell it where பெறுநர் land. The lander must <b>land on a கிடைவளைவு zone</b> if you want பெறுநர் remain in one piece. You indicate the lander where பெறுநர் land by modifying the <code>getLandingZone</code> சார்பு so that it returns a [!java|scala]<code>Segment</code> representing the மண்டலம் of your choice.

source: A segment is composed of two <code>Point</code>s, each of them composed of two <code>double</code>s. A segment is built via the <code>Segment([!java]Point [/!]start[!scala]:Point[/!], [!java]Point [/!]end[!scala]:Point[/!])</code> constructor. A point is built via the <code>Point([!java]double [/!]x[!scala]:Double[/!], [!java]double [/!]y[!scala]:Double[/!])</code> constructor. A point's coordinates are accessible via its <code>[!java]double [/!]x()[!scala]:Double[/!]</code> and <code>[!java]double [/!]y()[!scala]:Double[/!]</code> methods.
ta: A segment is composed of two <code>Point</code>s, each of them composed of two <code>double</code>s. A segment is built வழிமம் the <code>Segment([!java]Point [/!]start[!scala]:Point[/!], [!java]Point [/!]end[!scala]:Point[/!])</code> constructor. A புள்ளியம் is built வழிமம் the <code>Point([!java]double [/!]x[!scala]:Double[/!], [!java]double [/!]y[!scala]:Double[/!])</code> constructor. A point's coordinates அரே accessible வழிமம் its <code>[!java]double [/!]x()[!scala]:Double[/!]</code> and <code>[!java]double [/!]y()[!scala]:Double[/!]</code> methods.

source: [/!] [!python]tuple of two X coordinates representing the zone of your choice.[/!]
ta: [/!] [!python]tuple of two ஃச் coordinates representing the மண்டலம் of your choice.[/!]

source: In order to determine which zone to return, you'll need to call <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]List[Point][/!]</code>, which returns the vertices of the ground's profile as a list of [!java|scala]<code>Point</code>[/!] [!python]tuples (x,y)[/!].
ta: In order பெறுநர் determine which மண்டலம் பெறுநர் return, you'll need பெறுநர் call <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]List[Point][/!]</code>, which returns the vertices of the ground's சுயவிவரம் அச் a பட்டியல் of [!java|scala]<code>Point</code>[/!] [!python]tuples (x,y)[/!].

source: One more thing: your function should return a valid flat zone in any kind of situation, not just for the currently visualized one. That's because it will be not only tested against that world, but also against the one we had in the previous exercise. As usual, you can see the other existing worlds with the appropriate combobox.
ta: One more thing: your சார்பு should return a valid கிடைவளைவு மண்டலம் in any kind of situation, not just க்கு the currently visualized one. That's because it will be not only tested against that world, but also against the one we had in the previous exercise. அச் usual, you can see the மற்றொன்று existing worlds with the appropriate combobox.

source: Have a safe landing! Don't forget to put on your space suit on your way out.
ta: Have a safe landing! Don't forget பெறுநர் put on your இடைவெளி suit on your way out.

source: After 30 days of staring at rocks and eating cereals you decide it's time to go explore other parts of the planet.
ta: After 30 days of staring at rocks and eating cereals you decide it's time பெறுநர் go explore மற்றொன்று பாகங்கள் of the planet.

source: You fly for a while and suddenly realize you're almost out of fuel. Unfortunately you're in a delicate situation and the autopilot is helpless. You will have to pilot the lander yourself. Your mission is to <b>land the lander on a flat zone with a vertical speed less than 10 m/s, an horizontal speed less than 5 m/s and an angle of 0°.</b>
ta: You fly க்கு a while and suddenly realize you're almost out of fuel. Unfortunately you're in a delicate situation and the autopilot is helpless. You will have பெறுநர் pilot the lander yourself. Your mission is பெறுநர் <b>land the lander on a கிடைவளைவு மண்டலம் with a vertical விரைவு less than 10 m/s, an horizontal விரைவு less than 5 m/s and an angle of 0°.</b>

source: You must define two functions: <code>[!java]void [/!]initialize()</code> and <code>[!java]void [/!]step()</code>. <code>initialize()</code> is called once just after you press "Run". You can use it to chose some flat zone. As before, <code>step()</code> is called every 0.1 second and is used for adjusting the lander's thrust and angle. As in the first exercise the lander's thrust is adjusted via <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code>. But you can also control its angle via <code>[!java]void [/!]setDesiredAngle([!java]double [/!]desiredAngle[!scala]:Double[/!])</code>. An angle of 0° denotes a vertical position where the "head" of the lander points up. This is the angle you must land with. A positive angle denotes a left-leaning lander, a negative angle a right-leaning one. You cannot lean more than by ±90°, and the angle can vary by at most ±5° in one step.
ta: You must define two functions: <code>[!java]void [/!]initialize()</code> and <code>[!java]void [/!]step()</code>. <code>initialize()</code> is called once just after you press "Run". You can use it பெறுநர் chose some கிடைவளைவு zone. அச் before, <code>step()</code> is called every 0.1 second and is used க்கு adjusting the lander's thrust and angle. அச் in the first exercise the lander's thrust is சருசெய்த வழிமம் <code>[!java]void [/!]setDesiredThrust([!java]int [/!]desiredThrust[!scala]:Integer[/!])</code>. But you can also control its angle வழிமம் <code>[!java]void [/!]setDesiredAngle([!java]double [/!]desiredAngle[!scala]:Double[/!])</code>. An angle of 0° denotes a vertical position where the "head" of the lander பிரிவகம் up. This is the angle you must land with. A நேரமம் angle denotes a left-leaning lander, a எதிர்மம் angle a right-leaning one. You cannot lean more than by ±90°, and the angle can vary by at பெரும்பாலானவை ±5° in one step.

source: As in the previous exercise, <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]:List[Point][/!]</code> returns the vertices of the ground's profile from left to right. Please refer to the documentation (Help/About this world) for a reference manual of your lunar lander.
ta: அச் in the previous exercise, <code>[!java]List&lt;Point&gt; [/!]getGround()[!scala]:List[Point][/!]</code> returns the vertices of the ground's சுயவிவரம் இருந்து இடது பெறுநர் right. Please refer பெறுநர் the ஆவணப்படுத்துதல் (Help/About this world) க்கு a குறிப்பு manual of your lunar lander.

source: As before, your program must safely land the lander in all the situations encountered so far in addition to this new one.
ta: அச் before, your திட்டம் must safely land the lander in அனைத்தும் the situations encountered so far in கூட்டல் பெறுநர் this புதிய one.

source: Good luck, try not to crash!
ta: Good luck, try not பெறுநர் crash!

source: The PLM Main Window
ta: The PLM Main சாளரம்

source: The PLM working environment should be self-explanatory, in particular with the tool tips appearing when your mouse is over the elements. Here is a little explanation of the components in case you fail to understand something. The main window is made of 5 main components:
ta: The PLM working சூழல் should be self-explanatory, in particular with the கருவி tips appearing when your mouse is வீச்சலகு the elements. Here is a little explanation of the கூறுகள் in case you fail பெறுநர் understand something. The main சாளரம் is made of 5 main components:

source: <b>The menu:</b> Placed on top of the window, it gives you access to some advanced commands such as exiting the program, and some other that we will detail later.
ta: <b>The menu:</b> Placed on மேலே of the window, it gives you access பெறுநர் some மேம்பட்ட கட்டளைகள் such அச் exiting the program, and some மற்றொன்று that we will detail later.

source: <b>The tool bar:</b> Placed just below the menu, it gives you access to the four main commands:
ta: <b>The கருவி bar:</b> Placed just below the menu, it gives you access பெறுநர் the நான்கு, நாலடி, நான்கடி main commands:

source: The <b>Start</b> button, which begins the compilation and execution of the code you may have typed in the editor. At the end of the execution, it verifies whether you reach the situation constituting the objective of the exercise or not. If yes, you gain access to the next exercise using the <b>Exercise</b> menu. If not, you need to rework your code.
ta: The <b>Start</b> button, which begins the compilation and execution of the குறியீடு you சி-வைகாசி have typed in the editor. At the end of the execution, it verifies whether you reach the situation constituting the objective of the exercise or not. If yes, you பெருக்கம் access பெறுநர் the அடுத்தது exercise using the <b>Exercise</b> menu. If not, you need பெறுநர் rework your code.

source: The <b>Stop</b> button allows you to interupt the execution of your code, what may reveal useful if you encounter an <i>infinite loop</i>.
ta: The <b>Stop</b> button allows you பெறுநர் interupt the execution of your code, what சி-வைகாசி reveal useful if you encounter an <i>infinite loop</i>.

source: The <b>Reset</b> button can be used to reset the world into its initial state.
ta: The <b>Reset</b> button can be used பெறுநர் மீட்டமை the world into its initial state.

source: The <b>Demo</b> button shows you the execution of the expected solution. During its execution, you may want to switch the seen world to see the different expected solutions.
ta: The <b>Demo</b> button shows you the execution of the expected solution. During its execution, you சி-வைகாசி want பெறுநர் ஆளி, நிலைமாறி the seen world பெறுநர் see the different expected solutions.

source: Please note that there is often several ways of achieving the awaited solution, and that the one presented during the demo is not more or less correct than the others. You are completely free to not follow strictly the process shown by the demo, as long as your final solution matches the exercise expectations.
ta: Please குறிப்பு that there is often several ways of achieving the awaited solution, and that the one presented during the demo is not more or less சரியான than the others. You அரே completely free பெறுநர் not follow strictly the process shown by the demo, அச் long அச் your final நீர்மக்கூழ் matches the exercise expectations.

source: <b>Mission and editor tabs:</b> this is were you read this very text. This area contains several tabs to which you can access by clicking on their name on the top left. The first tab (which is always named <b>Mission</b>) contains a presentation of the current exercise. To solve an exercise, you need to write your code in the other tabs. For example, you can now clic on the <b>Source Code</b> tab to see the actual source. If it is empty, that's because you did not write any code yet.
ta: <b>Mission and திருத்தி tabs:</b> this is were you read this very text. This area contains several தாவல்கள் பெறுநர் which you can access by clicking on their பெயர் on the மேலே left. The first தாவல் (which is எப்போதும் named <b>Mission</b>) contains a presentation of the மின்னோட்ட்ம், ஓட்டம் exercise. பெறுநர் solve an exercise, you need பெறுநர் write your குறியீடு in the மற்றொன்று tabs. க்கு example, you can now clic on the <b>Source Code</b> தாவல் பெறுநர் see the actual source. If it is empty, that's because you did not write any குறியீடு yet.

source: <b>The console:</b> Placed under the tabs, this is where any messages of the application will appear. This area is initially empty and white.
ta: <b>The console:</b> Placed under the tabs, this is where any செய்திகள் of the application will appear. This area is initially வெறுமை and white.

source: <b>World view</b> Placed on the right of the tabs, it is constituted of five elements:
ta: <b>World view</b> Placed on the வலது of the tabs, it is constituted of five elements:

source: A scrolling menu allows to choose the world. Indeed, the program you write may be executed in several worlds to test it in differing conditions. This menu allows you to choose the world you want to see. Note that this scrolling menu is hidden if there is only one world in your exercise.
ta: A scrolling பட்டியல் allows பெறுநர் choose the world. Indeed, the திட்டம் you write சி-வைகாசி be executed in several worlds பெறுநர் தேர்வு it in differing conditions. This பட்டியல் allows you பெறுநர் choose the world you want பெறுநர் see. குறிப்பு that this scrolling பட்டியல் is hidden if there is only one world in your exercise.

source: A slider placed right bellow allows to choose the animation speed of the world. More precisely, it allows to choose the delay (in milliseconds) that the buggles must wait after each action to allow you to see what they are doing.
ta: A slider placed வலது bellow allows பெறுநர் choose the animation விரைவு of the world. More precisely, it allows பெறுநர் choose the சுணக்கம் (in milliseconds) that the buggles must wait after each செயல் பெறுநர் allow you பெறுநர் see what they அரே doing.

source: A tab <b>World</b> represents the view of the world currently selected (from the scrolling menu). This view is thus constitued of a grid forming the several cells of the world, as well as several <i>buggles</i> awaiting for your orders.
ta: A தாவல் <b>World</b> represents the பார்வை of the world currently தேர்ந்தெடுக்கப்பட்டது (from the scrolling menu). This பார்வை is thus constitued of a வலைவாய் forming the several cells of the world, அச் well அச் several <i>buggles</i> awaiting க்கு your orders.

source: An <b>Objective</b> tab displaying the world as it must be by the end of the exercise.
ta: An <b>Objective</b> தாவல் displaying the world அச் it must be by the end of the exercise.

source: <b>The interactive controls</b>. Placed under the world view, these buttons allows you to interactively control the buggles. This way, you can try to <i>manually</i> bring your buggle to the scenario objective before writting the needed code in the editor.
ta: <b>The interactive controls</b>. Placed under the world view, these buttons allows you பெறுநர் interactively control the buggles. This way, you can try பெறுநர் <i>manually</i> bring your buggle பெறுநர் the scenario objective before writting the needed குறியீடு in the editor.

source: A scrolling menu allows to select the buggle you want to control.
ta: A scrolling பட்டியல் allows பெறுநர் தேர்ந்தெடு the buggle you want பெறுநர் control.

source: The <b>Forward</b> button let your buggle do one step forward.
ta: The <b>Forward</b> button let your buggle do one படி forward.

source: The <b>Backward</b> button let it do one step backward.
ta: The <b>Backward</b> button let it do one படி backward.

source: The <b>Turn left</b> button ask your buggle to turn of 90° to its left.
ta: The <b>Turn left</b> button ask your buggle பெறுநர் turn of 90° பெறுநர் its left.

source: The <b>Turn right</b> button asks the buggle to turn to the right (isn't this amazing?).
ta: The <b>Turn right</b> button asks the buggle பெறுநர் turn பெறுநர் the வலது (isn't this amazing?).

source: The <b>Mark</b> button requests your buggle to leave a mark behind it when it goes.
ta: The <b>Mark</b> button requests your buggle பெறுநர் leave a mark behind it when it goes.
