Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Don't get lost on false leads! <code>The hunt()</code> method was given a parameter to tell you which color to follow (and it is not the same in all worlds). Add a parameter to your <code>isFacingTrail()</code> method to only follow the requested color, as the other colors lead to dead ends...
ta: Don't get lost on false leads! <code>The hunt()</code> method was given a கூறளவு பெறுநர் tell you which color பெறுநர் follow (and it is not the same in அனைத்தும் worlds). கூட்டு a கூறளவு பெறுநர் your <code>isFacingTrail()</code> method பெறுநர் only follow the requested color, அச் the மற்றொன்று colors ஈயம் பெறுநர் dead ends...

source: Buggle Dance Revolution (BDR)
ta: Buggle Dance சுற்று (BDR)

source: After these races, it's time to party! For that, we will teach the buggles to play Dance Revolution, this game beloved of some students: The player has to move the feet on the carpet according to the instructions presented on the screen, and following the music. But before that, we have some details to study first.
ta: After these races, it's time பெறுநர் party! க்கு that, we will teach the buggles பெறுநர் play Dance Revolution, this game beloved of some students: The player has பெறுநர் move the feet on the carpet according பெறுநர் the instructions presented on the screen, and following the music. But before that, we have some details பெறுநர் study first.

source: There is one detail we omitted about the conditional syntax: if a branch contains only one instruction, then the curly braces become optional. So, the two chunk of code are equivalent:
ta: There is one detail we omitted பற்றி the conditional syntax: if a branch contains only one instruction, then the curly braces become optional. So, the two chunk of குறியீடு அரே equivalent:

source: Actually, you can do the same for loops body that are reduced to one instruction only. But beware, this becomes dangerous if you chain the <tt>if</tt> instructions like this:
ta: Actually, you can do the same க்கு வளையங்கள் body that அரே reduced பெறுநர் one instruction only. But beware, this becomes dangerous if you சங்கிலி the <tt>if</tt> instructions like this:

source: You think that <code>right()</code> refers to the first <code>if</code> and get executed when <code>isOverBaggle()</code> returns false, but in fact, it refers to the second one <code>if</code> and will be executed when <code>isOverBaggle()</code> returns true and <code>x != 5</code>. Yes, despite the indentation, the buggle understands the previous code as follows:
ta: You think that <code>right()</code> refers பெறுநர் the first <code>if</code> and get executed when <code>isOverBaggle()</code> returns false, but in fact, it refers பெறுநர் the second one <code>if</code> and will be executed when <code>isOverBaggle()</code> returns true and <code>x != 5</code>. Yes, despite the indentation, the buggle understands the previous குறியீடு அச் follows:

source: In [!thelang] the computer connects a <tt>else</tt> branch to the closest <tt>if</tt>. If you find it ambiguous, you should add more braces than strictly necessary. Computers don't even look at the indentation in [!thelang]. The previous code could even be written as follows and lead to the same result.
ta: In [!thelang] the கணிப்பொறி, கணிணி connects a <tt>else</tt> branch பெறுநர் the closest <tt>if</tt>. If you கண்டுபிடி it ambiguous, you should கூட்டு more braces than strictly necessary. Computers don't இரட்டை look at the உள்தள்ளல் in [!thelang]. The previous குறியீடு could இரட்டை be written அச் follows and ஈயம் பெறுநர் the same result.

source: But for humans, <b>you really want to indent your code correctly correctly</b>. For example if you want a professor to review or even grade your code, if you want to reuse your own code later, or even if you need to debug it. That is right: you need to write readable code for your own comfort.
ta: But க்கு humans, <b>you really want பெறுநர் indent your குறியீடு correctly correctly</b>. க்கு example if you want a professor பெறுநர் சீராய்வு or இரட்டை grade your code, if you want பெறுநர் reuse your own குறியீடு later, or இரட்டை if you need பெறுநர் debug it. That is வலது: you need பெறுநர் write readable குறியீடு க்கு your own comfort.

source: You sometimes want to ask the buggle something similar to:
ta: You sometimes want பெறுநர் ask the buggle something similar இதற்கு:

source: if it's raining, take an umbrella; if not, and if it's a hot day, take a bottle of water; if not and if it's July 4th, take an American flag
ta: if it's raining, take an umbrella; if not, and if it's a hot day, take a bottle of water; if not and if it's ஆ-ஆடி 4th, take an அமேரிகன் flag

source: The trap is that we want at most one of these actions to be taken. That is to say, if it's raining a very hot July 4th, we don't want the buggle to get outside with an umbrella, some water and a flag, but simply with an umbrella. The following code is thus WRONG.
ta: The trap is that we want at பெரும்பாலானவை one of these செயல்கள் பெறுநர் be taken. That is பெறுநர் say, if it's raining a very hot ஆ-ஆடி 4th, we don't want the buggle பெறுநர் get outside with an umbrella, some water and a flag, but simply with an umbrella. The following குறியீடு is thus WRONG.

source: Indeed, since the conditions are evaluated one after the other, there is a risk that you go to the July 4th march on a rainy day. Instead, we should use something like this to ensure that once we found a true condition, we won't evaluate the next ones.
ta: Indeed, since the conditions அரே evaluated one after the other, there is a இடர் that you go பெறுநர் the ஆ-ஆடி 4th மா-பங்குனி on a rainy day. Instead, we should use something like this பெறுநர் ensure that once we found a true condition, we won't evaluate the அடுத்தது ones.

source: Unfortunately, such a cascade of conditionals is quite difficult to read. It is better to [!java|scala|c]omit the curly braces for the <tt>else</tt> statements. Some languages even introduce a specific construct for these <tt>else if</tt>, but not [!thelang].[/!] [!python]change the sub-blocks using the <code>elif</code> keyword to mark explicitly these "else if" branches.[/!]
ta: Unfortunately, such a ஓடையிணைப்பு of conditionals is quite difficult பெறுநர் read. It is better பெறுநர் [!java|scala|c]omit the curly braces க்கு the <tt>else</tt> statements. Some மொழிகள் இரட்டை introduce a specific construct க்கு these <tt>else if</tt>, but not [!thelang].[/!] [!python]change the sub-blocks using the <code>elif</code> keyword பெறுநர் mark explicitly these "else if" branches.[/!]

source: Buggles can tag graffitis on the ground of their world. For that, they use the four following methods:
ta: Buggles can tag graffitis on the ground of their world. க்கு that, they use the நான்கு, நாலடி, நான்கடி following methods:

source: <code>[!c]int[/!][!java]boolean[/!] isOverMessage()[!scala]:Boolean[/!]</code>: returns <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> if and only if there is a message on the ground.
ta: <code>[!c]int[/!][!java]boolean[/!] isOverMessage()[!scala]:Boolean[/!]</code>: returns <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> if and only if there is a செய்தி on the ground.

source: <code>[!c]char*[/!][!java]String[/!] readMessage()[!scala]: String[/!]</code>: returns the message written on the ground (or an empty string if nothing is written).
ta: <code>[!c]char*[/!][!java]String[/!] readMessage()[!scala]: String[/!]</code>: returns the செய்தி written on the ground (or an வெறுமை சரம் if nothing is written).

source: <code>[!java|c]void[/!] writeMessage([!c]char*[/!][!java]String [/!]msg[!scala]: String[/!])</code>: writes the specified message down on the ground. If there is already a message on the ground, the new content is added at the end of the existing message.
ta: <code>[!java|c]void[/!] writeMessage([!c]char*[/!][!java]String [/!]msg[!scala]: String[/!])</code>: writes the specified செய்தி down on the ground. If there is already a செய்தி on the ground, the புதிய content is added at the end of the existing message.

source: The goal is then to organize a BDR game between the buggles by teaching them to move according to the instructions written on the ground. These instructions are messages written on the ground, with the following signification:
ta: The goal is then பெறுநர் organize a BDR game between the buggles by teaching them பெறுநர் move according பெறுநர் the instructions written on the ground. These instructions அரே செய்திகள் written on the ground, with the following signification:

source: Message
ta: செய்தி

source: What to do
ta: What பெறுநர் do

source: Turn right and move one step forward
ta: Turn வலது and move one படி forward

source: Right
ta: வலது

source: Turn left and move one step forward
ta: Turn இடது and move one படி forward

source: Left
ta: இடது

source: Turn back (U-turn) and move one step forward
ta: Turn பின் (U-turn) and move one படி forward

source: Move one step forward
ta: Move one படி forward

source: Move two steps forward
ta: Move two படிகள் forward

source: Move three steps forward
ta: Move three படிகள் forward

source: Move one step backward
ta: Move one படி பின்னோக்கு

source: Move two steps backward
ta: Move two படிகள் பின்னோக்கு

source: Move three steps backward
ta: Move three படிகள் பின்னோக்கு

source: Stop dancing.
ta: நிறுத்து dancing.

source: This exercise may seem a bit complex at the first glance, but it comes down to summarizing the information of the table in a sequence of conditionals.
ta: This exercise சி-வைகாசி seem a துணுக்கு அணைவு at the first glance, but it comes down பெறுநர் summarizing the செய்தி of the table in a வரிசை of conditionals.

source: You have to keep dancing as long as there is some dancing steps to do, i.e., as long as we are in a cell which content is described in the table. The easier for that is to use a boolean variable (<code>finished</code>) as termination condition to a <code>while</code> loop. It should be initialized to <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>, and switched to <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> as soon as the buggle find a cell with a value not described in the table. Thus, the loop will stop and the program will terminate.
ta: You have பெறுநர் keep dancing அச் long அச் there is some dancing படிகள் பெறுநர் do, i.e., அச் long அச் we அரே in a கலன் which content is described in the table. The easier க்கு that is பெறுநர் use a boolean variable (<code>finished</code>) அச் termination condition பெறுநர் a <code>while</code> loop. It should be initialized பெறுநர் <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>, and switched பெறுநர் <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> அச் soon அச் the buggle கண்டுபிடி a கலன் with a மதிப்பு not described in the table. Thus, the loop will நிறுத்து and the திட்டம் will terminate.

source: Another subtlety is that detecting if strings are equals is a bit annoying in [!thelang]. So, we use the <code>char getIndication[!c]Bdr[/!]()</code> instead of <code>[!java]String[/!][!c]char*[/!] readMessage()</code>. This method, only known by the buggles of this exercise, returns the first char of the message written on the ground (or ' ' -- the space char -- if nothing is written down). It enables to work with chars instead of strings, that is much simpler in [!thelang].
ta: Another subtlety is that detecting if சரங்கள் அரே equals is a துணுக்கு annoying in [!thelang]. So, we use the <code>char getIndication[!c]Bdr[/!]()</code> instead of <code>[!java]String[/!][!c]char*[/!] readMessage()</code>. This method, only known by the buggles of this exercise, returns the first char of the செய்தி written on the ground (or ' ' -- the இடைவெளி char -- if nothing is written down). It enables பெறுநர் வேலை with chars instead of strings, that is much simpler in [!thelang].

source: If you fail to understand why the buggle does not execute the expected steps, try adding <code>brushDown()</code> in your method. This asks the buggle to put down a brush leaving a trail when it moves. It should help you understanding its trajectory, but do not forget to remove this call when you want to test whether your code is a valid solution to the exercise: you are asked to let the buggle dance, not to vandalize the dance floor.
ta: If you fail பெறுநர் understand why the buggle does not execute the expected steps, try adding <code>brushDown()</code> in your method. This asks the buggle பெறுநர் put down a மின்தொடி leaving a trail when it moves. It should உதவி you understanding its trajectory, but do not forget பெறுநர் அகற்று this call when you want பெறுநர் தேர்வு whether your குறியீடு is a valid நீர்மக்கூழ் பெறுநர் the exercise: you அரே asked பெறுநர் let the buggle dance, not பெறுநர் vandalize the dance floor.

source: When your program finally works, move on to the next exercise.
ta: When your திட்டம் finally works, move on பெறுநர் the அடுத்தது exercise.

source: Buggle Dance Revolution 2 (BDR2)
ta: Buggle Dance சுற்று 2 (BDR2)

source: BDR is cool, but it's a bit chaotic. First, the buggles giggle in any directions, and then the code you had to write to let them move is rather difficult to read. Here is a new BDR world where the buggle will dance a gentle circle. We will benefit this tranquillity to clean up a bit our code thanks to the new constructs we will introduce.
ta: BDR is cool, but it's a துணுக்கு chaotic. First, the buggles giggle in any directions, and then the குறியீடு you had பெறுநர் write பெறுநர் let them move is rather difficult பெறுநர் read. Here is a புதிய BDR world where the buggle will dance a gentle circle. We will benefit this tranquillity பெறுநர் clean மேலே a துணுக்கு our குறியீடு thanks பெறுநர் the புதிய constructs we will introduce.

source: The hardest part of previous code is certainly the conditional cascading. Somewhere in your code, you certainly had something similar to:
ta: The hardest பகுதி of previous குறியீடு is certainly the conditional cascading. Somewhere in your code, you certainly had something similar இதற்கு:

source: if ([!java|c]getIndication() == 'R'[/!][!scala]readMessage() == "R"[/!]) { right(); [!c]stepForward()[/!][!java|scala]forward()[/!]; } else if ([!java|c]getIndication() == 'L'[/!][!scala]readMessage() == "L"[/!]) { left(); [!c]stepForward()[/!][!java|scala]forward()[/!]; } else if ([!java|c]getIndication() == 'I'[/!][!scala]readMessage() == "I"[/!]) { back(); [!c]stepForward()[/!][!java|scala]forward()[/!]; <span class="comment">/* other else if */</span> } else { finished = [!c]1[/!][!java|scala]true[/!]; }
ta: if ([!java|c]getIndication() == 'R'[/!][!scala]readMessage() == "R"[/!]) { right(); [!c]stepForward()[/!][!java|scala]forward()[/!]; } else if ([!java|c]getIndication() == 'L'[/!][!scala]readMessage() == "L"[/!]) { left(); [!c]stepForward()[/!][!java|scala]forward()[/!]; } else if ([!java|c]getIndication() == 'I'[/!][!scala]readMessage() == "I"[/!]) { back(); [!c]stepForward()[/!][!java|scala]forward()[/!]; <span class="comment">/* மற்றொன்று else if */</span> } else { finished = [!c]1[/!][!java|scala]true[/!]; }

source: When you review this code, it may not be clear at the first glance that it is simply a choice with 4 branches depending on the value of [!java|c]getIndication()[/!][!scala]readMessage()[/!]. To improve this, we will use a [!java|c]<code>switch</code> construct, which Java syntax is the following:[/!] [!scala] pattern matching, which is a very powerful construct that greatly generalizes the <code>if</code>. It is arguably one of the major advantages of Scala when compared to languages such as Java or python. It is not new either, as other languages such as OCaml or Haskell offer this feature since long, but still. It's really cool![/!]
ta: When you சீராய்வு this code, it சி-வைகாசி not be clear at the first glance that it is simply a choice with 4 branches depending on the மதிப்பு of [!java|c]getIndication()[/!][!scala]readMessage()[/!]. பெறுநர் improve this, we will use a [!java|c]<code>switch</code> construct, which சாவா syntax is the following:[/!] [!scala] pattern matching, which is a very powerful construct that greatly generalizes the <code>if</code>. It is arguably one of the major advantages of Scala when compared பெறுநர் மொழிகள் such அச் சாவா or python. It is not புதிய either, அச் மற்றொன்று மொழிகள் such அச் OCaml or Haskell offer this feature since long, but still. It's really cool![/!]

source: switch (<b>expression</b>) { case <b>firstValue</b>: <b>whatToDoIfExpressionEqualsFirstValue();</b> break; case <b>secondValue</b>: <b>whatToDoIfExpressionEqualsSecondValue();</b> break; case <b>thirdValue</b>: <b>whatToDoIfExpressionEqualsThirdValue();</b> break; /* as much similar cases as you want */ default: <b>whatToDoIfExpressionDoesNotEqualsAnySeenValues();</b> }
ta: ஆளி, நிலைமாறி (<b>expression</b>) { case <b>firstValue</b>: <b>whatToDoIfExpressionEqualsFirstValue();</b> break; case <b>secondValue</b>: <b>whatToDoIfExpressionEqualsSecondValue();</b> break; case <b>thirdValue</b>: <b>whatToDoIfExpressionEqualsThirdValue();</b> break; /* அச் much similar cases அச் you want */ default: <b>whatToDoIfExpressionDoesNotEqualsAnySeenValues();</b> }

source: Observe that each branch of a <tt>switch</tt> must be ended by a <code>break</code>. If you forget this, the machine keeps going and execute the next branch in the list after the branch it jumped to. There is even some <b>rare</b> cases where this behavior reveals helpful.
ta: Observe that each branch of a <tt>switch</tt> must be ended by a <code>break</code>. If you forget this, the machine keeps going and execute the அடுத்தது branch in the பட்டியல் after the branch it jumped to. There is இரட்டை some <b>rare</b> cases where this behavior reveals helpful.

source: It is then possible to rewrite previous BDR code in a cleaner way using the <tt>switch</tt> construct:
ta: It is then possible பெறுநர் rewrite previous BDR குறியீடு in a cleaner way using the <tt>switch</tt> construct:

source: switch (getIndication()) { case 'R': right(); [!c]stepForward()[/!][!java]forward()[/!]; break; case 'L': left(); [!c]stepForward()[/!][!java]forward()[/!]; break; case 'I': back(); [!c]stepForward()[/!][!java]forward()[/!]; break; default: return; }
ta: ஆளி, நிலைமாறி (getIndication()) { case 'R': right(); [!c]stepForward()[/!][!java]forward()[/!]; break; case 'L': left(); [!c]stepForward()[/!][!java]forward()[/!]; break; case 'I': back(); [!c]stepForward()[/!][!java]forward()[/!]; break; default: return; }

source: <i>expression</i> <b>match</b> { <b>case</b> <i>possible value</i> <b>=></b> instructions <b>case</b> <i>other value</i> <b>=></b> other instructions <b>case</b> <i>another value</i> <b>=></b> yet another instructions <b>case _ =></b> default instructions }
ta: <i>expression</i> <b>match</b> { <b>case</b> <i>possible value</i> <b>=></b> instructions <b>case</b> <i>other value</i> <b>=></b> மற்றொன்று instructions <b>case</b> <i>another value</i> <b>=></b> yet another instructions <b>case _ =></b> இயல்புநிலை instructions }

source: The expression provided before the keyword <code>match</code>, and then the branches are evaluated one after the other until we find one which value provided between <code>case</code> and <code>=&gt</code> is equal to the expression's value. The <code>_</code> symbol acts as a wildcard, so the <code>_</code> branch <i>always</i> matches. Here is an example where a variable <code>name</code> is matched.
ta: The கோவை provided before the keyword <code>match</code>, and then the branches அரே evaluated one after the மற்றொன்று until we கண்டுபிடி one which மதிப்பு provided between <code>case</code> and <code>=&gt</code> is equal பெறுநர் the expression's value. The <code>_</code> symbol acts அச் a wildcard, so the <code>_</code> branch <i>always</i> matches. Here is an example where a variable <code>name</code> is matched.

source: name match { case "Martin" => println("Hello Martin, how are you?") case "Gerald" => println("Hey Gerald! How are you doing?") case _ => println("Welcome stranger.") }
ta: பெயர் match { case "Martin" => println("Hello Martin, how அரே you?") case "Gerald" => println("Hey Gerald! How அரே you doing?") case _ => println("Welcome stranger.") }

source: It is possible to have more than one instruction per branch, and merge branches when the values are separated by a | symbol.
ta: It is possible பெறுநர் have more than one instruction per branch, and merge branches when the values அரே separated by a | symbol.

source: name match { case "Martin" | "Gerald" => println("Hello "+name+", how are you?"); openTheDoor() case _ => println("Hello stranger. Please do not pass."); lockTheDoor() }
ta: பெயர் match { case "Martin" | "Gerald" => println("Hello "+name+", how அரே you?"); openTheDoor() case _ => println("Hello stranger. Please do not pass."); lockTheDoor() }

source: You can even add guards to your branches. These are extra conditions that must be respected for the branch to get applied. This is handy if you want match on value ranges, as follows.
ta: You can இரட்டை கூட்டு guards பெறுநர் your branches. These அரே extra conditions that must be respected க்கு the branch பெறுநர் get applied. This is handy if you want match on மதிப்பு ranges, அச் follows.

source: Note that there is no need to check whether the value is higher than 10 on the second line because the first matching branch is used. So, if the second branch gets evaluated, then the first one did not match.
ta: குறிப்பு that there is இல்லை need பெறுநர் சரிபார் whether the மதிப்பு is higher than 10 on the second வரி because the first matching branch is used. So, if the second branch gets evaluated, then the first one did not match.

source: Finally, it is possible also to match several variables in one shoot!
ta: Finally, it is possible also பெறுநர் match several மாறிகள் in one shoot!

source: (x,y) match { case (0,0) => println("that's the origin") case (_,0) => println("On the ordinate") case (0,_) => println("On the abscissa") case (_,_) => println("Some random point") }
ta: (x,y) match { case (0,0) => println("that's the origin") case (_,0) => println("On the ordinate") case (0,_) => println("On the abscissa") case (_,_) => println("Some சீரற்ற point") }

source: [!java|scala|c]Apply the improvement we just saw to rewrite your buggle code with the following dance steps. [/!] [!python]Let's teach a new dance step to the buggles. It is slightly more complex but actually better looking. Beside of that, that's the same old story.[/!] Note that we can now move up to 6 cells in one dance step.
ta: [!java|scala|c]Apply the improvement we just saw பெறுநர் rewrite your buggle குறியீடு with the following dance steps. [/!] [!python]Let's teach a புதிய dance படி பெறுநர் the buggles. It is slightly more அணைவு but actually better looking. Beside of that, that's the same old story.[/!] குறிப்பு that we can now move மேலே பெறுநர் 6 cells in one dance step.

source: Turn back and move one step forward
ta: Turn பின் and move one படி forward

source: Move four cells forward
ta: Move நான்கு, நாலடி, நான்கடி cells forward

source: Move four cells backward
ta: Move நான்கு, நாலடி, நான்கடி cells பின்னோக்கு

source: Move five cells backward
ta: Move five cells பின்னோக்கு

source: Move six cells backward
ta: Move six cells பின்னோக்கு

source: When you program works again, proceed to next exercise.
ta: When you திட்டம் works again, proceed பெறுநர் அடுத்தது exercise.
