Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: This is a mix between both the Split and Interleaved problems, and the linear problem. We are given two stacks of disks, on three pegs. We are expected to swap the stacks' position while respecting the classical Hanoi movement restrictions (one disk at a time, and no large disk over smaller disks) and the linear movement restriction (no direct exchange between the left-most and right-most pegs).
ta: This is a mix between both the Split and Interleaved problems, and the நேரியல் problem. We அரே given two stacks of disks, on three pegs. We அரே expected பெறுநர் swap the stacks' position while respecting the classical Hanoi movement restrictions (one disk at a time, and இல்லை large disk வீச்சலகு smaller disks) and the நேரியல் movement restriction (no direct exchange between the left-most and right-most pegs).

source: <b>moveDouble(k,from, to)</b>: moves an interleaved stack of k pairs of disks, without changing the relative positions of disks of the same size. As in the Split Hanoi problem, an interleaved stack alternates white and black disks of each sizes. This function is not completely new: you wrote a version with 4 pegs (but using only 3 of them) for the first version of the Split Hanoi problem.
ta: <b>moveDouble(k,from, to)</b>: moves an interleaved stack of k pairs of disks, without changing the relative positions of disks of the same size. அச் in the Split Hanoi problem, an interleaved stack alternates வெள்ளை and கருப்பு disks of each sizes. This சார்பு is not completely new: you wrote a version with 4 pegs (but using only 3 of them) க்கு the first version of the Split Hanoi problem.

source: <b>gather(k)</b>: from the initial split situation, build on peg #2 an interleaved stack of k pairs of disks. You may parametrize your function so that it can be used to gather the disk on any peg passed as parameter, but in practice, your function will only be used to gather on the last peg.
ta: <b>gather(k)</b>: இருந்து the initial split situation, உருவாக்கு on peg #2 an interleaved stack of k pairs of disks. You சி-வைகாசி parametrize your சார்பு so that it can be used பெறுநர் gather the disk on any peg passed அச் parameter, but in practice, your சார்பு will only be used பெறுநர் gather on the last peg.

source: <b>scatter(k)</b>: from a situation where k pairs of disks are interleaved on peg #0, split it down by moving the white disks to peg #1 and black ones to peg #2.
ta: <b>scatter(k)</b>: இருந்து a situation where k pairs of disks அரே interleaved on peg #0, split it down by moving the வெள்ளை disks பெறுநர் peg #1 and கருப்பு ones பெறுநர் peg #2.

source: In <code>gather()</code>, the recursive call comes before two calls to <code>moveDouble()</code> while in <code>scatter()</code>, the calls to <code>moveDouble()</code> come before the recursive call. The main function that you should write is not recursive, but simply gather almost all disks, moves directly the remaining disks, and then scatters back the small disks.
ta: In <code>gather()</code>, the recursive call comes before two calls பெறுநர் <code>moveDouble()</code> while in <code>scatter()</code>, the calls பெறுநர் <code>moveDouble()</code> come before the recursive call. The main சார்பு that you should write is not recursive, but simply gather almost அனைத்தும் disks, moves directly the remaining disks, and then scatters பின் the small disks.

source: The linearity naturally induces some extra complexity as you have to decompose every move between pegs 0 and 2. I am still confident in your ability to overcome the challenge :)
ta: The linearity naturally induces some extra complexity அச் you have பெறுநர் decompose every move between pegs 0 and 2. I am still confident in your திறமை பெறுநர் overcome the challenge :)

source: Note that the requested algorithm was proved optimal for that problem, so you don't need to fiddle the performance this time.
ta: குறிப்பு that the requested படிமுறை was proved optimal க்கு that problem, so you don't need பெறுநர் fiddle the performance this time.

source: In this set of exercises, we will devise an algorithm for the Tricolor Hanoi problem. There will be 3 stacks on 3 pegs, each stack of a differing color, and the problem is to exchange the stacks' positions under the classical move rules (one disk at a time, and no bigger disk over smaller disk).
ta: In this கணம் of exercises, we will devise an படிமுறை க்கு the Tricolor Hanoi problem. There will be 3 stacks on 3 pegs, each stack of a differing color, and the problem is பெறுநர் exchange the stacks' positions under the classical move rules (one disk at a time, and இல்லை bigger disk வீச்சலகு smaller disk).

source: As in previous exercises, our solution will use three functions:
ta: அச் in previous exercises, our நீர்மக்கூழ் will use three functions:

source: <code>move3(n, src, mid, dst)</code>: moves a stack of interleaved disks, ie a stack of (n*3) disks of alternating colors from peg <code>src</code> to peg <code>dst</code>.
ta: <code>move3(n, src, mid, dst)</code>: moves a stack of interleaved disks, ie a stack of (n*3) disks of alternating colors இருந்து peg <code>src</code> பெறுநர் peg <code>dst</code>.

source: <code>gather()</code>: builds an interleaved stack from the regular split ones.
ta: <code>gather()</code>: builds an interleaved stack இருந்து the regular split ones.

source: The goal of this first exercise in the series is to devise the <code>move3()</code> function. This starter task should not block you for too long, actually. It is ok if your function changes the order of the bottom triplet of disks, but it must preserve the order of the other triplets.
ta: The goal of this first exercise in the series is பெறுநர் devise the <code>move3()</code> function. This starter task should not block you க்கு too long, actually. It is சரி if your சார்பு changes the order of the கீழே triplet of disks, but it must preserve the order of the மற்றொன்று triplets.

source: It is now time to write the second function required by the Tricolor Hanoi problem. <code>gather()</code> builds an interleaved stack from the regular split ones. This function takes four arguments, the last one being the target peg where the interleaved stack must be assembled. As you can see in the examples, the colors of must be in the same order for each triplet of disks.
ta: It is now time பெறுநர் write the second சார்பு required by the Tricolor Hanoi problem. <code>gather()</code> builds an interleaved stack இருந்து the regular split ones. This சார்பு takes நான்கு, நாலடி, நான்கடி arguments, the last one being the target peg where the interleaved stack must be assembled. அச் you can see in the examples, the colors of must be in the same order க்கு each triplet of disks.

source: That function actually uses the <code>move3()</code> that you wrote just before. Simply copy/paste your code over to reuse it. If you're lost, please refer to the Interleaved Hanoi exercise. Gathering 3 stacks on 3 pegs is rather similar to gathering 2 stacks on 4 pegs. You can find that exercise <a href="plm://lessons.recursion.hanoi/InterleavedHanoi">here</a>.
ta: That சார்பு actually uses the <code>move3()</code> that you wrote just before. Simply copy/paste your குறியீடு வீச்சலகு பெறுநர் reuse it. If you're lost, please refer பெறுநர் the Interleaved Hanoi exercise. Gathering 3 stacks on 3 pegs is rather similar பெறுநர் gathering 2 stacks on 4 pegs. You can கண்டுபிடி that exercise <a href="plm://lessons.recursion.hanoi/InterleavedHanoi">here</a>.

source: We are almost ready to write the whole tricolor algorithm. We just need the <code>scatter()</code> function, very inspired from the first one that we wrote for the <a href="plm://lessons.recursion.hanoi/SplitHanoi1">Split Hanoi problem</a>. Assuming that your interleaved stack is placed on the <code>mid</code> peg, spread the disks over all pegs. Make sure to use <code>move3()</code> an even amount of time at each recursive level to ensure that the bottom disks are in the correct order.
ta: We அரே almost ready பெறுநர் write the whole tricolor algorithm. We just need the <code>scatter()</code> function, very inspired இருந்து the first one that we wrote க்கு the <a href="plm://lessons.recursion.hanoi/SplitHanoi1">Split Hanoi problem</a>. Assuming that your interleaved stack is placed on the <code>mid</code> peg, spread the disks வீச்சலகு அனைத்தும் pegs. Make sure பெறுநர் use <code>move3()</code> an இரட்டை amount of time at each recursive நிலை பெறுநர் ensure that the கீழே disks அரே in the சரியான order.

source: As you can see, the initial situation is not the one expected by <code>scatter()</code>. You first have to apply <code>gather()</code> and <code>move3()</code> (twice to get the bottom triplet in the right order). These few steps plus the new <code>scatter()</code> function are enough to entirely solve the Tricolor Hanoi problem.
ta: அச் you can see, the initial situation is not the one expected by <code>scatter()</code>. You first have பெறுநர் இடு <code>gather()</code> and <code>move3()</code> (twice பெறுநர் get the கீழே triplet in the வலது order). These few படிகள் plus the புதிய <code>scatter()</code> சார்பு அரே enough பெறுநர் entirely solve the Tricolor Hanoi problem.

source: This variation of the Towers of Hanoi is very similar to the regular problem: you are given one stack of disks and three pegs, and you cannot move a larger disk over a smaller one. The change is that you can only move disks clockwise: 0->1 or 1->2 or 2->0, but never in the other direction.
ta: This variation of the Towers of Hanoi is very similar பெறுநர் the regular problem: you அரே given one stack of disks and three pegs, and you cannot move a larger disk வீச்சலகு a smaller one. The change is that you can only move disks clockwise: 0->1 or 1->2 or 2->0, but ஒருபோதும் in the மற்றொன்று direction.

source: Obviously, the movements are not symmetric anymore. Moves from A to B are now very different from moves to B to A. As a result, you need two recursive functions depending on whether you are moving the stack clockwise or counterclockwise.
ta: Obviously, the movements அரே not சமச்சீர் anymore. Moves இருந்து A பெறுநர் B அரே now very different இருந்து moves பெறுநர் B பெறுநர் A. அச் a result, you need two recursive செயல்பாடுகள் depending on whether you அரே moving the stack clockwise or counterclockwise.

source: That being said, the problem decomposition is very similar to the classical Hanoi. The twist is that each function call the other one, constituting a nice example of mutual recursion.
ta: That being said, the problem decomposition is very similar பெறுநர் the classical Hanoi. The twist is that each சார்பு call the மற்றொன்று one, constituting a nice example of mutual recursion.

source: In this last exercise of the series, we will implement an iterative algorithm for the base problem of the Towers of Hanoi (one stack, 3 pegs, no extra movement restriction).
ta: In this last exercise of the series, we will implement an iterative படிமுறை க்கு the காரம் problem of the Towers of Hanoi (one stack, 3 pegs, இல்லை extra movement restriction).

source: This algorithm is actually very simple: On odd moves, the smallest disk is moved in a given direction (either increasing 0-&gt;1-&gt;2-&gt;0 or decreasing 2-&lt;1-&lt;0-&lt;2) while on even moves, the only possible move that does not imply the smallest disk is made. You stop as soon as the stack is rebuilt on another location.
ta: This படிமுறை is actually very simple: On ஒற்றைப் படை moves, the smallest disk is moved in a given direction (either increasing 0-&gt;1-&gt;2-&gt;0 or decreasing 2-&lt;1-&lt;0-&lt;2) while on இரட்டை moves, the only possible move that does not imply the smallest disk is made. You நிறுத்து அச் soon அச் the stack is rebuilt on another location.

source: The function that you now need to write takes two parameters: the initial position of the smallest disk (i.e., the peg initially containing the stack) and a boolean indicating whether the smallest disk should move in the increasing order or not.
ta: The சார்பு that you now need பெறுநர் write takes two parameters: the initial position of the smallest disk (i.e., the peg initially containing the stack) and a boolean indicating whether the smallest disk should move in the increasing order or not.

source: The simplicity of this algorithm is actually almost deceiving. One could wonder on the interest of the recursive algorithms when such a simple iterative algorithm exists. My personal feeling is that this solution is nice to execute, but almost impossible to devise in the first place (I even suspect that the authors built this iterative solution from observations of the recursive execution)...
ta: The simplicity of this படிமுறை is actually almost deceiving. One could wonder on the interest of the recursive algorithms when such a simple iterative படிமுறை exists. My personal feeling is that this நீர்மக்கூழ் is nice பெறுநர் execute, but almost impossible பெறுநர் devise in the first place (I இரட்டை suspect that the ஆசிரியர்கள் built this iterative நீர்மக்கூழ் இருந்து observations of the recursive execution)...

source: Predicting the effect of this function is also difficult: When the small disk moves in the increasing order, the stack is reconstructed on the right peg with 5 disks but on the left with 6 disks.
ta: Predicting the விளைவு of this சார்பு is also difficult: When the small disk moves in the increasing order, the stack is reconstructed on the வலது peg with 5 disks but on the இடது with 6 disks.

source: An interesting question is whether such simple iterative algorithms exist for the other variation of the problem. Some were given in the literature (e.g. for the cyclic variation). I would happily integrate your solutions to the PLM, especially if you can hint (without spoiling) the solution to guide the next ones.
ta: An interesting கேள்வி is whether such simple iterative algorithms exist க்கு the மற்றொன்று variation of the problem. Some were given in the literature (e.g. க்கு the cyclic variation). I would happily integrate your solutions பெறுநர் the PLM, especially if you can hint (without spoiling) the நீர்மக்கூழ் பெறுநர் guide the அடுத்தது ones.

source: This world implements the ultra-classical Hanoi problem. You are asked to move the disk pile from the stick where they are to the target stick (given as second parameter in the world's name -- number 1 for the default world). There is some extra constraint: you can only move one disk at a time, and you cannot move a big disk over a smaller one.
ta: This world implements the ultra-classical Hanoi problem. You அரே asked பெறுநர் move the disk pile இருந்து the stick where they அரே பெறுநர் the target stick (given அச் second கூறளவு in the world's பெயர் -- எண் 1 க்கு the இயல்புநிலை world). There is some extra constraint: you can only move one disk at a time, and you cannot move a big disk வீச்சலகு a smaller one.

source: Only 4 functions are provided:
ta: Only 4 செயல்பாடுகள் அரே provided:

source: Moves one disk from the stick <code>src</code> onto the stick <code>dst</code>. If you try to do an invalid move (like laying a disk over a smaller one), an IllegalArgumentException is thrown.
ta: Moves one disk இருந்து the stick <code>src</code> onto the stick <code>dst</code>. If you try பெறுநர் do an செல்லுபடியாகாத move (like laying a disk வீச்சலகு a smaller one), an IllegalArgumentException is thrown.

source: Returns the amount of disks placed on the specified slot. This is mainly used to initialize the recursion and set the amount of recursive call to execute.
ta: Returns the amount of disks placed on the specified slot. This is mainly used பெறுநர் initialize the recursion and கணம் the amount of recursive call பெறுநர் execute.

source: Returns the radius of the top-most disk of the specified slot.
ta: Returns the ஆரம் of the top-most disk of the specified slot.

source: This lesson proposes several exercises about labyrinths in the buggle world.
ta: This பாடம் proposes several exercises பற்றி labyrinths in the buggle world.

source: The day of your buggle starts badly. Out of luck, it got trapped into a maze. Help it finding its path out of there.
ta: The நாள் of your buggle starts badly. Out of luck, it got trapped into a maze. உதவி it finding its பாதை out of there.

source: The exit is represented by a baggle and you need to pick this baggle in order to exit the maze.
ta: The exit is represented by a baggle and you need பெறுநர் pick this baggle in order பெறுநர் exit the maze.

source: Since the maze is so small, we can write the dumbest possible algorithm to do so. It relies on randomness and proves quite inefficient.
ta: Since the maze is so small, we can write the dumbest possible படிமுறை பெறுநர் do so. It relies on randomness and proves quite inefficient.

source: While the buggle didn't find the path to the escape, it must proceed the following way: pick a random integer between 0 and 2 by using the provided <code>random3()</code> method and make one of the following actions: moving forward if possible, turn left or turn right.
ta: While the buggle didn't கண்டுபிடி the பாதை பெறுநர் the escape, it must proceed the following way: pick a சீரற்ற முழு எண் between 0 and 2 by using the provided <code>random3()</code> method and make one of the following actions: moving forward if possible, turn இடது or turn right.

source: You don't believe that it could work? Well, give it a try, you will see... Don't forget to pick up the baggle once you've reached it.
ta: You don't believe that it could work? Well, give it a try, you will see... Don't forget பெறுநர் pick மேலே the baggle once you've reached it.

source: This time, the maze is a bit more complicated. Random won't be enough, we ough to be smart!
ta: This time, the maze is a துணுக்கு more complicated. சீரற்ற won't be enough, we ough பெறுநர் be smart!

source: The good news is that this maze is simpler that it seems at the first glance: every wall are connected to each other. To get out of this kind of maze, the buggle only have to follow a wall (the one on its left or the one on its right, it doesn't matter). While keeping a paw on the wall, the buggle must move forward until it finds the maze exit and this biscuit it loves so much.
ta: The good செய்தி is that this maze is simpler that it seems at the first glance: every wall அரே connected பெறுநர் each other. பெறுநர் get out of this kind of maze, the buggle only have பெறுநர் follow a wall (the one on its இடது or the one on its right, it doesn't matter). While keeping a paw on the wall, the buggle must move forward until it finds the maze exit and this biscuit it loves so much.

source: This works here because there is no island of isolated walls, so our buggle cannot loop around for ever without encountering its baggle.
ta: This works here because there is இல்லை island of தனித்த walls, so our buggle cannot loop around க்கு ever without encountering its baggle.

source: The goal of this exercise is to write an algorithm allowing the buggle to get out of this maze.
ta: The goal of this exercise is பெறுநர் write an படிமுறை allowing the buggle பெறுநர் get out of this maze.

source: As said earlier, it does not matter whether you decide to follow the left wall or the right one. Simply, the demo follows the left one, so you should do the same in your solution to ease the comparison of your solution and the demo.
ta: அச் said earlier, it does not பொருண்மை, பருப்பொருள் whether you decide பெறுநர் follow the இடது wall or the வலது one. Simply, the demo follows the இடது one, so you should do the same in your நீர்மக்கூழ் பெறுநர் ease the comparison of your நீர்மக்கூழ் and the demo.

source: Write a method <code>keepHandOnSideWall()</code> which lets the buggle move one step forward while keeping the paw on the wall of the selected side. You must ensure that the buggle always keep the paw on the wall, but also that it won't crash into a wall. You can check the tip for more info on this, but only do so if you're stuck. Try to do it without the tip first.
ta: Write a method <code>keepHandOnSideWall()</code> which lets the buggle move one படி forward while keeping the paw on the wall of the தேர்ந்தெடுக்கப்பட்டது side. You must ensure that the buggle எப்போதும் keep the paw on the wall, but also that it won't crash into a wall. You can சரிபார் the tip க்கு more செய்தி on this, but only do so if you're stuck. Try பெறுநர் do it without the tip first.

source: Then, write the whole algorithm to traverse the maze step by step (using <code>keepHandOnSideWall()</code>) until it finds the biscuit and the exit. Don't forget to pick the baggle up once you've found it.
ta: Then, write the whole படிமுறை பெறுநர் traverse the maze படி by படி (using <code>keepHandOnSideWall()</code>) until it finds the biscuit and the exit. Don't forget பெறுநர் pick the baggle மேலே once you've found it.

source: When your buggle has a wall on the left, there is three situations to consider, depending on the surrounding walls. The following table depicts each initial situation, and where you should let your buggle end after one step.
ta: When your buggle has a wall on the left, there is three situations பெறுநர் consider, depending on the surrounding walls. The following table depicts each initial situation, and where you should let your buggle end after one step.

source: Where is the next step
ta: Where is the அடுத்தது படி

source: If you do a <code>right()</code> in any case at the end of your function, it's possible to write it in 3 lines with a <code>while</code> loop.
ta: If you do a <code>right()</code> in any case at the end of your function, it's possible பெறுநர் write it in 3 வரிகள் with a <code>while</code> loop.

source: Pledge algorithm
ta: Pledge படிமுறை

source: Once again, you thought that your algorithm were good enough to escape the maze, and once again, you buggle is now in a maze where your previous algorithm fails. Just give it a try: copy/paste your code and hit the "Run" button and see your creation fail. The trap is shaped like an upper case "G". The buggle enters the trap and follows the inner border. At some point, it finds the north direction free, run into that direction, and falls again in the trap.
ta: Once again, you thought that your படிமுறை were good enough பெறுநர் escape the maze, and once again, you buggle is now in a maze where your previous படிமுறை fails. Just give it a try: copy/paste your குறியீடு and hit the "Run" button and see your creation fail. The trap is shaped like an upper case "G". The buggle enters the trap and follows the inner border. At some point, it finds the வடக்கு direction free, ஓடு into that direction, and falls again in the trap.

source: The Pledge's algorithm (named after Jon Pledge of Exeter) can solve this maze.
ta: The Pledge's படிமுறை (named after Jon Pledge of Exeter) can solve this maze.

source: This algorithm is a modification of the previous one thought to avoid obstacles. It randomly picks a heading and let the buggle move in that direction. When it encounters an obstacle, a paw (for example the left one) is kept on the wall following the obstacle while counting the turns. When the buggle is back to its original heading and when the sum of the turns is 0, the buggle leaves the obstacle and continues keeping its original heading.
ta: This படிமுறை is a modification of the previous one thought பெறுநர் avoid obstacles. It randomly picks a heading and let the buggle move in that direction. When it encounters an obstacle, a paw (for example the இடது one) is kept on the wall following the obstacle while counting the turns. When the buggle is பின் பெறுநர் its original heading and when the sum of the turns is 0, the buggle leaves the obstacle and continues keeping its original heading.
