Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Count Teen
ta: எண்ணுங்கள் Teen

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 4 int values, return the amount of teen ones.
ta: We'll say that a எண் is "teen" if it is in the வீச்சு 13..19 inclusive. Given 4 int values, return the amount of teen ones.

source: Given an int n, return the absolute difference between n and 21, except return double the absolute difference if n is over 21.
ta: Given an int n, return the தனி, சார்பிலா வேறுபாடு between n and 21, except return இரட்டை the தனி, சார்பிலா வேறுபாடு if n is வீச்சலகு 21.

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 3 int values, return true if 1 or more of them are teen.
ta: We'll say that a எண் is "teen" if it is in the வீச்சு 13..19 inclusive. Given 3 int values, return true if 1 or more of them அரே teen.

source: Given two temperatures, return true if one is less than 0 and the other is greater than 100.
ta: Given two temperatures, return true if one is less than 0 and the மற்றொன்று is greater than 100.

source: Given 2 int values, return true if either of them is in the range 10..20 inclusive.
ta: Given 2 int values, return true if either of them is in the வீச்சு 10..20 inclusive.

source: Given 2 int values, return true if they are both in the range 30..40 inclusive, or they are both in the range 40..50 inclusive.
ta: Given 2 int values, return true if they அரே both in the வீச்சு 30..40 inclusive, or they அரே both in the வீச்சு 40..50 inclusive.

source: Given two non-negative int values, return true if they have the same last digit, such as with 27 and 57. Note that the % "mod" operator computes remainders, so 17 % 10 is 7.
ta: Given two non-negative int values, return true if they have the same last digit, such அச் with 27 and 57. குறிப்பு that the % "mod" operator computes remainders, so 17 % 10 is 7.

source: This exercise was converted to PLM from the excellent exercising site http://javabat.com/
ta: This exercise was converted பெறுநர் PLM இருந்து the excellent exercising site http://javabat.com/

source: We'll say that a number is "teen" if it is in the range 13..19 inclusive. Given 2 int values, return true if one or the other is teen, but not both.
ta: We'll say that a எண் is "teen" if it is in the வீச்சு 13..19 inclusive. Given 2 int values, return true if one or the மற்றொன்று is teen, but not both.

source: Boolean operations are one of the very basic task in programming. As long as you cannot write a not so simple boolean test under the minute, you probably will have a very bad time writing a real program.
ta: Boolean operations அரே one of the very அடிப்படை task in programming. அச் long அச் you cannot write a not so simple boolean தேர்வு under the minute, you probably will have a very bad time writing a real program.

source: That is why this lesson provides you a bunch of such exercises, so that you can get trained in this.
ta: That is why this பாடம் provides you a bunch of such exercises, so that you can get trained in this.

source: Given 2 positive int values, return the larger value that is in the range 10..20 inclusive, or return 0 if neither is in that range.
ta: Given 2 நேரமம் int values, return the larger மதிப்பு that is in the வீச்சு 10..20 inclusive, or return 0 if neither is in that range.

source: Note that Math.max(Int,Int):Int and Math.min(Int,Int):Int return the maximum and minimum of two integers
ta: குறிப்பு that Math.max(Int,Int):Int and Math.min(Int,Int):Int return the பெருமம் and சிறுமம் of two integers

source: We have two monkeys, a and b, and the parameters aSmile and bSmile indicate if each is smiling. We are in trouble if they are both smiling or if neither of them is smiling. Return true if we are in trouble.
ta: We have two monkeys, a and b, and the parameters aSmile and bSmile indicate if each is smiling. We அரே in trouble if they அரே both smiling or if neither of them is smiling. Return true if we அரே in trouble.

source: Given an int n, return true if it is within 10 of 100 or 200. [!java|scala]Note that Math.abs(n) returns the absolute value of a number.[/!] [!python]Note that math.fabs(n) returns the absolute value of a number. This function can only be used if you imported the math module.[/!]
ta: Given an int n, return true if it is within 10 of 100 or 200. [!java|scala]Note that Math.abs(n) returns the தனி, சார்பிலா மதிப்பு of a number.[/!] [!python]Note that math.fabs(n) returns the தனி, சார்பிலா மதிப்பு of a number. This சார்பு can only be used if you imported the math module.[/!]

source: We have a loud talking parrot. The "hour" parameter is the current hour time in the range 0..23. We are in trouble if the parrot is talking and the hour is before 7 or after 20. Return true if we are in trouble.
ta: We have a loud talking parrot. The "hour" கூறளவு is the மின்னோட்ட்ம், ஓட்டம் hour time in the வீச்சு 0..23. We அரே in trouble if the parrot is talking and the hour is before 7 or after 20. Return true if we அரே in trouble.

source: Positive Negative
ta: நேரமம் எதிர்மம்

source: Given 2 int values, return true if one is negative and one is positive. Unless negative is true, then they both must be negative.
ta: Given 2 int values, return true if one is எதிர்மம் and one is positive. Unless எதிர்மம் is true, then they both must be negative.

source: The parameter weekday is true if it is a weekday, and the parameter vacation is true if we are on vacation. We sleep in if it is not a weekday or we're on vacation. Return true if we sleep in.
ta: The கூறளவு weekday is true if it is a weekday, and the கூறளவு vacation is true if we அரே on vacation. We sleep in if it is not a weekday or we're on vacation. Return true if we sleep in.

source: Sum Double
ta: Sum இரட்டை

source: Given two int values, return their sum. Unless the two values are the same, then return double their sum.
ta: Given two int values, return their sum. Unless the two values அரே the same, then return இரட்டை their sum.

source: Given a day of the week encoded as 0=Sun, 1=Mon, 2=Tue, ...6=Sat, and a boolean indicating if we are on vacation, return a string of the form "7:00" indicating when the alarm clock should ring. Weekdays, the alarm should be "7:00" and on the weekend it should be "10:00". Unless we are on vacation -- then on weekdays it should be "10:00" and weekends it should be "off".
ta: Given a நாள் of the week encoded அச் 0=Sun, 1=Mon, 2=Tue, ...6=Sat, and a boolean indicating if we அரே on vacation, return a சரம் of the form "7:00" indicating when the alarm கடிகை should ring. Weekdays, the alarm should be "7:00" and on the weekend it should be "10:00". Unless we அரே on vacation -- then on weekdays it should be "10:00" and weekends it should be "off".

source: Your cell phone rings. Return true if you should answer it. Normally you answer, except in the morning you only answer if it is your mom calling. In all cases, if you are asleep, you do not answer.
ta: Your கலன் phone rings. Return true if you should பதில் it. Normally you answer, except in the morning you only பதில் if it is your mom calling. In அனைத்தும் cases, if you அரே asleep, you do not answer.

source: You have a blue lottery ticket, with ints a, b, and c on it. This makes three pairs, which we'll call ab, bc, and ac. Consider the sum of the numbers in each pair. If any pair sums to exactly 10, the result is 10. Otherwise if the ab sum is exactly 10 more than either bc or ac sums, the result is 5. Otherwise the result is 0.
ta: You have a நீலம் lottery ticket, with ints a, b, and c on it. This makes three pairs, which we'll call ab, bc, and ac. Consider the sum of the numbers in each pair. If any பேரிக்காய் sums பெறுநர் exactly 10, the result is 10. Otherwise if the ab sum is exactly 10 more than either bc or ac sums, the result is 5. Otherwise the result is 0.

source: You are driving a little too fast, and a police officer stops you. Write code to compute the result, encoded as an int value: 0=no ticket, 1=small ticket, 2=big ticket. If speed is 60 or less, the result is 0. If speed is between 61 and 80 inclusive, the result is 1. If speed is 81 or more, the result is 2. Unless it is your birthday -- on that day, your speed can be 5 higher in all cases.
ta: You அரே driving a little too fast, and a police officer stops you. Write குறியீடு பெறுநர் compute the result, encoded அச் an int value: 0=no ticket, 1=small ticket, 2=big ticket. If விரைவு is 60 or less, the result is 0. If விரைவு is between 61 and 80 inclusive, the result is 1. If விரைவு is 81 or more, the result is 2. Unless it is your birthday -- on that day, your விரைவு can be 5 higher in அனைத்தும் cases.

source: When squirrels get together for a party, they like to have cigars. A squirrel party is successful when the number of cigars is between 40 and 60, inclusive. Unless it is the weekend, in which case there is no upper bound on the number of cigars. Return true if the party was successful.
ta: When squirrels get together க்கு a party, they like பெறுநர் have cigars. A அணில் party is successful when the எண் of cigars is between 40 and 60, inclusive. Unless it is the weekend, in which case there is இல்லை upper bound on the எண் of cigars. Return true if the party was successful.

source: You and your date are trying to get a table at a restaurant. The parameter "you" is the stylishness of your clothes, in the range 0..10, and "date" is the stylishness of your date's clothes. The result getting the table is encoded as an int value with 0=no, 1=maybe, 2=yes. If either of you is very stylish, 8 or more, then the result is 2 (yes). With the exception that if either of you has style of 2 or less, then the result is 0 (no). Otherwise the result is 1 (maybe).
ta: You and your திகதி அரே trying பெறுநர் get a table at a restaurant. The கூறளவு "you" is the stylishness of your clothes, in the வீச்சு 0..10, and "date" is the stylishness of your date's clothes. The result getting the table is encoded அச் an int மதிப்பு with 0=no, 1=maybe, 2=yes. If either of you is very stylish, 8 or more, then the result is 2 (yes). With the exception that if either of you has சூல் தண்டு of 2 or less, then the result is 0 (no). Otherwise the result is 1 (maybe).

source: According to Wikipedia, Fizz buzz is a group word game for children to teach them about division. Players take turns to count incrementally, replacing any number divisible by three with the word "Fizz", and any number divisible by five with the word "Buzz". Any number that is divisible by both three and five is replaced with the string "Fizz Buzz".
ta: According பெறுநர் Wikipedia, Fizz buzz is a குழு சொல் game க்கு children பெறுநர் teach them பற்றி division. Players take turns பெறுநர் எண்ணுங்கள் incrementally, replacing any எண் divisible by three with the சொல் "Fizz", and any எண் divisible by five with the சொல் "Buzz". Any எண் that is divisible by both three and five is replaced with the சரம் "Fizz Buzz".

source: Unchanged numbers are simply returned as a string. [!java|scala]The easiest for that is to use that [!thelang] idiomatic: <code>""+a</code>[/!] [!python]The function <code>str(a)</code> changes an integer <code>a</code> into a string.[/!]
ta: Unchanged numbers அரே simply returned அச் a string. [!java|scala]The easiest க்கு that is பெறுநர் use that [!thelang] idiomatic: <code>""+a</code>[/!] [!python]The சார்பு <code>str(a)</code> changes an முழு எண் <code>a</code> into a string.[/!]

source: You have a green lottery ticket, with ints a, b, and c on it. If the numbers are all different from each other, the result is 0. If all of the numbers are the same, the result is 20. If two of the numbers are the same, the result is 10.
ta: You have a பச்சை lottery ticket, with ints a, b, and c on it. If the numbers அரே அனைத்தும் different இருந்து each other, the result is 0. If அனைத்தும் of the numbers அரே the same, the result is 20. If two of the numbers அரே the same, the result is 10.

source: Given a number n, return true if n is in the range 1..10, inclusive. Unless "outsideMode" is true, in which case return true if the number is less or equal to 1, or greater or equal to 10.
ta: Given a எண் n, return true if n is in the வீச்சு 1..10, inclusive. Unless "outsideMode" is true, in which case return true if the எண் is less or equal பெறுநர் 1, or greater or equal பெறுநர் 10.

source: Given three ints, a b c, return true if they are in strict increasing order, such as 2 5 11, or 5 6 7, but not 6 5 7 or 5 5 7. However, with the exception that if "equalOk" is true, equality is allowed, such as 5 5 7 or 5 5 5.
ta: Given three ints, a b c, return true if they அரே in strict increasing order, such அச் 2 5 11, or 5 6 7, but not 6 5 7 or 5 5 7. However, with the exception that if "equalOk" is true, equality is allowed, such அச் 5 5 7 or 5 5 5.

source: Given three ints, a b c, return true if b is greater than a, and c is greater than b. However, with the exception that if "bOk" is true, b does not need to be greater than a.
ta: Given three ints, a b c, return true if b is greater than a, and c is greater than b. However, with the exception that if "bOk" is true, b does not need பெறுநர் be greater than a.

source: Given three ints, a b c, return true if two or more of them have the same rightmost digit. The ints are non-negative. Note: the % "mod" operator computes the remainder, e.g. 17 % 10 is 7.
ta: Given three ints, a b c, return true if two or more of them have the same rightmost digit. The ints அரே non-negative. குறிப்பு: the % "mod" operator computes the remainder, e.g. 17 % 10 is 7.

source: A very good introduction to this type is available here: http://codingbat.com/doc/java-if-boolean-logic.html
ta: A very good அறிமுகம் பெறுநர் this வகை is available here: http://codingbat.com/doc/java-if-boolean-logic.html

source: Given two int values, return whichever value is larger. However if the two values have the same remainder when divided by 5, then the return the smaller value. However, in all cases, if the two values are the same, return 0. Note: the % "mod" operator computes the remainder, e.g. 7 % 5 is 2.
ta: Given two int values, return whichever மதிப்பு is larger. However if the two values have the same remainder when divided by 5, then the return the smaller value. However, in அனைத்தும் cases, if the two values அரே the same, return 0. குறிப்பு: the % "mod" operator computes the remainder, e.g. 7 % 5 is 2.

source: Given a non-negative number "num", return true if num is within 2 of a multiple of 10. Note: (a % b) is the remainder of dividing a by b, so (7 % 5) is 2.
ta: Given a non-negative எண் "num", return true if num is within 2 of a multiple of 10. குறிப்பு: (a % b) is the remainder of dividing a by b, so (7 % 5) is 2.

source: You have a red lottery ticket showing ints a, b, and c, each of which is 0, 1, or 2. If they are all the value 2, the result is 10. Otherwise if they are all the same, the result is 5. Otherwise so long as both b and c are different from a, the result is 1. Otherwise the result is 0.
ta: You have a சிவப்பு lottery ticket showing ints a, b, and c, each of which is 0, 1, or 2. If they அரே அனைத்தும் the மதிப்பு 2, the result is 10. Otherwise if they அரே அனைத்தும் the same, the result is 5. Otherwise so long அச் both b and c அரே different இருந்து a, the result is 1. Otherwise the result is 0.

source: Given two ints, each in the range 10..99, return true if there is a digit that appears in both numbers, such as the 2 in 12 and 23. (Note: division, e.g. n/10, gives the left digit while the % "mod" n%10 gives the right digit.)
ta: Given two ints, each in the வீச்சு 10..99, return true if there is a digit that appears in both numbers, such அச் the 2 in 12 and 23. (Note: division, e.g. n/10, gives the இடது digit while the % "mod" n%10 gives the வலது digit.)

source: Given 2 ints, a and b, return their sum. However, sums in the range 10..19 inclusive, are forbidden, so in that case just return 20.
ta: Given 2 ints, a and b, return their sum. However, sums in the வீச்சு 10..19 inclusive, அரே forbidden, so in that case just return 20.

source: The squirrels in Palo Alto spend most of the day playing. In particular, they play if the temperature is between 60 and 90 (inclusive). Unless it is summer, then the upper limit is 100 instead of 90. Given an int temperature and a boolean isSummer, return true if the squirrels play and false otherwise.
ta: The squirrels in Palo Alto spend பெரும்பாலானவை of the நாள் playing. In particular, they play if the temperature is between 60 and 90 (inclusive). Unless it is summer, then the upper limit is 100 instead of 90. Given an int temperature and a boolean isSummer, return true if the squirrels play and false otherwise.

source: We are having a party with amounts of tea and candy. Return the int outcome of the party encoded as 0=bad, 1=good, or 2=great. A party is good (1) if both tea and candy are at least 5. However, if either tea or candy is at least double the amount of the other one, the party is great (2). However, in all cases, if either tea or candy is less than 5, the party is always bad (0).
ta: We அரே having a party with amounts of tea and candy. Return the int outcome of the party encoded அச் 0=bad, 1=good, or 2=great. A party is good (1) if both tea and candy அரே at least 5. However, if either tea or candy is at least இரட்டை the amount of the மற்றொன்று one, the party is great (2). However, in அனைத்தும் cases, if either tea or candy is less than 5, the party is எப்போதும் bad (0).

source: Given 2 ints, a and b, return their sum. However, "teen" values in the range 13..19 inclusive, are extra lucky. So if either value is a teen, just return 19.
ta: Given 2 ints, a and b, return their sum. However, "teen" values in the வீச்சு 13..19 inclusive, அரே extra lucky. So if either மதிப்பு is a teen, just return 19.

source: Given three ints, a b c, return true if it is possible to add two of the ints to get the third.
ta: Given three ints, a b c, return true if it is possible பெறுநர் கூட்டு two of the ints பெறுநர் get the third.

source: Return the sum of two 6-sided dice rolls, each in the range 1..6. However, if noDoubles is true, if the two dice show the same value, increment one die to the next value, wrapping around to 1 if its value was 6.
ta: Return the sum of two 6-sided dice rolls, each in the வீச்சு 1..6. However, if noDoubles is true, if the two dice காட்டு the same value, increment one பகடை பெறுநர் the அடுத்தது value, wrapping around பெறுநர் 1 if its மதிப்பு was 6.

source: String fun
ta: சரம் fun

source: Strings are the simplest of the complex data types :) They provide several operations, such as getting the length of the string, or a substring of it.
ta: சரங்கள் அரே the simplest of the அணைவு தகவல்கள் வகைகள் :) They provide several operations, such அச் getting the length of the string, or a substring of it.

source: A very good introduction to this type is available here: http://codingbat.com/doc/java-string-introduction.html
ta: A very good அறிமுகம் பெறுநர் this வகை is available here: http://codingbat.com/doc/java-string-introduction.html

source: Small exercises about strings
ta: Small exercises பற்றி சரங்கள்

source: These are some training exercises around strings. But unfortunately, its integration within PLM is still ongoing.
ta: These அரே some training exercises around strings. But unfortunately, its ஒருங்கிணைப்பு within PLM is still ongoing.

source: Given a string, return a string made of the chars at indexes 0,1, 4,5, 8,9 ... so "kittens" yields "kien".
ta: Given a string, return a சரம் made of the chars at குறியீடுகள் 0,1, 4,5, 8,9 ... so "kittens" yields "kien".

source: Given a string and a non-negative int n, we'll say that the front of the string is the first 3 chars, or whatever is there if the string is less than length 3. Return n copies of the front;
ta: Given a சரம் and a non-negative int n, we'll say that the front of the சரம் is the first 3 chars, or whatever is there if the சரம் is less than length 3. Return n நகல்கள் of the front;

source: Given a string, return the amount of times that the two last letters appear as a substring of the string. So "hixxxhi" yields 1 (we won't count the end substring) while "aaaNaa" yields 2 (substrings may overlap).
ta: Given a string, return the amount of பெருக்கல் that the two last letters appear அச் a substring of the string. So "hixxxhi" yields 1 (we won't எண்ணுங்கள் the end substring) while "aaaNaa" yields 2 (substrings சி-வைகாசி overlap).

source: Given a string, return a new string made of every other char starting with the first, so "Hello" yields "Hlo".
ta: Given a string, return a புதிய சரம் made of every மற்றொன்று char starting with the first, so "Hello" yields "Hlo".

source: Given 2 strings, a and b, return the number of the positions where they contain the same length 2 substring. So "xxcaazz" and "xxbaaz" yields 3, since the "xx", "aa", and "az" substrings appear in the same place in both strings.
ta: Given 2 strings, a and b, return the எண் of the positions where they contain the same length 2 substring. So "xxcaazz" and "xxbaaz" yields 3, since the "xx", "aa", and "az" substrings appear in the same place in both strings.

source: Given a non-empty string like "Code" return a string like "CCoCodCode".
ta: Given a non-empty சரம் like "Code" return a சரம் like "CCoCodCode".

source: Given a string and a non-negative int n, return a larger string that is n copies of the original string.
ta: Given a சரம் and a non-negative int n, return a larger சரம் that is n நகல்கள் of the original string.

source: Given a string, return a version where all the "x" have been removed. Except an "x" at the very start or end should not be removed.
ta: Given a string, return a version where அனைத்தும் the "ஃச்" have been removed. Except an "ஃச்" at the very தொடங்கு or end should not be removed.

source: Suppose the string "yak" is unlucky. Given a string, return a version where all the "yak" are removed, but the "a" can be any char. The "yak" strings will not overlap.
ta: Suppose the சரம் "yak" is unlucky. Given a string, return a version where அனைத்தும் the "yak" அரே removed, but the "a" can be any char. The "yak" சரங்கள் will not overlap.

source: In this lesson you pilot a lunar landing module in increasingly complex situations.
ta: In this பாடம் you pilot a lunar தரையிறக்கம் தொகுதி in increasingly அணைவு situations.

source: At each step of the simulation, the player issues a command controlling how much the angle and thrust of the lander should change
ta: At each படி of the simulation, the player issues a கட்டளை controlling how much the angle and thrust of the lander should change

source: A lander in vertical position above flat ground, the player can only control thrust (done)
ta: A lander in vertical position above கிடைவளைவு ground, the player can only control thrust (done)

source: A lander in vertical position not above flat ground, the player control thrust and angle (done)
ta: A lander in vertical position not above கிடைவளைவு ground, the player control thrust and angle (done)

source: A lander with difficult angle and speed not above flat ground, the player control thrust and angle
ta: A lander with difficult angle and விரைவு not above கிடைவளைவு ground, the player control thrust and angle

source: A lander with difficult angle and speed not above flat ground, with difficult ground, the player control thrust and angle
ta: A lander with difficult angle and விரைவு not above கிடைவளைவு ground, with difficult ground, the player control thrust and angle

source: This lesson assumes some basic programming and physics skills.
ta: This பாடம் assumes some அடிப்படை programming and physics skills.
