Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Some ants fill solid sectors, such as RRLLLRLLLRRR (16,000 steps), RRLLLRLLLRRR (30,000 steps), RRLLLRRRRRLR (125,000 steps) or RRLRLLRRRRRR (20,000 steps). Some even fill the whole space (RRLRR after 3000 steps). Some of my personal favorite ones are the ones where the ant seem to be bouncing within a box that gets bigger on each bump, such as LRRRRRLLR (30,000 steps). LRRRRLLLRRR is even more impressing since the bounces within the box are regular and since it converges more rapidly to its stable behavior (15,000 steps are enough).
ta: Some ants fill solid sectors, such அச் RRLLLRLLLRRR (16,000 steps), RRLLLRLLLRRR (30,000 steps), RRLLLRRRRRLR (125,000 steps) or RRLRLLRRRRRR (20,000 steps). Some இரட்டை fill the whole இடைவெளி (RRLRR after 3000 steps). Some of my personal favorite ones அரே the ones where the ant seem பெறுநர் be bouncing within a box that gets bigger on each bump, such அச் LRRRRRLLR (30,000 steps). LRRRRLLLRRR is இரட்டை more impressing since the bounces within the box அரே regular and since it converges more rapidly பெறுநர் its stable behavior (15,000 படிகள் அரே enough).

source: Finally, some ants are just build artistic patterns. You should check this video for some beautiful ones: http://www.youtube.com/watch?v=1X-gtr4pEBU. If you want to convert them into your code, you have to shift them by one: For example, the one depicted at 3:42 is not RRLRLRLLRL, but RLRLRLLRLR (the first visible move should be read as last one).
ta: Finally, some ants அரே just உருவாக்கு artistic patterns. You should சரிபார் this ஒளிதோற்றம் க்கு some beautiful ones: http://www.youtube.com/watch?v=1X-gtr4pEBU. If you want பெறுநர் convert them into your code, you have பெறுநர் உயர்த்து them by one: க்கு example, the one depicted at 3:42 is not RRLRLRLLRL, but RLRLRLLRLR (the first visible move should be read அச் last one).

source: As you can see by exploring the above set of turmites, they are usually not as colorful as the ants, but this may be because very few colors suffice to exhibit complex behaviors. For example, there is a specific class of turmites called <i>busy beavers</i> which are turmites that write a lot of things before stopping (busy beavers are usually classical turing machines, but the idea fits perfectly to turmites too). There is a sort of international competition where people strive to find the turmite that covers the biggest area before stopping. The web page is here: http://code.google.com/p/ruletablerepository/wiki/TwoDimensionalTuringMachines
ta: அச் you can see by exploring the above கணம் of turmites, they அரே usually not அச் colorful அச் the ants, but this சி-வைகாசி be because very few colors suffice பெறுநர் exhibit அணைவு behaviors. க்கு example, there is a specific வகுப்பு of turmites called <i>busy beavers</i> which அரே turmites that write a நிறைய of things before stopping (busy beavers அரே usually classical turing machines, but the idea fits perfectly பெறுநர் turmites too). There is a வரிசைப்படுத்து of international competition where people strive பெறுநர் கண்டுபிடி the turmite that மறையம் the biggest area before stopping. The விரலிடைத் தோல் page is here: http://code.google.com/p/ruletablerepository/wiki/TwoDimensionalTuringMachines

source: Turmite universe
ta: Turmite அண்டம்

source: This universe is very similar to the buggle one, but you will probably not use all buggles methods. So, this page only recap the buggle methods that you will use.
ta: This அண்டம் is very similar பெறுநர் the buggle one, but you will probably not use அனைத்தும் buggles methods. So, this page only recap the buggle முறைகள் that you will use.

source: This world provides tools to experiment with the sorting algorithms. It can be used in two different ways: the first one is naturally to write the required sorting algorithms. But it is also possible to simply use the demo mode of each exercise to observe the behavior of sorting algorithms. It helps understanding the differences between each of them.
ta: This world provides கருவிகள் பெறுநர் experiment with the sorting algorithms. It can be used in two different ways: the first one is naturally பெறுநர் write the required sorting algorithms. But it is also possible பெறுநர் simply use the demo பயன்முறை of each exercise பெறுநர் observe the behavior of sorting algorithms. It helps understanding the differences between each of them.

source: Methods available to sorting algorithms
ta: முறைகள் available பெறுநர் sorting algorithms

source: none
ta: எதுவுமில்லை

source: Returns true if the content of cell i is strictly smaller than the one of cell j
ta: Returns true if the content of கலன் i is strictly smaller than the one of கலன் j

source: Returns true if the content of cell i is strictly smaller than the <code>value</code>
ta: Returns true if the content of கலன் i is strictly smaller than the <code>value</code>

source: Swaps the content of cell i and the one of cell j
ta: Swaps the content of கலன் i and the one of கலன் j

source: Copy the content of cell 'from' into the cell 'to'
ta: நகலெடு the content of கலன் 'from' into the கலன் 'to'

source: Returns the value of cell idx
ta: Returns the மதிப்பு of கலன் idx

source: Sets cell 'idx' to the <code>value</code>
ta: Sets கலன் 'idx' பெறுநர் the <code>value</code>

source: Returns whether the current world is selected in the graphical interface.
ta: Returns whether the மின்னோட்ட்ம், ஓட்டம் world is தேர்ந்தெடுக்கப்பட்டது in the graphical interface.

source: As always, the indices of cells range from 0 to
ta: அச் always, the indices of cells வீச்சு இருந்து 0 பெறுநர்

source: . Accessing a cell out of this range raises an error.
ta: . Accessing a கலன் out of this வீச்சு raises an error.

source: History view
ta: வரலாறு பார்வை

source: It is not enough to sort the array to pass the exercises. Your solution must strictly follow the expected behavior of each exercise. This is enforced by checking that your algorithm needs the same amount of read and write operations to sort the array. When they don't match, understanding the difference between your code and the expected solution can reveal very difficult.
ta: It is not enough பெறுநர் வரிசைப்படுத்து the array பெறுநர் கணவாய் the exercises. Your நீர்மக்கூழ் must strictly follow the expected behavior of each exercise. This is enforced by checking that your படிமுறை needs the same amount of read and write operations பெறுநர் வரிசைப்படுத்து the array. When they don't match, understanding the வேறுபாடு between your குறியீடு and the expected நீர்மக்கூழ் can reveal very difficult.

source: To help in this process, it is possible to graphically explore the history of your sorting algorithm. Switch to the Objective view and use the contextual menu (right click) to switch from the view of the current state to the view of its history.
ta: பெறுநர் உதவி in this process, it is possible பெறுநர் graphically explore the வரலாறு of your sorting algorithm. ஆளி, நிலைமாறி பெறுநர் the Objective பார்வை and use the contextual பட்டியல் (right click) பெறுநர் ஆளி, நிலைமாறி இருந்து the பார்வை of the மின்னோட்ட்ம், ஓட்டம் state பெறுநர் the பார்வை of its history.

source: The history view is a bit hairly at the first glance, but actually rather simple: The time flows from left to right on this graph, and each row is a cell of your array. The curved lines that go navigate between rows represent a given data value. When two lines cross, this means that two values were swapped at this time stamp; A line fork represent a value copy; When a value is magenta and followed by an interrogation mark (?), it was read using getValue(); If the value is red and followed with an exclamation point (!), it was written using setValue().
ta: The வரலாறு பார்வை is a துணுக்கு hairly at the first glance, but actually rather simple: The time flows இருந்து இடது பெறுநர் வலது on this graph, and each நிரை is a கலன் of your array. The curved வரிகள் that go navigate between rows represent a given தகவல்கள் value. When two வரிகள் cross, this means that two values were swapped at this time stamp; A வரி fork represent a மதிப்பு copy; When a மதிப்பு is மெசந்தா and followed by an interrogation mark (?), it was read using getValue(); If the மதிப்பு is சிவப்பு and followed with an exclamation புள்ளியம் (!), it was written using setValue().

source: This view, inspired from Aldo Cortesi, reveals very helpful understand the inner behavior of sorting algorithms.
ta: This view, inspired இருந்து Aldo Cortesi, reveals very helpful understand the inner behavior of sorting algorithms.

source: This lesson allows to experiment with some classical sorting algorithms (and some less common variant of them). The goal is two fold: you can first better understand the idea of these algorithms by writing them yourself. But even if you don't code the algorithms, you can use the demo mode to organize "races" between these algorithms to experiment in practice what the different asymptotical complexity mean.
ta: This பாடம் allows பெறுநர் experiment with some classical sorting algorithms (and some less common variant of them). The goal is two fold: you can first better understand the idea of these algorithms by writing them yourself. But இரட்டை if you don't குறியீடு the algorithms, you can use the demo பயன்முறை பெறுநர் organize "races" between these algorithms பெறுநர் experiment in practice what the different asymptotical complexity mean.

source: More exercises are planned for the future, on recursive sorting algorithms (such as QuickSort and MergeSort) or using other microworlds to apply these algorithms to other contexts.
ta: More exercises அரே planned க்கு the future, on recursive sorting algorithms (such அச் QuickSort and MergeSort) or using மற்றொன்று microworlds பெறுநர் இடு these algorithms பெறுநர் மற்றொன்று contexts.

source: Other graphical representations could be proposed, such as the ones presented at <a href="http://sorting.at/">http://sorting.at/</a>.
ta: மற்றொன்று graphical representations could be proposed, such அச் the ones presented at <a href="http://sorting.at/">http://sorting.at/</a>.

source: This lesson allows to experiment with some classical sorting algorithms (and some less common variant of them :)
ta: This பாடம் allows பெறுநர் experiment with some classical sorting algorithms (and some less common variant of them :)

source: You are supposed to master the bases of programming to take this lesson.
ta: You அரே supposed பெறுநர் master the bases of programming பெறுநர் take this lesson.

source: Welcome to the sorting universe. It allows you to experiment with the existing sorting algorithms. The list of buildins that you can use in your algorithms is available in the world reference documentation ("Help"-&gt;"About this world").
ta: Welcome பெறுநர் the sorting universe. It allows you பெறுநர் experiment with the existing sorting algorithms. The பட்டியல் of buildins that you can use in your algorithms is available in the world குறிப்பு ஆவணப்படுத்துதல் ("Help"-&gt;"About this world").

source: It is not enough to sort the array to pass the exercises. Your solution must strictly follow the expected behavior of each exercise. This is enforced by checking that your algorithm needs the same amount of read and write operations to sort the array.
ta: It is not enough பெறுநர் வரிசைப்படுத்து the array பெறுநர் கணவாய் the exercises. Your நீர்மக்கூழ் must strictly follow the expected behavior of each exercise. This is enforced by checking that your படிமுறை needs the same amount of read and write operations பெறுநர் வரிசைப்படுத்து the array.

source: When your algorithm diverges from the expectation, understanding the difference between your code and the expected solution can reveal very difficult. To help in this process, it is posible to graphically explore the history of your sorting algorithm. Switch to the Objective view and use the contextual menu (right click) to switch from the the view of the current state to the view of its history.
ta: When your படிமுறை diverges இருந்து the expectation, understanding the வேறுபாடு between your குறியீடு and the expected நீர்மக்கூழ் can reveal very difficult. பெறுநர் உதவி in this process, it is posible பெறுநர் graphically explore the வரலாறு of your sorting algorithm. ஆளி, நிலைமாறி பெறுநர் the Objective பார்வை and use the contextual பட்டியல் (right click) பெறுநர் ஆளி, நிலைமாறி இருந்து the the பார்வை of the மின்னோட்ட்ம், ஓட்டம் state பெறுநர் the பார்வை of its history.

source: This first sorting algorithm is the most simple one: Bubble sort consists in progressively moving up the smaller elements of the array, as if they were air bubbles moving up to the surface of a liquid. The algorithm traverse the array, and compare any pair of adjacent elements. If two adjacent elements are wrongly sorted, they are swapped. Once the array was completely traversed, the operation starts again from the beginning. When no elements were sorted after a full traversal, it means that the array is completely sorted: the algorithm can stop. Bubble sort is studied because of its simplicity, but it is almost never used in practice because of its bad performance (O(n^2) on average).
ta: This first sorting படிமுறை is the பெரும்பாலானவை simple one: Bubble வரிசைப்படுத்து consists in progressively moving மேலே the smaller elements of the array, அச் if they were காற்று bubbles moving மேலே பெறுநர் the surface of a liquid. The படிமுறை traverse the array, and compare any பேரிக்காய் of adjacent elements. If two adjacent elements அரே wrongly sorted, they அரே swapped. Once the array was completely traversed, the செயல்பாடு starts again இருந்து the beginning. When இல்லை elements were sorted after a full traversal, it means that the array is completely sorted: the படிமுறை can stop. Bubble வரிசைப்படுத்து is studied because of its simplicity, but it is almost ஒருபோதும் used in practice because of its bad performance (O(n^2) on average).

source: Show Tip (Pseudo-code)
ta: காட்டு Tip (Pseudo-code)

source: The pseudo-code of the BubbleSort algorithm is the following:
ta: The pseudo-code of the BubbleSort படிமுறை is the following:

source: do: For each i in [0,len-2] If cells i and i+1 must be swapped, do it while we swapped something during last traversal
ta: do: க்கு each i in [0,len-2] If cells i and i+1 must be swapped, do it while we swapped something during last traversal

source: If you look carefully at the behavior of BubbleSort, a first easy optimization appears: after one traversal, the last element of the array must be the biggest of all since the traversal moved it up like a bubble to its position. More generally, after N traversal, we know that the N last elements of the array are already sorted. It is thus not necessary to compare them again during the subsequent traversals. For now, we will have as many traversal as there is in the array.
ta: If you look carefully at the behavior of BubbleSort, a first easy உகப்பாக்கம் appears: after one traversal, the last தனிமம் of the array must be the biggest of அனைத்தும் since the traversal moved it மேலே like a bubble பெறுநர் its position. More generally, after N traversal, we know that the N last elements of the array அரே already sorted. It is thus not necessary பெறுநர் compare them again during the subsequent traversals. க்கு now, we will have அச் many traversal அச் there is in the array.

source: The pseudo-code of the BubbleSort2 algorithm is the following:
ta: The pseudo-code of the BubbleSort2 படிமுறை is the following:

source: For all i in [len-2,0] (traversing from biggest to smallest) For all j in [0, i] If cells j and j+1 must be swapped, do it
ta: க்கு அனைத்தும் i in [len-2,0] (traversing இருந்து biggest பெறுநர் smallest) க்கு அனைத்தும் j in [0, i] If cells j and j+1 must be swapped, do it

source: When we run this algorithm, it is quite disappointing to see that it runs approximately at the same speed than the basic version of BubbleSort. This is a graphical effect only since only value changes are graphically represented. Since this variation avoids some useless comparisons, it does exactly the same amount of swaps that the basic version. It is thus quite logical that the graphical interface draws this version at the same pace than the base version. But the statistics on the amount of reads show that we saved about the fourth of the amount of reads, which is not bad.
ta: When we ஓடு this algorithm, it is quite disappointing பெறுநர் see that it runs approximately at the same விரைவு than the அடிப்படை version of BubbleSort. This is a graphical விளைவு only since only மதிப்பு changes அரே graphically represented. Since this variation avoids some useless comparisons, it does exactly the same amount of swaps that the அடிப்படை version. It is thus quite logical that the graphical இடைமுகம் draws this version at the same pace than the காரம் version. But the statistics on the amount of reads காட்டு that we saved பற்றி the fourth of the amount of reads, which is not bad.

source: From the asymptotic complexity point of view, there is absolutely no difference: this variation is still in O(n^2) on average (our gain is only on the constant term, ignored when computing the asymptotic complexity).
ta: இருந்து the asymptotic complexity புள்ளியம் of view, there is absolutely இல்லை difference: this variation is still in O(n^2) on average (our பெருக்கம் is only on the மாறா, மாறிலி term, ignored when computing the asymptotic complexity).

source: Let's now reintroduce the little optimization we removed at previous step: if a traversal does not swap any element, it means that the array is already sorted. In that case, we want to stop the whole sorting process.
ta: Let's now reintroduce the little உகப்பாக்கம் we removed at previous step: if a traversal does not swap any element, it means that the array is already sorted. In that case, we want பெறுநர் நிறுத்து the whole sorting process.

source: [!java|python|c]For that, simply use the <code>break</code> keyword, which breaks the current loop. Beware, if you have several nested loops, this will apply to the internal one.[/!] [!scala]For that, simply quit the current function by calling <code>return</code> with no associated value.[/!]
ta: [!java|python|c]For that, simply use the <code>break</code> keyword, which breaks the மின்னோட்ட்ம், ஓட்டம் loop. Beware, if you have several nested loops, this will இடு பெறுநர் the internal one.[/!] [!scala]For that, simply வெளியேறு the மின்னோட்ட்ம், ஓட்டம் சார்பு by calling <code>return</code> with இல்லை associated value.[/!]

source: For all i in [len-2,0] (traversing from biggest to smallest) For all j in [0, i] If cells j and j+1 must be swapped, do it If traversal on j did not swap anything, break the for loop
ta: க்கு அனைத்தும் i in [len-2,0] (traversing இருந்து biggest பெறுநர் smallest) க்கு அனைத்தும் j in [0, i] If cells j and j+1 must be swapped, do it If traversal on j did not swap anything, இடைவேளை the க்கு loop

source: This optimization is even more disappointing: it only provide a gain of a few percents on the amount of reads over BubbleSort2.
ta: This உகப்பாக்கம் is இரட்டை more disappointing: it only provide a பெருக்கம் of a few விழுக்காடுகள் on the amount of reads வீச்சலகு BubbleSort2.

source: To improve further the BubbleSort algorithm, we need to look closer its behavior. One can notice that big elements are moved very quickly in position while small ones move very slowly to their destination. They are thus traditionally referred to as "rabbits" and "turtles" respectively for big fast values and small slow ones.
ta: பெறுநர் improve further the BubbleSort algorithm, we need பெறுநர் look closer its behavior. One can notice that big elements அரே moved very quickly in position while small ones move very slowly பெறுநர் their destination. They அரே thus traditionally referred பெறுநர் அச் "rabbits" and "turtles" respectively க்கு big fast values and small slow ones.

source: To help the turtles moving faster, the cocktail sort traverse alternatively the array from right to left and from left to right. Here is the pseudo-code:
ta: பெறுநர் உதவி the turtles moving faster, the cocktail வரிசைப்படுத்து traverse alternatively the array இருந்து வலது பெறுநர் இடது and இருந்து இடது பெறுநர் right. Here is the pseudo-code:

source: Do For all i in [0,len-2], do: if i and i+1 must be swapped, do it For all i in [len-2,0] (downward), do: if i and i+1 must be swapped, do it while at least one of the traversal swapped an element
ta: Do க்கு அனைத்தும் i in [0,len-2], do: if i and i+1 must be swapped, do it க்கு அனைத்தும் i in [len-2,0] (downward), do: if i and i+1 must be swapped, do it while at least one of the traversal swapped an element

source: One can see that cocktail sort achieves exactly the same amount of swaps than the bubble sort, but improves slightly on read amount. It is however still worse than BubbleSort2 to that extend.
ta: One can see that cocktail வரிசைப்படுத்து achieves exactly the same amount of swaps than the bubble sort, but improves slightly on read amount. It is however still worse than BubbleSort2 பெறுநர் that extend.

source: We will now apply to CocktailSort the same optimization than BubbleSort2 did to BubbleSort. We must remember the limits of the array part not being sorted yet, and traverse it alternatively from left to right and from right to left:
ta: We will now இடு பெறுநர் CocktailSort the same உகப்பாக்கம் than BubbleSort2 did பெறுநர் BubbleSort. We must remember the limits of the array பகுதி not being sorted yet, and traverse it alternatively இருந்து இடது பெறுநர் வலது and இருந்து வலது பெறுநர் இடது:

source: beg=0; end=len-2 do For all Pour i in [beg,end], do: If cells i and i+1 must be swapped, do it end -= 1 (this means end = end - 1) For all Pour i in [beg,end] (downwards), do: If cells i and i+1 must be swapped, do it beg += 1 (this means beg = beg + 1) while at least one of the traversal swapped an element
ta: beg=0; end=len-2 do க்கு அனைத்தும் Pour i in [beg,end], do: If cells i and i+1 must be swapped, do it end -= 1 (this means end = end - 1) க்கு அனைத்தும் Pour i in [beg,end] (downwards), do: If cells i and i+1 must be swapped, do it beg += 1 (this means beg = beg + 1) while at least one of the traversal swapped an element

source: Even if the asymptotic complexity of CocktailSort2 is the same than the one of BubbleSort, it seem to perform better in practice. It is even possible to improve a bit further by stopping it if the first traversal didn't found anything to swap, without achieving the downwards traversal. Likewise, we can stop if the upward traversal found something to swap, but not the downwards one.
ta: இரட்டை if the asymptotic complexity of CocktailSort2 is the same than the one of BubbleSort, it seem பெறுநர் perform better in practice. It is இரட்டை possible பெறுநர் improve a துணுக்கு further by stopping it if the first traversal didn't found anything பெறுநர் swap, without achieving the downwards traversal. Likewise, we can நிறுத்து if the upward traversal found something பெறுநர் swap, but not the downwards one.

source: This sorting algorithm is quite simple to understand and write, even if it is not as efficient as possible. Its asymptotic complexity is in O(n²), but it is more efficient in practice (linear in best case, ie when the array is already sorted, and N2/4 on average).
ta: This sorting படிமுறை is quite simple பெறுநர் understand and write, இரட்டை if it is not அச் efficient அச் possible. Its asymptotic complexity is in O(n²), but it is more efficient in practice (linear in best case, ie when the array is already sorted, and N2/4 on average).
