Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Other languages (such as Java, Scala or C) are much more picky and prevent you to mix data types in a given variable (they are said to be <b>statically typed</b>). This seems annoying at the first glance, but this kind of restriction allows the compiler to catch more logic errors for you, which is also good. In some sense, Python is easier to write but errors can sneak in more easily.
ta: மற்றொன்று மொழிகள் (such அச் Java, Scala or C) அரே much more எடுத்துரை and prevent you பெறுநர் mix தகவல்கள் வகைகள் in a given variable (they அரே said பெறுநர் be <b>statically typed</b>). This seems annoying at the first glance, but this kind of restriction allows the தொகுப்பி பெறுநர் catch more தருக்கம், ஏரணம் errors க்கு you, which is also good. In some sense, பைதான் is easier பெறுநர் write but errors can sneak in more easily.

source: If you know that the value of your "variable" will never change (eg because it contains the screen size or some other constant value), then you should make it a <b>value</b> instead of a variable. Simply change the <code>var</code> keyword with the <code>val</code> one. The compiler can then check your actions and catch your error when you inadvertently modify the value. More interestingly, the compiler can produce faster code in some cases.
ta: If you know that the மதிப்பு of your "variable" will ஒருபோதும் change (eg because it contains the screen அளவு or some மற்றொன்று மாறா, மாறிலி value), then you should make it a <b>value</b> instead of a variable. Simply change the <code>var</code> keyword with the <code>val</code> one. The தொகுப்பி can then சரிபார் your செயல்கள் and catch your பிழை when you inadvertently modify the value. More interestingly, the தொகுப்பி can produce faster குறியீடு in some cases.

source: Variables work very similarly for strings, floating point numbers and boolean values.
ta: மாறிகள் வேலை very similarly க்கு strings, floating புள்ளியம் numbers and boolean values.

source: char* name = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> int married=1;<span class="comment">// 1 means "true"; "false" would be written 0</span>
ta: char* பெயர் = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> int married=1;<span class="comment">// 1 means "true"; "false" would be written 0</span>

source: String name = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> boolean married=true;<span class="comment">// the contrary would be written "false"</span>
ta: சரம் பெயர் = "Martin Quinson"; double height=1.77; <span class="comment">// in meters</span> boolean married=true;<span class="comment">// the contrary would be written "false"</span>

source: val name:String = "Martin Quinson"; <span class="comment">// this cannot be modified (it's a value)</span> var height: Double = 1.77; <span class="comment">// in meters</span> var married = true; <span class="comment">// the contrary would be written "false"</span> <span class="comment">// Scala knows that 'true' is a Boolean value, no need to repeat it here</span>
ta: val name:String = "Martin Quinson"; <span class="comment">// this cannot be மாற்றியமைக்கப்பட்ட (it's a value)</span> var height: இரட்டை = 1.77; <span class="comment">// in meters</span> var married = true; <span class="comment">// the contrary would be written "false"</span> <span class="comment">// Scala knows that 'true' is a Boolean value, இல்லை need பெறுநர் repeat it here</span>

source: firstName = "Martin" lastName = 'Quinson' <span class="comment"># both single and double quote work here</span> motto = "I never finish anyth' (but I keep trying)" <span class="comment"># having single quote within double quote is fine</span> height=1.77 <span class="comment"># in meters</span> married=True <span class="comment"># the contrary would be written "False"</span>
ta: firstName = "Martin" lastName = 'Quinson' <span class="comment"># both ஒற்றை and இரட்டை quote வேலை here</span> motto = "I ஒருபோதும் finish anyth' (but I keep trying)" <span class="comment"># having ஒற்றை quote within இரட்டை quote is fine</span> height=1.77 <span class="comment"># in meters</span> married=True <span class="comment"># the contrary would be written "False"</span>

source: Once your variable is declared, you can <b>affect</b> a new value to it later in the program. That's really easy:
ta: Once your variable is declared, you can <b>affect</b> a புதிய மதிப்பு பெறுநர் it later in the program. That's really easy:

source: x = 3[!java|c];[/!]
ta: ஃச் = 3[!java|c];[/!]

source: To the right of the equal symbol, you can put an arithmetic expression containing constants, variables and operations.
ta: பெறுநர் the வலது of the equal symbol, you can put an arithmetic கோவை containing constants, மாறிகள் and operations.

source: x = 3 + 2[!java|c];[/!] x = 3 * x[!java|c];[/!] [!java|scala|python]greeting = "Hello "+name[!java];[/!] <span class="comment">[!python]#[/!][!scala|java]//[/!] + is (also) the operation to concatenate (ie, to join) strings[/!]</span>
ta: ஃச் = 3 + 2[!java|c];[/!] x = 3 * x[!java|c];[/!] [!java|scala|python]greeting = "Hello "+name[!java];[/!] <span class="comment">[!python]#[/!][!scala|java]//[/!] + is (also) the செயல்பாடு பெறுநர் concatenate (ie, பெறுநர் join) strings[/!]</span>

source: It is now time to do more challenging exercises, don't you think? The objective is now to move forward until you find a baggle, pick it up, and then move back to your initial location before dropping the baggle.
ta: It is now time பெறுநர் do more challenging exercises, don't you think? The objective is now பெறுநர் move forward until you கண்டுபிடி a baggle, pick it up, and then move பின் பெறுநர் your initial location before dropping the baggle.

source: How to do this?
ta: How பெறுநர் do this?

source: To solve this problem, you have to decompose it in easier sub-parts. For example, you may want to do the following steps:
ta: பெறுநர் solve this problem, you have பெறுநர் decompose it in easier sub-parts. க்கு example, you சி-வைகாசி want பெறுநர் do the following steps:

source: Move forward until located over a baggle
ta: Move forward until located வீச்சலகு a baggle

source: Move backward of the same amount of steps than done in first step
ta: Move பின்னோக்கு of the same amount of படிகள் than முடிந்தது in first படி

source: Drop back the baggle
ta: Drop பின் the baggle

source: Naturally, it is impossible to do the right amount of steps backward at step 3 if you didn't count the amount of steps done in the first phase. You can use a variable for that, which can be named <code>stepAmount</code>.
ta: Naturally, it is impossible பெறுநர் do the வலது amount of படிகள் பின்னோக்கு at படி 3 if you didn't எண்ணுங்கள் the amount of படிகள் முடிந்தது in the first phase. You can use a variable க்கு that, which can be named <code>stepAmount</code>.

source: Create an integer variable before phase 1, initialize it to 0, and each time you move one step forward, increment its value by one (<code>stepAmount = stepAmount + 1;</code>[!java|c] or <code>stepAmount++;</code>, both syntaxes being equivalent[/!]). Such variable which takes every values of a given range is often called a <b>stepper</b>.
ta: Create an முழு எண் variable before கட்டம் 1, initialize it பெறுநர் 0, and each time you move one படி forward, increment its மதிப்பு by one (<code>stepAmount = stepAmount + 1;</code>[!java|c] or <code>stepAmount++;</code>, both syntaxes being equivalent[/!]). Such variable which takes every values of a given வீச்சு is often called a <b>stepper</b>.

source: If you know Java or other languages, you will probably try to use the <code>++</code> operator to increment the variable, but it's not allowed in [!thelang]. This is because it would be difficult to define this operator for every data types. For example, what should ++ do when applied to a Complex value or to a String? The problem does not occur in Java as <code>int</code> is not an object but a primitive type. (if you don't know the <code>++</code>, just ignore this paragraph: it does not exist in [!thelang])
ta: If you know சாவா or மற்றொன்று languages, you will probably try பெறுநர் use the <code>++</code> operator பெறுநர் increment the variable, but it's not allowed in [!thelang]. This is because it would be difficult பெறுநர் define this operator க்கு every தகவல்கள் types. க்கு example, what should ++ do when applied பெறுநர் a அணைவு மதிப்பு or பெறுநர் a String? The problem does not occur in சாவா அச் <code>int</code> is not an பொருள் but a தொடக்கநிலை type. (if you don't know the <code>++</code>, just ignore this paragraph: it does not exist in [!thelang])

source: Then, phase 3 consists in simply creating a new integer variable <code>doneSteps</code> initialized to 0, and do one step backward as long as <code>doneSteps</code> is not equal to <code>stepAmount</code>, incrementing <code>doneSteps</code> each time. The <code>!=</code> operator should be used to test the inequality (whether some values are NOT equal).
ta: Then, கட்டம் 3 consists in simply creating a புதிய முழு எண் variable <code>doneSteps</code> initialized பெறுநர் 0, and do one படி பின்னோக்கு அச் long அச் <code>doneSteps</code> is not equal பெறுநர் <code>stepAmount</code>, incrementing <code>doneSteps</code> each time. The <code>!=</code> operator should be used பெறுநர் தேர்வு the சமனிலி (whether some values அரே NOT equal).

source: Run Four bases
ta: ஓடு நான்கு, நாலடி, நான்கடி bases

source: Today is a great day for the buggles: the Big Buggles' Race begun. It's a traditional competition in which young buggles prove their value to the tribe. Both force and intelligence is exercised: you have to rush forward, but stop as soon as you reach your fourth baggle. Please help the buggles to move forward while counting the baggles and to determine when to stop.
ta: இன்று is a great நாள் க்கு the buggles: the Big Buggles' Race begun. It's a traditional competition in which young buggles prove their மதிப்பு பெறுநர் the tribe. Both force and நுண்ணறிவு is exercised: you have பெறுநர் rush forward, but நிறுத்து அச் soon அச் you reach your fourth baggle. Please உதவி the buggles பெறுநர் move forward while counting the baggles and பெறுநர் determine when பெறுநர் stop.

source: The Four Halves run
ta: The நான்கு, நாலடி, நான்கடி Halves ஓடு

source: Here is the second day of the Big Buggles' Race. As previously, you have to run forward until you reach the right cell to stop on. But this time, you have to reach the cell where the amount of baggles you saw is the double of the orange cells plus 1. In other words, the following condition must become true: <code>2 * baggles = orangeCells + 1</code>.
ta: Here is the second நாள் of the Big Buggles' Race. அச் previously, you have பெறுநர் ஓடு forward until you reach the வலது கலன் பெறுநர் நிறுத்து on. But this time, you have பெறுநர் reach the கலன் where the amount of baggles you saw is the இரட்டை of the ஆரஞ்சு cells plus 1. In மற்றொன்று words, the following condition must become true: <code>2 * baggles = orangeCells + 1</code>.

source: You can determine whether you are over a orange cell with the <code>isOverOrange()</code> method.
ta: You can determine whether you அரே வீச்சலகு a ஆரஞ்சு கலன் with the <code>isOverOrange()</code> method.

source: While loops are well adapted to situations where you want to achieve an action while a condition stays true, but it is less adapted to achieve a given action a predetermined amount of time. For example, when we wanted to move <code>stepAmount</code> steps backward in a previous exercise, we had to create a new variable, initialize it, and move backward while incrementing this variable until it became equal to <code>stepAmount</code>.
ta: While வளையங்கள் அரே well adapted பெறுநர் situations where you want பெறுநர் achieve an செயல் while a condition stays true, but it is less adapted பெறுநர் achieve a given செயல் a predetermined amount of time. க்கு example, when we wanted பெறுநர் move <code>stepAmount</code> படிகள் பின்னோக்கு in a previous exercise, we had பெறுநர் create a புதிய variable, initialize it, and move பின்னோக்கு while incrementing this variable until it became equal பெறுநர் <code>stepAmount</code>.

source: In such situations, <code>for</code> loops become handy. Their syntax is the following:
ta: In such situations, <code>for</code> வளையங்கள் become handy. Their syntax is the following:

source: [!java|c]for (<b>initializing</b>; <b>condition</b>; <b>incrementing</b>) { <b>action</b>(); }[/!][!python]for <b>variable</b> in <b>sequence of values</b>: <b>action</b>()[/!][!scala] for (<b>variable</b> &lt;- <b>firstValue</b> to <b>lastValue</b>) { <b>action</b>(); }[/!]
ta: [!java|c]for (<b>initializing</b>; <b>condition</b>; <b>incrementing</b>) { <b>action</b>(); }[/!][!python]for <b>variable</b> in <b>sequence of values</b>: <b>action</b>()[/!][!scala] க்கு (<b>variable</b> &lt;- <b>firstValue</b> பெறுநர் <b>lastValue</b>) { <b>action</b>(); }[/!]

source: For example to repeat the loop body <code>n</code> times, [!python] it is handy to use the instruction <code>range(n)</code> to generate the sequence n integer value from 0 to n-1.[/!] [!java|scala|c] one should write:[/!]
ta: க்கு example பெறுநர் repeat the loop body <code>n</code> times, [!python] it is handy பெறுநர் use the instruction <code>range(n)</code> பெறுநர் generate the வரிசை n முழு எண் மதிப்பு இருந்து 0 பெறுநர் n-1.[/!] [!java|scala|c] one should write:[/!]

source: [!java]for (int stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!c]int stepper; for (stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!python]for <b>stepper</b> in <b>range(n)</b>: <b>action</b>()[/!][!scala] for (<b>stepper</b> &lt;- <b>1</b> to <b>n</b>) { <b>action</b>(); }[/!]
ta: [!java]for (int stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!c]int stepper; for (stepper=0; stepper&lt;n; stepper++) { <b>action</b>(); }[/!][!python]for <b>stepper</b> in <b>range(n)</b>: <b>action</b>()[/!][!scala] க்கு (<b>stepper</b> &lt;- <b>1</b> பெறுநர் <b>n</b>) { <b>action</b>(); }[/!]

source: This code is then equivalent to the following one from the computer point of view. From the programmer point of view, one form or the other can make the source code easier to read, depending on the situation. You should chose wisely in each situation whether you want to use a for loop or a while loop. Your uttermost goal should remain to keep your code simple and easy to read, to ensure that your day remain pleasant and productive.
ta: This குறியீடு is then equivalent பெறுநர் the following one இருந்து the கணிப்பொறி, கணிணி புள்ளியம் of view. இருந்து the நிரலி (device), நிரலர் (person) புள்ளியம் of view, one form or the மற்றொன்று can make the மூலம் குறியீடு easier பெறுநர் read, depending on the situation. You should chose wisely in each situation whether you want பெறுநர் use a க்கு loop or a while loop. Your uttermost goal should remain பெறுநர் keep your குறியீடு simple and easy பெறுநர் read, பெறுநர் ensure that your நாள் remain pleasant and productive.

source: In that case, the <code>for</code> loop is easier to read, don't you think?
ta: In that case, the <code>for</code> loop is easier பெறுநர் read, don't you think?

source: It is possible to build more advanced <tt>for</tt> loops since any valid instruction can be used as initialization, condition and incrementing instruction. The following example is a bit extreme as there is no need for a loop body to move the buggle forward until it reaches the wall, but it works well: all the work is done in the condition and incrementing instruction.
ta: It is possible பெறுநர் உருவாக்கு more மேம்பட்ட <tt>for</tt> வளையங்கள் since any valid instruction can be used அச் initialization, condition and incrementing instruction. The following example is a துணுக்கு extreme அச் there is இல்லை need க்கு a loop body பெறுநர் move the buggle forward until it reaches the wall, but it works well: அனைத்தும் the வேலை is முடிந்தது in the condition and incrementing instruction.

source: for (; !isFacingWall() ; forward()) { <span class="comment">/* nothing in the loop body */</span> } <span class="comment">/* the buggle now faces a wall */</span>
ta: க்கு (; !isFacingWall() ; forward()) { <span class="comment">/* nothing in the loop body */</span> } <span class="comment">/* the buggle now faces a wall */</span>

source: If you want to nest several loops, you can do it on one line in Scala. This means that the two following chunks are equivalent:
ta: If you want பெறுநர் nest several loops, you can do it on one வரி in Scala. This means that the two following chunks அரே equivalent:

source: for (stepper1 &lt;- 1 to n) { for (stepper2 &lt;- 1 to m) { actions() } }
ta: க்கு (stepper1 &lt;- 1 பெறுநர் n) { க்கு (stepper2 &lt;- 1 பெறுநர் m) { actions() } }

source: for (stepper1 &lt;- 1 to n; stepper2 &lt;- 1 to m) { <span class="comment">// Simply separate both loop conditions with a semi-column</span> actions() }
ta: க்கு (stepper1 &lt;- 1 பெறுநர் n; stepper2 &lt;- 1 பெறுநர் m) { <span class="comment">// Simply separate both loop conditions with a semi-column</span> actions() }

source: You now have to redo the same exercise than previously (move forward until being over a baggle, pick it up, move back to your original location, drop the baggle), but using a <code>for</code> loop instead of a <code>while</code> loop to move back to the initial location.
ta: You now have பெறுநர் மீண்டும்செய் the same exercise than previously (move forward until being வீச்சலகு a baggle, pick it up, move பின் பெறுநர் your original location, drop the baggle), but using a <code>for</code> loop instead of a <code>while</code> loop பெறுநர் move பின் பெறுநர் the initial location.

source: Once done, you can proceed to next exercise.
ta: Once done, you can proceed பெறுநர் அடுத்தது exercise.

source: Stairway to Heaven
ta: Stairway பெறுநர் Heaven

source: Your buggle feels a bit depressed today, but it's currently facing a magic stair: It leads directly to heaven, and each time you walk on it, joyful colors spur all around.
ta: Your buggle feels a துணுக்கு depressed today, but it's currently facing a magic stair: It இழுதுகள் directly பெறுநர் heaven, and each time you walk on it, joyful colors spur அனைத்தும் around.

source: Your goal is to take this stair, one step after the other. First devise the four instructions you have to give you buggle to take one stair step, and then put them in a loop to take the whole stair.
ta: Your goal is பெறுநர் take this stair, one படி after the other. First devise the நான்கு, நாலடி, நான்கடி instructions you have பெறுநர் give you buggle பெறுநர் take one stair step, and then put them in a loop பெறுநர் take the whole stair.

source: Before that, walk a bit forward to reach that stair, and ensure that you are in the right situation for your loop content to run properly. And once you reach the heaven, take some steps in your new home. Meanwhile, you just have to walk your way, the colors appear automagically.
ta: Before that, walk a துணுக்கு forward பெறுநர் reach that stair, and ensure that you அரே in the வலது situation க்கு your loop content பெறுநர் ஓடு properly. And once you reach the heaven, take some படிகள் in your புதிய home. Meanwhile, you just have பெறுநர் walk your way, the colors appear automagically.

source: Today, your buggle wants to get some serious exercise: It wants to run 'till the track burns! Its super-shoes are just perfect to run like hell, but unfortunately, they can actually damage the track on the long run...
ta: Today, your buggle wants பெறுநர் get some serious exercise: It wants பெறுநர் ஓடு 'till the மின்தடம் burns! Its super-shoes அரே just perfect பெறுநர் ஓடு like hell, but unfortunately, they can actually damage the மின்தடம் on the long run...

source: Your goal is to run the track 10 times, no matter what happens. Even if the track suffers, you <b>really HAVE</b> to take that run. Remember, the track has four sides, that take eight steps each to run along. Now go, and show them what these super shoes can do.
ta: Your goal is பெறுநர் ஓடு the மின்தடம் 10 times, இல்லை பொருண்மை, பருப்பொருள் what happens. இரட்டை if the மின்தடம் suffers, you <b>really HAVE</b> பெறுநர் take that run. Remember, the மின்தடம் has நான்கு, நாலடி, நான்கடி sides, that take eight படிகள் each பெறுநர் ஓடு along. Now go, and காட்டு them what these super shoes can do.

source: You don't have to do anything particular with regard of the colors: your shoes will do it for you. Just take that run!
ta: You don't have பெறுநர் do anything particular with regard of the colors: your shoes will do it க்கு you. Just take that run!

source: Well, our last training didn't went that well. The track actually burned, and we are now banned from there. This time, our buggle decided to practice outdoor, in the middle of the forest, with its good old shoes instead. The problem is that you have to be careful to not fall into water. The track on which you can run is rather narrow: One side is now 4 steps forward, 2 steps to the left, 4 steps to the right, 2 steps to the right, 4 steps to the left, and you want to run 7 around.
ta: Well, our last training didn't went that well. The மின்தடம் actually burned, and we அரே now banned இருந்து there. This time, our buggle decided பெறுநர் practice outdoor, in the middle of the forest, with its good old shoes instead. The problem is that you have பெறுநர் be careful பெறுநர் not fall into water. The மின்தடம் on which you can ஓடு is rather narrow: One பக்கம் is now 4 படிகள் forward, 2 படிகள் பெறுநர் the left, 4 படிகள் பெறுநர் the right, 2 படிகள் பெறுநர் the right, 4 படிகள் பெறுநர் the left, and you want பெறுநர் ஓடு 7 around.

source: Oh crap, running on the grass seems to destroy it too! So just take your 7 loops around the garden, and move along to the next exercise before anyone notices the damage you made...
ta: Oh crap, running on the grass seems பெறுநர் destroy it too! So just take your 7 வளையங்கள் around the garden, and move along பெறுநர் the அடுத்தது exercise before anyone notices the damage you made...

source: Some cells of the world are yellow, but your buggle cannot stand being in such cells. Write the necessary code to move forward until the ground gets white. For that, use the provided method <code>isGroundWhite()</code>.
ta: Some cells of the world அரே yellow, but your buggle cannot stand being in such cells. Write the necessary குறியீடு பெறுநர் move forward until the ground gets white. க்கு that, use the provided method <code>isGroundWhite()</code>.

source: The trick is that most buggles of this world are currently on this yellow ground that they dislike so much. That is why they are in panic, and every buggle rushes one cell forward, even the buggle that was not on a yellow cell at first. In other worlds, even if the ground is white on the first cell, you still want to move forward to the next cell.
ta: The trick is that பெரும்பாலானவை buggles of this world அரே currently on this மஞ்சள் ground that they dislike so much. That is why they அரே in panic, and every buggle rushes one கலன் forward, இரட்டை the buggle that was not on a மஞ்சள் கலன் at first. In மற்றொன்று worlds, இரட்டை if the ground is வெள்ளை on the first cell, you still want பெறுநர் move forward பெறுநர் the அடுத்தது cell.

source: The general idea is to do something like:
ta: The பொது idea is பெறுநர் do something like:

source: move forward until located in a white cell
ta: move forward until located in a வெள்ளை கலன்
