Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: The main difficulty is that we want this loop body to be executed once, even we are already on a white cell. It would be easy to do so by duplicating the loop content before the actual loop, but this would be a bad idea: code duplication is a <b>very</b> bad habit, and you should <b>always</b> avoid it.
ta: The main difficulty is that we want this loop body பெறுநர் be executed once, இரட்டை we அரே already on a வெள்ளை cell. It would be easy பெறுநர் do so by duplicating the loop content before the actual loop, but this would be a bad idea: குறியீடு படியீடு is a <b>very</b> bad habit, and you should <b>always</b> avoid it.

source: Code duplication easily turns code maintenance into a nightmare: reading the code becomes difficult as the reader must ensure that no slight difference exist between the versions. Debugging the code becomes difficult, as bugs have to be fixed in all versions. Actually, every modification of the code becomes difficult. So, really, you should <b>always</b> strive to not duplicate your code if you can avoid. And the good news is that you always can...
ta: குறியீடு படியீடு easily turns குறியீடு maintenance into a nightmare: படித்தல் the குறியீடு becomes difficult அச் the reader must ensure that இல்லை slight வேறுபாடு exist between the versions. Debugging the குறியீடு becomes difficult, அச் bugs have பெறுநர் be fixed in அனைத்தும் versions. Actually, every modification of the குறியீடு becomes difficult. So, really, you should <b>always</b> strive பெறுநர் not duplicate your குறியீடு if you can avoid. And the good செய்தி is that you எப்போதும் can...

source: Some languages have specific constructs for that, but not the Python language. No problem, we can do it on our own! A good way is to have a dedicated variable indicating whether we are taking the loop for the first time or not, as follows.
ta: Some மொழிகள் have specific constructs க்கு that, but not the பைதான் language. இல்லை problem, we can do it on our own! A good way is பெறுநர் have a dedicated variable indicating whether we அரே taking the loop க்கு the first time or not, அச் follows.

source: When <code>firstTime</code> is true, the loop body is executed even if the other conditions would imply the contrary. Once the loop body has been executed once, it is set to false and never impact again the decision to enter the body or not.
ta: When <code>firstTime</code> is true, the loop body is executed இரட்டை if the மற்றொன்று conditions would imply the contrary. Once the loop body has been executed once, it is கணம் பெறுநர் false and ஒருபோதும் impact again the decision பெறுநர் enter the body or not.

source: In a <tt>while</tt> loop, the condition is evaluated before anything else, and if it's false, the loop body is never evaluated. Sometimes (although not that often), you would prefer the loop body to get evaluated at least once, even if the condition is initially false. For that, a variation of the <tt>while</tt> loop gets used, using the following syntax in [!thelang]. [!java|c]Do not forget the semi-column (;) after the condition, it is mandatory.[/!]
ta: In a <tt>while</tt> loop, the condition is evaluated before anything else, and if it's false, the loop body is ஒருபோதும் evaluated. Sometimes (although not that often), you would prefer the loop body பெறுநர் get evaluated at least once, இரட்டை if the condition is initially false. க்கு that, a variation of the <tt>while</tt> loop gets used, using the following syntax in [!thelang]. [!java|c]Do not forget the semi-column (;) after the condition, it is mandatory.[/!]

source: Your buggle got lost in a strange maze, and you must help it to find the exit that is represented in orange. You cannot simply explain the path to the exit in something like <code>right();forward();forward();forward()</code> because you have to save two buggles at the same time, that are lost in similar but not identical worlds. You can switch to the other world by using the combobox above the world representation (where it's written 'Deep Forest' right now), and selecting the other entry (that should read 'Deeper Forest').
ta: Your buggle got lost in a strange maze, and you must உதவி it பெறுநர் கண்டுபிடி the exit that is represented in orange. You cannot simply explain the பாதை பெறுநர் the exit in something like <code>right();forward();forward();forward()</code> because you have பெறுநர் சேமி two buggles at the same time, that அரே lost in similar but not identical worlds. You can ஆளி, நிலைமாறி பெறுநர் the மற்றொன்று world by using the combobox above the world representation (where it's written 'Deep Forest' வலது now), and selecting the மற்றொன்று நுழைவு (that should read 'Deeper Forest').

source: The good news is that the path to the exit is written on the ground. As you can see, the world is made of several corridors, with baggles on the ground. After each corridor, you should turn left if the corridor contains three baggels or more, and you have to turn right if there is only 2 baggles or less.
ta: The good செய்தி is that the பாதை பெறுநர் the exit is written on the ground. அச் you can see, the world is made of several corridors, with baggles on the ground. After each corridor, you should turn இடது if the corridor contains three baggels or more, and you have பெறுநர் turn வலது if there is only 2 baggles or less.

source: You should count exactly 5 cells per corridor, from intersection to intersection. Consider in your count the intersection ending the corridor but not the intersection before the corridor.
ta: You should எண்ணுங்கள் exactly 5 cells per corridor, இருந்து intersection பெறுநர் intersection. Consider in your எண்ணுங்கள் the intersection ending the corridor but not the intersection before the corridor.

source: So, the general form of your code must be something like "while I did not find the exit, take the next corridor to decide whether I should turn left or right at the next intersection". You can determine whether you are on the exit cell (that is orange) with the provided <code>exitReached()</code> method.
ta: So, the பொது form of your குறியீடு must be something like "while I did not கண்டுபிடி the exit, take the அடுத்தது corridor பெறுநர் decide whether I should turn இடது or வலது at the அடுத்தது intersection". You can determine whether you அரே on the exit கலன் (that is orange) with the provided <code>exitReached()</code> method.

source: To take one corridor, you simply have to run from one intersection to another while counting the baggles you see on your path. That's easy: there is 5 steps in each corridors so a simple <code>for</code> loop suffices.
ta: பெறுநர் take one corridor, you simply have பெறுநர் ஓடு இருந்து one intersection பெறுநர் another while counting the baggles you see on your path. That's easy: there is 5 படிகள் in each corridors so a simple <code>for</code> loop suffices.

source: I cannot imagine how to count the baggles I see.
ta: I cannot imagine how பெறுநர் எண்ணுங்கள் the baggles I see.

source: You need a variable that is initialized to 0, and incremented each time you see a baggle on the ground. A variable used this way is often called <i>counter</i>.
ta: You need a variable that is initialized பெறுநர் 0, and incremented each time you see a baggle on the ground. A variable used this way is often called <i>counter</i>.

source: Don't forget to reset your counter to 0 at the beginning of each corridor!
ta: Don't forget பெறுநர் மீட்டமை your counter பெறுநர் 0 at the beginning of each corridor!

source: Oh, and when you reach the exit, don't forget to take an extra step to actually exit the maze!
ta: Oh, and when you reach the exit, don't forget பெறுநர் take an extra படி பெறுநர் actually exit the maze!

source: Hu oh! Your buggle got lost again in the same kind of maze, but this time, the corridors are not always of the same size. Since there is no way to know the length of the corridor before taking it, a <code>for</code> will not suffice anymore. Instead, you will have to change your inner loop to use a <code>while</code> loop, using the method <code>crossing()</code> that tells whether your buggle currently stands on an intersection.
ta: உ oh! Your buggle got lost again in the same kind of maze, but this time, the corridors அரே not எப்போதும் of the same size. Since there is இல்லை way பெறுநர் know the length of the corridor before taking it, a <code>for</code> will not suffice anymore. Instead, you will have பெறுநர் change your inner loop பெறுநர் use a <code>while</code> loop, using the method <code>crossing()</code> that tells whether your buggle currently stands on an intersection.

source: The extra complexity is that at the beginning of a corridor, you obviously stand on an intersection, but you still want to move on. [!java|scala|c]For that, the easiest is to use a <code>do / while</code> loop instead of a regular <code>while</code> loop to move until the next intersection.[/!] [!python]For that, use an extra variable indicating whether you already entered the corridor, as follows. This will ensure that you execute the loop body at least once (when <code>firstTime</code> is true) before we actually use the value returned by <code>crossing()</code> to determine to continue or not.[/!]
ta: The extra complexity is that at the beginning of a corridor, you obviously stand on an intersection, but you still want பெறுநர் move on. [!java|scala|c]For that, the easiest is பெறுநர் use a <code>do / while</code> loop instead of a regular <code>while</code> loop பெறுநர் move until the அடுத்தது intersection.[/!] [!python]For that, use an extra variable indicating whether you already entered the corridor, அச் follows. This will ensure that you execute the loop body at least once (when <code>firstTime</code> is true) before we actually use the மதிப்பு returned by <code>crossing()</code> பெறுநர் determine பெறுநர் தொடரவும் or not.[/!]

source: With that new trick, your buggle should exit this maze quite easily.
ta: With that புதிய trick, your buggle should exit this maze quite easily.

source: The goal of this exercise is to reproduce the pattern of the first row in the other rows with a shift of one cell (see the Objective tab for details). The biggest difference between this exercise and the others we had on patterns is that you have to read the pattern (on first row) before reproducing it. You cannot do otherwise because the same code will be executed on three different worlds, each of them having a specific pattern.
ta: The goal of this exercise is பெறுநர் reproduce the pattern of the first நிரை in the மற்றொன்று rows with a உயர்த்து of one கலன் (see the Objective தாவல் க்கு details). The biggest வேறுபாடு between this exercise and the others we had on patterns is that you have பெறுநர் read the pattern (on first row) before reproducing it. You cannot do otherwise because the same குறியீடு will be executed on three different worlds, each of them having a specific pattern.

source: One solution is to read the next cell, and go copy it in position before coming back to read the second cell. But since it is forbidden to use the methods to teleport the buggle to a specific position (<code>setPos()</code> and similar), this approach will be a pain to implement.
ta: One நீர்மக்கூழ் is பெறுநர் read the அடுத்தது cell, and go நகலெடு it in position before coming பின் பெறுநர் read the second cell. But since it is forbidden பெறுநர் use the முறைகள் பெறுநர் teleport the buggle பெறுநர் a specific position (<code>setPos()</code> and similar), this approach will be a pain பெறுநர் implement.

source: The simplest is to store the sequence of colors that constitute the whole pattern in an [!java|scala]<b>array</b>[/!][!python]<b>list</b>[/!]. But before we can do so, we should learn a bit what [!java|scala]arrays[/!][!python]lists[/!] are.
ta: The simplest is பெறுநர் store the வரிசை of colors that constitute the whole pattern in an [!java|scala]<b>array</b>[/!][!python]<b>list</b>[/!]. But before we can do so, we should learn a துணுக்கு what [!java|scala]arrays[/!][!python]lists[/!] are.

source: [!java|scala]An array[/!][!python]A list[/!] is an ordered sequence of variables that go together. It is somehow similar to a shelve where each level can store a separate value. Each variable of the sequence is identified by its position, and can store a specific value. [!java|scala]All cells of the array must store values of the same type because arrays are homogeneous in [!thelang]. It is possible to trick this restriction by using the datatype <code>[!java]Object[/!][!scala]Any[/!]</code> that can contain [!java]almost[/!] any other datatype. [!java]Primitive types such as the ones we saw so far (int, boolean, double, char, etc) cannot be stored in an Object variable, but their objectified counter-part (Integer, Boolean, Double, Char, Boolean, etc) can.[/!] It is however a good practice to make the type of an array as specific as possible, i.e., if you plan to store some integers in your array, make it an array of integers, not of [!java]Object[/!][!scala]Any[/!].[/!] [!python]Lists can even mix values of differing types, such as integer values in some cells and colors in other cells.[/!]
ta: [!java|scala]An array[/!][!python]A list[/!] is an ordered வரிசை of மாறிகள் that go together. It is somehow similar பெறுநர் a shelve where each நிலை can store a separate value. Each variable of the வரிசை is identified by its position, and can store a specific value. [!java|scala]All cells of the array must store values of the same வகை because arrays அரே homogeneous in [!thelang]. It is possible பெறுநர் trick this restriction by using the datatype <code>[!java]Object[/!][!scala]Any[/!]</code> that can contain [!java]almost[/!] any மற்றொன்று datatype. [!java]Primitive வகைகள் such அச் the ones we saw so far (int, boolean, double, char, etc) cannot be stored in an பொருள் variable, but their objectified counter-part (Integer, Boolean, Double, Char, Boolean, etc) can.[/!] It is however a good practice பெறுநர் make the வகை of an array அச் specific அச் possible, i.e., if you plan பெறுநர் store some integers in your array, make it an array of integers, not of [!java]Object[/!][!scala]Any[/!].[/!] [!python]Lists can இரட்டை mix values of differing types, such அச் முழு எண் values in some cells and colors in மற்றொன்று cells.[/!]

source: T is the [!java|scala]array[/!][!python]list[/!]'s name, [!java|python]T[0][/!][!scala]T(0)[/!] is the name of the first cell, [!java|python]T[1][/!][!scala]T(1)[/!] the name of the second cell, [!java|python]T[2][/!][!scala]T(2)[/!] the third one, etc. And yes, the first cell is numbered [!java|python]T[0][/!][!scala]T(0)[/!] while the last one of [!java|scala]an array[/!][!python]a list[/!] of size N is [!java|python]T[N-1][/!][!scala]T(N-1)[/!]. It may seem funny to count starting from 0 and not from 1 as usual, but some historical reasons make it unavoidable here.
ta: T is the [!java|scala]array[/!][!python]list[/!]'s name, [!java|python]T[0][/!][!scala]T(0)[/!] is the பெயர் of the first cell, [!java|python]T[1][/!][!scala]T(1)[/!] the பெயர் of the second cell, [!java|python]T[2][/!][!scala]T(2)[/!] the third one, etc. And yes, the first கலன் is numbered [!java|python]T[0][/!][!scala]T(0)[/!] while the last one of [!java|scala]an array[/!][!python]a list[/!] of அளவு N is [!java|python]T[N-1][/!][!scala]T(N-1)[/!]. It சி-வைகாசி seem funny பெறுநர் எண்ணுங்கள் starting இருந்து 0 and not இருந்து 1 அச் usual, but some historical reasons make it unavoidable here.

source: Basic usage
ta: அடிப்படை usage

source: We can use an integer variable <i>i</i> to access with [!java|python]T[i][/!][!scala]T(i)[/!] to the cells: when the value of <i>i</i> is 0, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[0][/!][!scala]T(0)[/!]; when the value of <i>i</i> is 10, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[10][/!][!scala]T(10)[/!]. <i>i</i> is said to be the <b>index</b> in T. <code>[!java|python]T[i][/!][!scala]T(i)[/!]</code> can be used just like any variable. We can set a new value:
ta: We can use an முழு எண் variable <i>i</i> பெறுநர் access with [!java|python]T[i][/!][!scala]T(i)[/!] பெறுநர் the cells: when the மதிப்பு of <i>i</i> is 0, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[0][/!][!scala]T(0)[/!]; when the மதிப்பு of <i>i</i> is 10, then [!java|python]T[i][/!][!scala]T(i)[/!] accesses [!java|python]T[10][/!][!scala]T(10)[/!]. <i>i</i> is said பெறுநர் be the <b>index</b> in T. <code>[!java|python]T[i][/!][!scala]T(i)[/!]</code> can be used just like any variable. We can கணம் a புதிய value:

source: x = [!java|python]T[i][/!][!scala]T(i)[/!][!java];[/!]
ta: ஃச் = [!java|python]T[i][/!][!scala]T(i)[/!][!java];[/!]

source: We can test this value:
ta: We can தேர்வு this value:

source: It is very easy to traverse the whole [!scala|java]array[/!][!python]list[/!], for example to initialize each cells.
ta: It is very easy பெறுநர் traverse the whole [!scala|java]array[/!][!python]list[/!], க்கு example பெறுநர் initialize each cells.

source: [!java]for (int i = 0; i&lt;T.length; i++) {[/!][!python]for i in range(len(T)):[/!][!scala]for (i &lt;- 0 to T.length-1) {[/!] [!java|python]T[i][/!][!scala]T(i)[/!] = 3[!java];[/!] [!java|scala]}[/!]
ta: [!java]for (int i = 0; i&lt;T.length; i++) {[/!][!python]for i in range(len(T)):[/!][!scala]for (i &lt;- 0 பெறுநர் T.length-1) {[/!] [!java|python]T[i][/!][!scala]T(i)[/!] = 3[!java];[/!] [!java|scala]}[/!]

source: [!java|scala]The notation <code>T.length</code> retrieves the length of the array T,[/!] [!python]The function <code>len()</code> retrieves the length of the list T,[/!] allowing to build a classical for loop easily. [!python]Actually, the <code>len()</code> function is much more generic and can be used to retrieve the length of many objects. Applied to strings for example, it returns the amount of chars in this string.[/!] [!scala]Don't forget to start at <code>0</code> and stop at <code>T.length-1</code> instead of <code>1</code> to <code>T.length</code> however.[/!]
ta: [!java|scala]The notation <code>T.length</code> retrieves the length of the array T,[/!] [!python]The சார்பு <code>len()</code> retrieves the length of the பட்டியல் T,[/!] allowing பெறுநர் உருவாக்கு a classical க்கு loop easily. [!python]Actually, the <code>len()</code> சார்பு is much more generic and can be used பெறுநர் retrieve the length of many objects. Applied பெறுநர் சரங்கள் க்கு example, it returns the amount of chars in this string.[/!] [!scala]Don't forget பெறுநர் தொடங்கு at <code>0</code> and நிறுத்து at <code>T.length-1</code> instead of <code>1</code> பெறுநர் <code>T.length</code> however.[/!]

source: If you just want to iterate over the values of T without keeping track of their index, you can simply write:
ta: If you just want பெறுநர் iterate வீச்சலகு the values of T without keeping மின்தடம் of their index, you can simply எழுது:

source: [!java]This construct is called an <i>extended loop</i> in Java. The variable <i>i</i> takes all values of the set located to the right of the colon (:), one after the other.[/!] [!python|scala]This is actually very similar to the previous construct. Simply, <code>[!python]range(n)[/!][!scala]i to j[/!]</code> returns a set of integers over which the for construct iterates. Actually, [!thelang] offers much more elegant ways to traverse [!python]lists[/!][!scala]arrays[/!] and other data collections, but this should be the topic of a specific set of exercises (that are still to be written in PLM).[/!]
ta: [!java]This construct is called an <i>extended loop</i> in Java. The variable <i>i</i> takes அனைத்தும் values of the கணம் located பெறுநர் the வலது of the பெருங்குடல் (:), one after the other.[/!] [!python|scala]This is actually very similar பெறுநர் the previous construct. Simply, <code>[!python]range(n)[/!][!scala]i பெறுநர் j[/!]</code> returns a கணம் of integers வீச்சலகு which the க்கு construct iterates. Actually, [!thelang] offers much more elegant ways பெறுநர் traverse [!python]lists[/!][!scala]arrays[/!] and மற்றொன்று தகவல்கள் collections, but this should be the topic of a specific கணம் of exercises (that அரே still பெறுநர் be written in PLM).[/!]

source: If you know beforehand the content of your list, you can affect these values all together. Just put them between square braces and separated by commas as follows:
ta: If you know beforehand the content of your list, you can affect these values அனைத்தும் together. Just put them between square braces and separated by commas அச் follows:

source: L = [1, 3, 5, 7, 9] <span class="comment"># L is now an array of 5 values, all of them being integers</span>
ta: L = [1, 3, 5, 7, 9] <span class="comment"># L is now an array of 5 values, அனைத்தும் of them being integers</span>

source: Otherwise, you probably want to create an empty list and then append each values separately to the list:
ta: Otherwise, you probably want பெறுநர் create an வெறுமை பட்டியல் and then பிற்சேர் each values separately பெறுநர் the list:

source: L2 = [] <span class="comment"># L2 is now an empty list</span> L2.append(1) L2.append(3) L2.append(5) L2.append(7) L2.append(9) <span class="comment"># Its content is now the same as L previously</span>
ta: L2 = [] <span class="comment"># L2 is now an வெறுமை list</span> L2.append(1) L2.append(3) L2.append(5) L2.append(7) L2.append(9) <span class="comment"># Its content is now the same அச் L previously</span>

source: To declare a variable named <b>T</b> that can store an array of integers, one should write:
ta: பெறுநர் declare a variable named <b>T</b> that can store an array of integers, one should எழுது:

source: [!java]<code>int</code> means that the elements of the array are of type integer; <code>[]</code> means that we are speaking of an array and <code>T</code> is the name of the variable. For historical reasons, this can also be written as <code>int T[]</code> (with the [] after the variable name), but this is less readable and should probably be avoided.[/!] [!scala]The <code>[Int]</code> notation specializes the Array type (that is generic), specifying that each cell of this array is an integer. An array of booleans would simply by written <code>Array[Boolean]</code>.[/!]
ta: [!java]<code>int</code> means that the elements of the array அரே of வகை integer; <code>[]</code> means that we அரே speaking of an array and <code>T</code> is the பெயர் of the variable. க்கு historical reasons, this can also be written அச் <code>int T[]</code> (with the [] after the variable name), but this is less readable and should probably be avoided.[/!] [!scala]The <code>[Int]</code> notation specializes the Array வகை (that is generic), specifying that each கலன் of this array is an integer. An array of booleans would simply by written <code>Array[Boolean]</code>.[/!]

source: Declaring a variable <code>T</code> that stores an array only reserve the <b>name</b> <code>T</code> for later use, but not the memory area to store the cells. The array is not initialized yet: it does not have any value. What would <code>[!java]T[4][/!][!scala]T(4)[/!]</code> mean if we didn't say that the array is 5 cells long?
ta: Declaring a variable <code>T</code> that stores an array only காப்பு the <b>name</b> <code>T</code> க்கு later use, but not the memory area பெறுநர் store the cells. The array is not initialized yet: it does not have any value. What would <code>[!java]T[4][/!][!scala]T(4)[/!]</code> இடை, சராசரி if we didn't say that the array is 5 cells long?

source: First and foremost, we have to give a value to <code>T</code>:
ta: First and foremost, we have பெறுநர் give a மதிப்பு பெறுநர் <code>T</code>:

source: [!java]T = new int[10];[/!][!scala]var T = new Array[Int](10)[/!]
ta: [!java]T = புதிய int[10];[/!][!scala]var T = புதிய Array[Int](10)[/!]
