Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: Note that the use of "total turning" rather than just the "current direction" allows the algorithm to avoid G-shapped traps. If one proceeds left into the trap, one gets turned around a full 360 degrees by the walls. As we said before, the naive "current direction" algorithm gets into a limit cycle as it leaves the lower rightmost wall heading left and runs into the curved section on the left again.
ta: குறிப்பு that the use of "total turning" rather than just the "current direction" allows the படிமுறை பெறுநர் avoid G-shapped traps. If one proceeds இடது into the trap, one gets turned around a full 360 degrees by the walls. அச் we said before, the naive "current direction" படிமுறை gets into a limit cycle அச் it leaves the lower rightmost wall heading இடது and runs into the curved பிரிவு on the இடது again.

source: The Pledge's algorithm does not leave the rightmost wall due to the total turning not being zero at that point. It follows the wall all the way around, finally leaving it heading left on the bottom outside
ta: The Pledge's படிமுறை does not leave the rightmost wall due பெறுநர் the total turning not being சுழிமம் at that point. It follows the wall அனைத்தும் the way around, finally leaving it heading இடது on the கீழே outside

source: <a name="Objective"/>You now have to modify your solution to implement the Pledge algorithm to escape this maze.
ta: <a name="Objective"/>You now have பெறுநர் modify your நீர்மக்கூழ் பெறுநர் implement the Pledge படிமுறை பெறுநர் escape this maze.

source: Change your <code>keepHandOnSideWall()</code> method to count the amount of turns done by the buggle (+1 when it turns left, and -1 when it turns right). This counting may require the addition of an <code>angleSum</code> integer value in your program.
ta: Change your <code>keepHandOnSideWall()</code> method பெறுநர் எண்ணுங்கள் the amount of turns முடிந்தது by the buggle (+1 when it turns left, and -1 when it turns right). This counting சி-வைகாசி require the கூட்டல் of an <code>angleSum</code> முழு எண் மதிப்பு in your program.

source: Write a boolean method <code>isDirectionFree(dir)</code> indicating if the provided direction is free, ie, if you can move in that direction (Note that the demo uses the NORTH direction for that). You can retrieve the current direction of the buggle using the method <code>getDirection()</code>. You can change your direction (without moving) using <code>setDirection(dir)</code>. Don't forget to store the previous direction of your buggle (in a dedicated variable) before checking if your favorite direction is free in order to restore your state afterward.
ta: Write a boolean method <code>isDirectionFree(dir)</code> indicating if the provided direction is free, ie, if you can move in that direction (Note that the demo uses the வடக்கு direction க்கு that). You can retrieve the மின்னோட்ட்ம், ஓட்டம் direction of the buggle using the method <code>getDirection()</code>. You can change your direction (without moving) using <code>setDirection(dir)</code>. Don't forget பெறுநர் store the previous direction of your buggle (in a dedicated variable) before checking if your favorite direction is free in order பெறுநர் restore your state afterward.

source: You may have to change the rest of your code also, but these changes should remain limited.
ta: You சி-வைகாசி have பெறுநர் change the rest of your குறியீடு also, but these changes should remain limited.

source: Don't forget that if you have a method modifying a global variable (such as angleSum), you should ensure that it declares this variable as global. Without it, the method creates a new variable of the same name, and the global never gets modified.
ta: Don't forget that if you have a method modifying a உலகளாவிய variable (such அச் angleSum), you should ensure that it declares this variable அச் global. Without it, the method creates a புதிய variable of the same name, and the உலகளாவிய ஒருபோதும் gets modified.

source: def myMethod(): global angleSum ... angleSum = angleSum + 1
ta: def myMethod(): உலகளாவிய angleSum ... angleSum = angleSum + 1

source: Show an additional tip
ta: காட்டு an additional tip

source: You should set your direction to your favorite one (NORTH is advised). Then, you should write the algorithm main loop. In other words, while your buggle did not find its biscuit, you have to move forward until next obstacle in the favorite direction. Then, put a paw on a wall (using <code>keepHandOnSideWall()</code>) while the sum of turns is not null and the favorite direction is not free. Do that until you find your baggle.
ta: You should கணம் your direction பெறுநர் your favorite one (NORTH is advised). Then, you should write the படிமுறை main loop. In மற்றொன்று words, while your buggle did not கண்டுபிடி its biscuit, you have பெறுநர் move forward until அடுத்தது obstacle in the favorite direction. Then, put a paw on a wall (using <code>keepHandOnSideWall()</code>) while the sum of turns is not null and the favorite direction is not free. Do that until you கண்டுபிடி your baggle.

source: You thought that your algorithm was enough to escape mazes? Well, not every mazes...
ta: You thought that your படிமுறை was enough பெறுநர் escape mazes? Well, not every mazes...

source: The <i>wall follower algorithm</i> we used so far only works if the entry and the exit are placed near to walls connected to the external wall. But if the buggle begins in the middle of the maze, it may exist wall sections disconnected from the external wall.
ta: The <i>wall follower algorithm</i> we used so far only works if the நுழைவு and the exit அரே placed near பெறுநர் walls connected பெறுநர் the external wall. But if the buggle begins in the middle of the maze, it சி-வைகாசி exist wall பிரிவுகள் disconnected இருந்து the external wall.

source: That is why the previous strategy would let the buggle round around for ever. Indeed, the maze you should now escape from contains islands, and the buggle does not start along one of the external walls. Just give it a try if you want: copy your code over, push the run button and see your previous solution failing miserabily.
ta: That is why the previous strategy would let the buggle round around க்கு ever. Indeed, the maze you should now escape இருந்து contains islands, and the buggle does not தொடங்கு along one of the external walls. Just give it a try if you want: நகலெடு your குறியீடு over, push the ஓடு button and see your previous நீர்மக்கூழ் failing miserabily.

source: The method of following a wall is still good and allow to escape very efficiently some sections of the maze, so we do not want to remove it entierely. Instead, we want to stop following the wall under some conditions. Notice that the baggle lays near to the external border of the maze. So, we want to reach the border and then follow that wall. We need for example to search for the north wall before following it to the baggle.
ta: The method of following a wall is still good and allow பெறுநர் escape very efficiently some பிரிவுகள் of the maze, so we do not want பெறுநர் அகற்று it entierely. Instead, we want பெறுநர் நிறுத்து following the wall under some conditions. Notice that the baggle lays near பெறுநர் the external border of the maze. So, we want பெறுநர் reach the border and then follow that wall. We need க்கு example பெறுநர் தேடல் க்கு the வடக்கு wall before following it பெறுநர் the baggle.

source: To find the north wall, you simply run to the north as long as it's possible, and when facing an obstacle, you avoid it (using previous method).
ta: பெறுநர் கண்டுபிடி the வடக்கு wall, you simply ஓடு பெறுநர் the வடக்கு அச் long அச் it's possible, and when facing an obstacle, you avoid it (using previous method).

source: Our new run() method will consist in two modes: our buggle will alternate between the "north runner mode" and the "left follower mode". You begin in "north runner mode", and switch to "left follower" when you have a wall at the north (do not forget to make sure you have a wall at your left before switching to "left follower" mode). You switch to "north runner" as soon as your buggle is facing north and is not in front of a wall during its trip around its left wall. The easiest way to write such a state machine is something like
ta: Our புதிய run() method will consist in two modes: our buggle will alternate between the "north runner mode" and the "left follower mode". You begin in "north runner mode", and ஆளி, நிலைமாறி பெறுநர் "left follower" when you have a wall at the வடக்கு (do not forget பெறுநர் make sure you have a wall at your இடது before switching பெறுநர் "left follower" mode). You ஆளி, நிலைமாறி பெறுநர் "north runner" அச் soon அச் your buggle is facing வடக்கு and is not in front of a wall during its trip around its இடது wall. The easiest way பெறுநர் write such a state machine is something like

source: [!scala]var state=0; state match { case 0 => // North runner ... state = 1; case 1 => // Left follower ... state = 0; case _ => println("This case should not happen. Please fix me") }[/!][!java|c]int state=0; switch (state) { case 0: // North runner ... state = 1; break; case 1: // Left follower ... state = 0; break; }[/!][!python]northRunner = True if northRunner: ... northRunner = False else: # left follower ... northRunner = True[/!]
ta: [!scala]var state=0; state match { case 0 => // வடக்கு runner ... state = 1; case 1 => // இடது follower ... state = 0; case _ => println("This case should not happen. Please fix me") }[/!][!java|c]int state=0; switch (state) { case 0: // வடக்கு runner ... state = 1; break; case 1: // இடது follower ... state = 0; break; }[/!][!python]northRunner = True if northRunner: ... northRunner = False else: # இடது follower ... northRunner = True[/!]

source: Don't forget the default case (matching _), or scala will issue an error since your matching would be incomplete.[/!]
ta: Don't forget the இயல்புநிலை case (matching _), or scala will சிக்கல் an பிழை since your matching would be incomplete.[/!]

source: Don't forget to let the buggle pick the baggle at the end of your code.
ta: Don't forget பெறுநர் let the buggle pick the baggle at the end of your code.

source: You're up. That should be enough for you to figure out how to escape this maze, but if not, you can always request for the tip. But you do not need any more help, do you?
ta: You're up. That should be enough க்கு you பெறுநர் figure out how பெறுநர் escape this maze, but if not, you can எப்போதும் request க்கு the tip. But you do not need any more help, do you?

source: Basic Shortest Path algorithm
ta: அடிப்படை Shortest பாதை படிமுறை

source: To conclude with this introductory lesson to maze solving algorithms, we will investigate another way to find the exit. The buggle in this lesson is a special buggle: he is a jedi. He can feel the Force. This means he is able to feel his environment.
ta: பெறுநர் conclude with this introductory பாடம் பெறுநர் maze solving algorithms, we will investigate another way பெறுநர் கண்டுபிடி the exit. The buggle in this பாடம் is a special buggle: he is a jedi. He can feel the Force. This means he is able பெறுநர் feel his environment.

source: Without even leaving his position, he can retrieve information about the world he is leaving in, with the following functions:
ta: Without இரட்டை leaving his position, he can retrieve செய்தி பற்றி the world he is leaving in, with the following functions:

source: <code>hasTopWall(x,y)</code> tells whether the cell (x,y) of this world has a wall on top.
ta: <code>hasTopWall(x,y)</code> tells whether the கலன் (x,y) of this world has a wall on top.

source: <code>hasLeftWall(x,y)</code> tells whether the cell (x,y) of this world has a wall on the left.
ta: <code>hasLeftWall(x,y)</code> tells whether the கலன் (x,y) of this world has a wall on the left.

source: <code>hasBaggle(x,y)</code> tells whether the cell (x,y) of this world has a baggle.
ta: <code>hasBaggle(x,y)</code> tells whether the கலன் (x,y) of this world has a baggle.

source: <code>setIndication(x,y,i)</code> adds the integer indication <code>i</code> to the cell (x,y).
ta: <code>setIndication(x,y,i)</code> adds the முழு எண் indication <code>i</code> பெறுநர் the கலன் (x,y).

source: <code>getIndication(x,y,i)</code> retrieves the integer indication of the cell (x,y) (or 9999 if there is no indication).
ta: <code>getIndication(x,y,i)</code> retrieves the முழு எண் indication of the கலன் (x,y) (or 9999 if there is இல்லை indication).

source: It has to be noted that it is not possible to build a wall on the bottom edge or on the right edge of a cell. Therefore when such wall exists, it means it was built on a sibling cells -- as a top (respectively left) wall on the cell that is located below (respectively at the right of) the current cell.
ta: It has பெறுநர் be noted that it is not possible பெறுநர் உருவாக்கு a wall on the கீழே edge or on the வலது edge of a cell. Therefore when such wall exists, it means it was built on a sibling cells -- அச் a மேலே (respectively left) wall on the கலன் that is located below (respectively at the வலது of) the மின்னோட்ட்ம், ஓட்டம் cell.

source: Your buggle should first write the distance to the exit on each cell (or at least the useful ones).
ta: Your buggle should first write the distance பெறுநர் the exit on each கலன் (or at least the useful ones).

source: For that, find the exit and write 0 there. Then, write 1 on every neighboring cells that is not separated from the exit with a wall. And then mark every cells from which you can reach the exit in 2 steps, and iterate for all cells until all cells are marked.
ta: க்கு that, கண்டுபிடி the exit and write 0 there. Then, write 1 on every neighboring cells that is not separated இருந்து the exit with a wall. And then mark every cells இருந்து which you can reach the exit in 2 steps, and iterate க்கு அனைத்தும் cells until அனைத்தும் cells அரே marked.

source: Once the cells are marked, get your jedi buggle to follow the shortest path. Basically the buggle has only to walk on each case with the lesser distance from the exit. You can use the method <code>setDirection(direction)</code> to make your buggle look at the specific direction such as <code>[!scala|java|python]Direction.[/!]NORTH</code> or <code>[!scala|java|python]Direction.[/!]EAST</code>.
ta: Once the cells அரே marked, get your jedi buggle பெறுநர் follow the shortest path. Basically the buggle has only பெறுநர் walk on each case with the lesser distance இருந்து the exit. You can use the method <code>setDirection(direction)</code> பெறுநர் make your buggle look at the specific direction such அச் <code>[!scala|java|python]Direction.[/!]NORTH</code> or <code>[!scala|java|python]Direction.[/!]EAST</code>.

source: Finding the walls to follow
ta: Finding the walls பெறுநர் follow

source: This is exactly the same maze than before, but the buggle does not start at the same location. In particular, it does not have any wall to its left at the beginning.
ta: This is exactly the same maze than before, but the buggle does not தொடங்கு at the same location. In particular, it does not have any wall பெறுநர் its இடது at the beginning.

source: As a result, the method you wrote for the previous exercise probably don't work for this one. If you use it here with no modification, your buggle probably start looping over the four free cells around its start position (if that's not the case, well, you didn't really stick to the mission on previous exercise. Feel lucky and proceed to the next :)
ta: அச் a result, the method you wrote க்கு the previous exercise probably don't வேலை க்கு this one. If you use it here with இல்லை modification, your buggle probably தொடங்கு looping வீச்சலகு the நான்கு, நாலடி, நான்கடி free cells around its தொடங்கு position (if that's not the case, well, you didn't really stick பெறுநர் the mission on previous exercise. Feel lucky and proceed பெறுநர் the அடுத்தது :)

source: This is because your <code>keepHandOnSideWall()</code> method has an implicit <b>pre-condition</b>: it works well if and only if the buggle has a wall to its left when you call it. Such pre-condition are very heavily used when programming. Specifying them explicitly helps understanding the code written by other, and they even allow sometimes to prove that the code works correctly.
ta: This is because your <code>keepHandOnSideWall()</code> method has an implicit <b>pre-condition</b>: it works well if and only if the buggle has a wall பெறுநர் its இடது when you call it. Such pre-condition அரே very heavily used when programming. Specifying them explicitly helps understanding the குறியீடு written by other, and they இரட்டை allow sometimes பெறுநர் prove that the குறியீடு works correctly.

source: Fixing the problem should be very easy. Simply make sure that the pre-condition of <code>keepHandOnSideWall()</code> is verified before calling it. For that, update your code to first look for a wall on its left before the big <code>while</code> loop.
ta: Fixing the problem should be very easy. Simply make sure that the pre-condition of <code>keepHandOnSideWall()</code> is verified before calling it. க்கு that, புதுப்பிப்பு your குறியீடு பெறுநர் first look க்கு a wall on its இடது before the big <code>while</code> loop.

source: This universe introduces a little programming puzzle which can somehow be used to introduce programmation to non-reading kids since it is programmed graphically. The goal of each board is to light up all the lights. Your robot understands the following orders:
ta: This அண்டம் introduces a little programming puzzle which can somehow be used பெறுநர் introduce programmation பெறுநர் non-reading kids since it is programmed graphically. The goal of each board is பெறுநர் light மேலே அனைத்தும் the lights. Your robot understands the following orders:

source: Cannot be done if the destination cell is of another height than source cell
ta: Cannot be முடிந்தது if the destination கலன் is of another height than மூலம் கலன்

source: Can only be done if the destination cell is one step higher than source cell, or if destination is lower than source. Cannot be used for plain moves.
ta: Can only be முடிந்தது if the destination கலன் is one படி higher than மூலம் cell, or if destination is lower than source. Cannot be used க்கு plain moves.

source: Turn it on if it was off, and off if it was on. No effect if the cell does not contain any light.
ta: Turn it on if it was off, and அணை if it was on. இல்லை விளைவு if the கலன் does not contain any light.

source: <b>Call function 1</b>.
ta: <b>Call சார்பு 1</b>.

source: <b>Call function 2</b>.
ta: <b>Call சார்பு 2</b>.

source: Please note that this world is not completely suited to small kids since the main difficulty comes from the fact that your are highly limited in the amount of instructions you can give to your robot. Advanced levels thus require to write sound functions, and are often above the capacities of small kids.
ta: Please குறிப்பு that this world is not completely suited பெறுநர் small kids since the main difficulty comes இருந்து the fact that your அரே highly limited in the amount of instructions you can give பெறுநர் your robot. மேம்பட்ட levels thus require பெறுநர் write sound functions, and அரே often above the capacities of small kids.

source: This game is heavily inspirated from a flash game of the same name, which can for example be played on kongregate.com. It was written by Danny Yaroslavski (Coolio-Niato), the original idea being of Matt Chase.
ta: This game is heavily inspirated இருந்து a flash game of the same name, which can க்கு example be played on kongregate.com. It was written by Danny Yaroslavski (Coolio-Niato), the original idea being of Matt Chase.

source: This lesson introduces a little programming puzzle inspired from a flash game.
ta: This பாடம் introduces a little programming puzzle inspired இருந்து a flash game.

source: See the <i>About this world</i> dialog for more details.
ta: See the <i>About this world</i> dialog க்கு more details.

source: This lesson constitutes a little brain teaser for programmers. You have to instruct your robot to turn off all lights. The trick is that you program your robot graphically, and that you are limited in the amount of instructions.
ta: This பாடம் constitutes a little brain teaser க்கு programmers. You have பெறுநர் instruct your robot பெறுநர் turn அணை அனைத்தும் lights. The trick is that you திட்டம் your robot graphically, and that you அரே limited in the amount of instructions.

source: No previous experience is expected to take this lesson.
ta: இல்லை previous experience is expected பெறுநர் take this lesson.

source: Welcome to the lightbot world. This is merely a programmer puzzle rather than a real lesson (although some use it to teach programming). The robot is not programmed in Java, but rather graphically. You can see the existing orders in the documentation using the <i>About this world</i> menu.
ta: Welcome பெறுநர் the lightbot world. This is merely a நிரலி (device), நிரலர் (person) puzzle rather than a real பாடம் (although some use it பெறுநர் teach programming). The robot is not programmed in Java, but rather graphically. You can see the existing orders in the ஆவணப்படுத்துதல் using the <i>About this world</i> menu.

source: The goal of each board is simply to switch on every lights of the board using your little robot.
ta: The goal of each board is simply பெறுநர் ஆளி, நிலைமாறி on every lights of the board using your little robot.

source: This is a introduction exercise, which should be solvable by only moving forward and switching the light, using respectively
ta: This is a அறிமுகம் exercise, which should be solvable by only moving forward and switching the light, using respectively

source: Now, you probably need to turn in addition (using
ta: Now, you probably need பெறுநர் turn in கூட்டல் (using

source: Jump
ta: தாவு

source: You can also jump using
ta: You can also தாவு using

source: to pass obstacles. You can either jump one level up or any amount of levels down, but you cannot jump to go on a cell of the same height.
ta: பெறுநர் கணவாய் obstacles. You can either தாவு one நிலை மேலே or any amount of levels down, but you cannot தாவு பெறுநர் go on a கலன் of the same height.

source: Can you pass these stairs?
ta: Can you கணவாய் these stairs?

source: to call respectively the first and second functions. Define their code in their own tab.
ta: பெறுநர் call respectively the first and second functions. Define their குறியீடு in their own tab.

source: This is great if you get out of space in your main function
ta: This is great if you get out of இடைவெளி in your main சார்பு

source: Repetitive tasks
ta: Repetitive பணிகள்

source: Functions are also of great use for repetitive tasks
ta: செயல்பாடுகள் அரே also of great use க்கு repetitive பணிகள்

source: Calling functions from functions
ta: Calling செயல்பாடுகள் இருந்து செயல்பாடுகள்

source: It is perfectly okay to call a function from within a function!
ta: It is perfectly okay பெறுநர் call a சார்பு இருந்து within a function!

source: Ready to climb the wall?
ta: Ready பெறுநர் climb the wall?

source: You now have to surf these waves of lamps.
ta: You now have பெறுநர் surf these waves of lamps.

source: Close to 10
ta: மூடு பெறுநர் 10

source: Given 2 int values, return whichever value is nearest to the value 10, or return 0 in the event of a tie. [!java|scala]Note that Math.abs(n) returns the absolute value of a number.[/!] [!python]Note that math.fabs(n) returns the absolute value of a number. This function can only be used if you imported the math module.[/!]
ta: Given 2 int values, return whichever மதிப்பு is nearest பெறுநர் the மதிப்பு 10, or return 0 in the event of a tie. [!java|scala]Note that Math.abs(n) returns the தனி, சார்பிலா மதிப்பு of a number.[/!] [!python]Note that math.fabs(n) returns the தனி, சார்பிலா மதிப்பு of a number. This சார்பு can only be used if you imported the math module.[/!]
