Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: This problem is now famous because Bill Gates authored (with C. Papadimitriou) his only scientific publication in 1979 on this topic, providing a faster algorithm and proving that <code>17n/16 ≤ f(n) ≤ (5n+5)/3</code>. This was the only publication of Bill Gates before he invented Windows and became rich.
ta: This problem is now famous because சட்டகம் Gates authored (with C. Papadimitriou) his only scientific publication in 1979 on this topic, providing a faster படிமுறை and proving that <code>17n/16 ≤ f(n) ≤ (5n+5)/3</code>. This was the only publication of சட்டகம் Gates before he invented சாளரங்கள் and became rich.

source: Then, David X. Cohen, the inventor of the Futurama comics with many mathematical references, introduced the variant with burnt pancakes and studied its complexity with Manuel Blum in 1993.
ta: Then, David ஃச். Cohen, the inventor of the Futurama comics with many mathematical references, introduced the variant with burnt pancakes and studied its complexity with Manuel Blum in 1993.

source: An article of 2011 (by L. Bulteau, G. Fertin and I. Rusu) proved that determining the minimal amount of flips to sort the stack is a NP-complete problem. Naturally, the stack sorting problem is not NP-complete since it can be solved in 2n-3 steps with the naive algorithm and (5n+5)/3 steps with the Gates algorithm. That's determining the minimal amount of steps that is NP.
ta: An article of 2011 (by L. Bulteau, G. Fertin and I. Rusu) proved that determining the minimal amount of flips பெறுநர் வரிசைப்படுத்து the stack is a NP-complete problem. Naturally, the stack sorting problem is not NP-complete since it can be solved in 2n-3 படிகள் with the naive படிமுறை and (5n+5)/3 படிகள் with the Gates algorithm. That's determining the minimal amount of படிகள் that is NP.

source: Further information can be found on the wikipedia page, as usual.
ta: Further செய்தி can be found on the wikipedia page, அச் usual.

source: This activity is also integrated to CSIRL (my repository of <i>free</i> unplugged activities to introduce computer science, available at http://www.loria.fr/~quinson/Mediation/SMN/), and it may be interesting to run the unplugged activities before implementing these algorithms in PLM.
ta: This செய்கைப்பாடு is also integrated பெறுநர் CSIRL (my களஞ்சியம் of <i>free</i> unplugged activities பெறுநர் introduce கணிப்பொறி, கணிணி science, available at http://www.loria.fr/~quinson/Mediation/SMN/), and it சி-வைகாசி be interesting பெறுநர் ஓடு the unplugged activities before implementing these algorithms in PLM.

source: A temporal view similar to the sorting universe could be helpful
ta: A temporal பார்வை similar பெறுநர் the sorting அண்டம் could be helpful

source: Other exercises, for example on the Roti sorting, with a pile of Roti that have to touch the grill on each face (see http://en.wikipedia.org/wiki/Pancake_sorting#The_identical_pancake_stack).
ta: மற்றொன்று exercises, க்கு example on the Roti sorting, with a pile of Roti that have பெறுநர் touch the grill on each face (see http://en.wikipedia.org/wiki/Pancake_sorting#The_identical_pancake_stack).

source: Help the poor psychorigid pancakes' chef to sort its pancake stack!
ta: உதவி the poor psychorigid pancakes' chef பெறுநர் வரிசைப்படுத்து its pancake stack!

source: This funny problem leads to algorithms that are somewhat more challenging to implement. You are supposed to master the bases of programming and some sorting algorithms to take this lesson.
ta: This funny problem இழுதுகள் பெறுநர் algorithms that அரே somewhat more challenging பெறுநர் implement. You அரே supposed பெறுநர் master the bases of programming and some sorting algorithms பெறுநர் take this lesson.

source: The pancake sorting problem is a simple puzzle where you have a set of pancakes, each of differing size. The chef cooking the pancake is a bit psychorigid: he hates when the pancakes are not correctly sorted on the plate. He loves when they are correctly ordered, with the small ones over the larger ones. As every pancake maker, he masters the pancake flipping with his spatula. He can flip the pancake on top of the stack, or even several pancakes at once. The thing is that he has only one plate and the table is too dirty to place pancakes on it, even temporary. The only allowed operation is to flip some pancakes that are on top of the stack.
ta: The pancake sorting problem is a simple puzzle where you have a கணம் of pancakes, each of differing size. The chef cooking the pancake is a துணுக்கு psychorigid: he hates when the pancakes அரே not correctly sorted on the plate. He loves when they அரே correctly ordered, with the small ones வீச்சலகு the larger ones. அச் every pancake maker, he masters the pancake flipping with his spatula. He can flip the pancake on மேலே of the stack, or இரட்டை several pancakes at once. The thing is that he has only one plate and the table is too dirty பெறுநர் place pancakes on it, இரட்டை temporary. The only allowed செயல்பாடு is பெறுநர் flip some pancakes that அரே on மேலே of the stack.

source: Your work is to help this poor guy sorting his stack by flipping the pancakes. Each pancake is defined by its radius and rank within the stack, with the top-most pancake is at rank 0, and the one below at rank 1.
ta: Your வேலை is பெறுநர் உதவி this poor guy sorting his stack by flipping the pancakes. Each pancake is defined by its ஆரம் and rank within the stack, with the top-most pancake is at rank 0, and the one below at rank 1.

source: Note that you can play physically with pieces of paper or wood at first to get the grasp on this problem. This is even one of the activities that I use in my CS-IRL (computer science in real life) project to introduce the concept of algorithm to absolute beginners that wonder about our science. More information at http://www.loria.fr/~quinson/Mediation/SMN/ (in French).
ta: குறிப்பு that you can play physically with pieces of paper or மரம் at first பெறுநர் get the grasp on this problem. This is இரட்டை one of the activities that I use in my CS-IRL (computer science in real life) திட்டம் பெறுநர் introduce the concept of படிமுறை பெறுநர் தனி, சார்பிலா beginners that wonder பற்றி our science. More செய்தி at http://www.loria.fr/~quinson/Mediation/SMN/ (in French).

source: You should try to first move the largest pancake to the bottom, and then the largest but one pancake on top of it, and then the one just smaller on top, and so on.
ta: You should try பெறுநர் first move the largest pancake பெறுநர் the bottom, and then the largest but one pancake on மேலே of it, and then the one just smaller on top, and so on.

source: So first, you need to move the largest pancake at the bottom of the stack.
ta: So first, you need பெறுநர் move the largest pancake at the கீழே of the stack.

source: Can you imagine a situation in which you can easily bring this damn large pancake to the bottom?
ta: Can you imagine a situation in which you can easily bring this damn large pancake பெறுநர் the bottom?

source: How could you reach this situation from the current one?
ta: How could you reach this situation இருந்து the மின்னோட்ட்ம், ஓட்டம் one?

source: This problem is similar to the previous: you have to sort the pancakes, the smallest at the top and the biggest at the bottom, except you can only flip them to sort.
ta: This problem is similar பெறுநர் the previous: you have பெறுநர் வரிசைப்படுத்து the pancakes, the smallest at the மேலே and the biggest at the bottom, except you can only flip them பெறுநர் sort.

source: The purpose here is to sort them using the bubble algorithm, where one pancake is moved to the bottom until it encounters a bigger one. In graphical representations, it looks like a bubble takes the element and move them through the pile. This is where its name comes from.
ta: The purpose here is பெறுநர் வரிசைப்படுத்து them using the bubble algorithm, where one pancake is moved பெறுநர் the கீழே until it encounters a bigger one. In graphical representations, it looks like a bubble takes the தனிமம் and move them through the pile. This is where its பெயர் comes from.

source: Now, using pancakes makes it a little more difficult to write, because you have to find a way to swap only two pancakes at a time.
ta: Now, using pancakes makes it a little more difficult பெறுநர் write, because you have பெறுநர் கண்டுபிடி a way பெறுநர் swap only two pancakes at a time.

source: The bubble algorithm consists in browsing the whole pile from top to bottom, and making a comparision between two pancakes. Each time the top pancake is bigger than the one below, you have to swap them, then compare the bigger pancake you just swapped with one below, and so on. You have to browse through the entire pile until no swap has occurred, in which case the pile is sorted.
ta: The bubble படிமுறை consists in browsing the whole pile இருந்து மேலே பெறுநர் bottom, and making a comparision between two pancakes. Each time the மேலே pancake is bigger than the one below, you have பெறுநர் swap them, then compare the bigger pancake you just swapped with one below, and so on. You have பெறுநர் browse through the entire pile until இல்லை swap has occurred, in which case the pile is sorted.

source: If you don't understand the basic bubble sorting algorithm, you should try the exercises within the “Sorting algorithms” lesson. If you do, but can't figure a way to swap only two pancakes at a time, think of a situation where only two pancakes are swapped at a time, and find a way to reach that situation.
ta: If you don't understand the அடிப்படை bubble sorting algorithm, you should try the exercises within the “Sorting algorithms” lesson. If you do, but can't figure a way பெறுநர் swap only two pancakes at a time, think of a situation where only two pancakes அரே swapped at a time, and கண்டுபிடி a way பெறுநர் reach that situation.

source: Hard blow for the chef! The pancakes got burnt on one side! There is no way he can deliver a stack of pancakes with visibly burnt pancakes! You've got to help him ensuring that no pancake is upside-down while sorting his stack.
ta: Hard blow க்கு the chef! The pancakes got burnt on one side! There is இல்லை way he can deliver a stack of pancakes with visibly burnt pancakes! You've got பெறுநர் உதவி him ensuring that இல்லை pancake is upside-down while sorting his stack.

source: Unlike others sorting problem, the expensive operation is not the comparison of values, but the flipping of pancakes. In this exercise, we will explore another algorithm that attempt to reduce the amount of stack flipping. The funny side is that this algorithm was first introduced by Bill Gates, before invented Windows.
ta: Unlike others sorting problem, the expensive செயல்பாடு is not the comparison of values, but the flipping of pancakes. In this exercise, we will explore another படிமுறை that attempt பெறுநர் reduce the amount of stack flipping. The funny பக்கம் is that this படிமுறை was first introduced by சட்டகம் Gates, before invented Windows.

source: The basic idea is to grow sequences of sorted pancakes, not necessarily starting from the bottom. We say that a sequence of ordered pancakes constitute a <b>block</b> while a pancake that is not part of a block is said to be <b>free</b>. The algorithm then considers the topmost pancake (of radius <code>t</code>) and search for the <code>t+1</code> or <code>t-1</code> pancakes (the considered neighbor is noted <code>t+o</code>). Eight cases may happen:
ta: The அடிப்படை idea is பெறுநர் grow வரிசைகள் of sorted pancakes, not necessarily starting இருந்து the bottom. We say that a வரிசை of ordered pancakes constitute a <b>block</b> while a pancake that is not பகுதி of a block is said பெறுநர் be <b>free</b>. The படிமுறை then considers the topmost pancake (of ஆரம் <code>t</code>) and தேடல் க்கு the <code>t+1</code> or <code>t-1</code> pancakes (the considered neighbor is noted <code>t+o</code>). Eight cases சி-வைகாசி happen:

source: <b>Case a</b>: Both <code>t</code> and <code>t+o</code> are free. They are then merged in one flip.
ta: <b>Case a</b>: Both <code>t</code> and <code>t+o</code> அரே free. They அரே then merged in one flip.

source: <b>Case b</b>: <code>t</code> is free, and <code>t+o</code> is the first of a block. They are merged in one flip.
ta: <b>Case b</b>: <code>t</code> is free, and <code>t+o</code> is the first of a block. They அரே merged in one flip.

source: <b>Case c</b>: <code>t</code> is free but both <code>t-1</code> and <code>t+1</code> are the last elements of blocks. Both blocks and <code>t</code> are merged all together in 4 flips. Beware, if either <code>t-1</code> or <code>t+1</code> does not exist (because <code>t</code> is 0 or max), only two flips are mandated.
ta: <b>Case c</b>: <code>t</code> is free but both <code>t-1</code> and <code>t+1</code> அரே the last elements of blocks. Both தொகுதிகள் and <code>t</code> அரே merged அனைத்தும் together in 4 flips. Beware, if either <code>t-1</code> or <code>t+1</code> does not exist (because <code>t</code> is 0 or max), only two flips அரே mandated.

source: <b>Case d</b>: <code>t</code> is in a block but <code>t+o</code> is free. They are merged in one flip.
ta: <b>Case d</b>: <code>t</code> is in a block but <code>t+o</code> is free. They அரே merged in one flip.

source: <b>Case e</b>: <code>t</code> is in a block and <code>t+o</code> is the first element of a block. They are merged in one flip.
ta: <b>Case e</b>: <code>t</code> is in a block and <code>t+o</code> is the first தனிமம் of a block. They அரே merged in one flip.

source: <b>Case f</b>: <code>t</code> is in a block and <code>t+o</code> is the last element of another block. They are merged in 3 flips as follows.
ta: <b>Case f</b>: <code>t</code> is in a block and <code>t+o</code> is the last தனிமம் of another block. They அரே merged in 3 flips அச் follows.

source: <b>Case g</b>: <code>t</code> is in a block of length k+1 (the last element is <code>t+ko</code>), <code>t+(k+1)o</code> is either free or the last element of another block. Both blocks are merged in 2 flips:
ta: <b>Case g</b>: <code>t</code> is in a block of length k+1 (the last தனிமம் is <code>t+ko</code>), <code>t+(k+1)o</code> is either free or the last தனிமம் of another block. Both தொகுதிகள் அரே merged in 2 flips:

source: <b>Case h</b>: <code>t</code> is in a block of length k+1 (the last element is <code>t+ko</code>), <code>t+(k+1)o</code> is the first element of another block (the difference with case g is that <code>t+(k+1)o</code> is now the <i>first</i> element of its block). Both blocks are merged in 2 flips:
ta: <b>Case h</b>: <code>t</code> is in a block of length k+1 (the last தனிமம் is <code>t+ko</code>), <code>t+(k+1)o</code> is the first தனிமம் of another block (the வேறுபாடு with case g is that <code>t+(k+1)o</code> is now the <i>first</i> தனிமம் of its block). Both தொகுதிகள் அரே merged in 2 flips:

source: <b>Case i</b>: <code>t</code> is in a block of length <code>n</code> (this block contains all pancakes). If <code>t</code> is not 1, the whole stack is fliped. The algorithm then stops.
ta: <b>Case i</b>: <code>t</code> is in a block of length <code>n</code> (this block contains அனைத்தும் pancakes). If <code>t</code> is not 1, the whole stack is fliped. The படிமுறை then stops.

source: Each iteration increases the size of the blocks, so the algorithm eventually halts in all cases. A finer analysis would show that it takes at most <code>(5n+5)/3</code> steps to sort the stack. That's better than the naïve algorithm, that requires 2n-3 steps.
ta: Each மறுசெய்கை increases the அளவு of the blocks, so the படிமுறை eventually halts in அனைத்தும் cases. A finer பகுப்பாய்வு would காட்டு that it takes at பெரும்பாலானவை <code>(5n+5)/3</code> படிகள் பெறுநர் வரிசைப்படுத்து the stack. That's better than the naïve algorithm, that requires 2n-3 steps.

source: You now have almost enough information to implement this algorithm on your own. We just have to remove the last remaining ambiguities to ensure that you implement exactly the same algorithm that the correction. If several cases apply to your situation, then you should use the first given one. For example, if both cases a and b apply (e.g., with <code>t-1</code> on case <b>a</b> and <code>t+1</code> on case <b>b</b>), then you should apply the flips of case <b>a</b>. If a given case applies for both <code>t+1</code> and <code>t-1</code>, then you should apply it to <code>t+1</code>.
ta: You now have almost enough செய்தி பெறுநர் implement this படிமுறை on your own. We just have பெறுநர் அகற்று the last remaining ambiguities பெறுநர் ensure that you implement exactly the same படிமுறை that the correction. If several cases இடு பெறுநர் your situation, then you should use the first given one. க்கு example, if both cases a and b இடு (e.g., with <code>t-1</code> on case <b>a</b> and <code>t+1</code> on case <b>b</b>), then you should இடு the flips of case <b>a</b>. If a given case applies க்கு both <code>t+1</code> and <code>t-1</code>, then you should இடு it பெறுநர் <code>t+1</code>.

source: Note that it is somehow harder than the other exercises we did so far, so don't be surprised if you need more time to achieve this. But do not give up hope, you can do it!
ta: குறிப்பு that it is somehow harder than the மற்றொன்று exercises we did so far, so don't be surprised if you need more time பெறுநர் achieve this. But do not give மேலே hope, you can do it!

source: Well, I need some help to start.
ta: Well, I need some உதவி பெறுநர் start.

source: First write some helper functions such as <code>isFirst()</code> or <code>isFree()</code>. This will simplify your main algorithm afterward, that can be written very similarly to the explication above with a bunch of if conditions. Factorizing code this way often helps making your code more readable.
ta: First write some helper செயல்பாடுகள் such அச் <code>isFirst()</code> or <code>isFree()</code>. This will simplify your main படிமுறை afterward, that can be written very similarly பெறுநர் the explication above with a bunch of if conditions. Factorizing குறியீடு this way often helps making your குறியீடு more readable.

source: My code keeps failing and I don't know how to debug it.
ta: My குறியீடு keeps failing and I don't know how பெறுநர் debug it.

source: To debug one world after the other and avoid that the messages of all worlds get intermixed, you can write your debug function only if the method <code>isSelected()</code> returns true. It will be so only for the entity that is currently selected in the graphical interface, that is probably the world you are currently debugging. This will help breaking the difficulty in parts by debugging the situation one after the other.
ta: பெறுநர் debug one world after the மற்றொன்று and avoid that the செய்திகள் of அனைத்தும் worlds get intermixed, you can write your debug சார்பு only if the method <code>isSelected()</code> returns true. It will be so only க்கு the உருபொருள் that is currently தேர்ந்தெடுக்கப்பட்டது in the graphical interface, that is probably the world you அரே currently debugging. This will உதவி breaking the difficulty in பாகங்கள் by debugging the situation one after the other.

source: In particular, it may help to print textually the state of the world each time you enter the main loop.
ta: In particular, it சி-வைகாசி உதவி பெறுநர் அச்சிடுக textually the state of the world each time you enter the main loop.

source: The Gates' algorithm that we saw in the previous exercise quickly sort a stack of unburned pancakes by increasing the size of the blocks of sorted pancakes. This is much faster that the naive algorithm which moves at each step the largest pancake to the bottom of still unsorted pancakes. Gates' algorithm manages to sort a stack of <i>n</i> pancakes in less than <i>(5n + 5)/3</i> steps in the worst case, while the naive algorithm requires at most <i>2n</i> steps. Gates is thus about one third faster in the worst case.
ta: The Gates' படிமுறை that we saw in the previous exercise quickly வரிசைப்படுத்து a stack of unburned pancakes by increasing the அளவு of the தொகுதிகள் of sorted pancakes. This is much faster that the naive படிமுறை which moves at each படி the largest pancake பெறுநர் the கீழே of still unsorted pancakes. Gates' படிமுறை manages பெறுநர் வரிசைப்படுத்து a stack of <i>n</i> pancakes in less than <i>(5n + 5)/3</i> படிகள் in the worst case, while the naive படிமுறை requires at பெரும்பாலானவை <i>2n</i> steps. Gates is thus பற்றி one third faster in the worst case.

source: In this exercise, we will explore an adaptation of the same idea to burnt pancakes. This was first published by David X. Cohen and Manuel Blum. David Cohen co-founded a few years later the Futurama TV show full of mathematical jokes. Definitively, interesting people studied that little pancake problem...
ta: In this exercise, we will explore an adaptation of the same idea பெறுநர் burnt pancakes. This was first published by David ஃச். Cohen and Manuel Blum. David Cohen co-founded a few years later the Futurama TV காட்டு full of mathematical jokes. Definitively, interesting people studied that little pancake problem...

source: The Cohen's algorithm is slightly easier than the Gates' one since it distinguishes less cases:
ta: The Cohen's படிமுறை is slightly easier than the Gates' one since it distinguishes less cases:

source: <b>Case 1:</b> At least one pancake is rightside up in the stack. Let <i>p</i> be the largest such pancake. Note that <i>p + 1</i> must therefore be upside down, unless <i>p = n</i> (in which case there is no <i>p + 1</i> pancake).
ta: <b>Case 1:</b> At least one pancake is rightside மேலே in the stack. Let <i>p</i> be the largest such pancake. குறிப்பு that <i>p + 1</i> must therefore be upside down, unless <i>p = n</i> (in which case there is இல்லை <i>p + 1</i> pancake).

source: <b>Case 1.c:</b> There is no <i>p+1</i> because <i>p</i> is the largest pancake in stack, that is because <i>p = n</i>. If pancake <i>p</i> is already in position, there is nothing to do. If not, you can move it to the bottom of the stack in 2 flips:
ta: <b>Case 1.c:</b> There is இல்லை <i>p+1</i> because <i>p</i> is the largest pancake in stack, that is because <i>p = n</i>. If pancake <i>p</i> is already in position, there is nothing பெறுநர் do. If not, you can move it பெறுநர் the கீழே of the stack in 2 flips:

source: <b>The trick is that the pancake <i>p</i> should never be considered again.</b> Otherwise, you will consider that pancake again and again since it's rightside up, and since that's the largest pancake. To leave that pancake alone, you should keep track of the stack size that is still to be sorted. Any traversal of the stack must then only consider these pancakes, leaving alone the ones that are already in position at the bottom of the stack.
ta: <b>The trick is that the pancake <i>p</i> should ஒருபோதும் be considered again.</b> Otherwise, you will consider that pancake again and again since it's rightside up, and since that's the largest pancake. பெறுநர் leave that pancake alone, you should keep மின்தடம் of the stack அளவு that is still பெறுநர் be sorted. Any traversal of the stack must then only consider these pancakes, leaving alone the ones that அரே already in position at the கீழே of the stack.

source: <b>Case 2:</b> All pancakes are downside. Again, we distinguish two sub-cases.
ta: <b>Case 2:</b> அனைத்தும் pancakes அரே downside. Again, we distinguish two sub-cases.

source: <b>Case 2.a:</b> There is at least one <i>p</i> for which <i>p+1</i> is higher than <i>p</i> (if there is several such <i>p</i>, take the largest one).
ta: <b>Case 2.a:</b> There is at least one <i>p</i> க்கு which <i>p+1</i> is higher than <i>p</i> (if there is several such <i>p</i>, take the largest one).
