Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: In [!thelang], the blocks of code are [!java|scala|c]enclosed between curly brackets: a { sign opens the block, while a } sign closes it. White spaces are not important[/!][!java|c].[/!][!scala], provided that your instructions are still separated with a semi-column or an end of line.[/!] [!java|scala|c]It is still very important to correctly indent your code to keep it readable.[/!] [!python]marked by the indentation: every lines that are a bit shifted to the right with white spaces belong to the block. Quite often, people use 4 spaces for indentation, but it works if you use more or less spaces. Simply, any lines of the block must use the same amount of spaces. The end of Python code blocks are not marked by any specific char. Indenting lines starts a block and unindenting ends it. Do not forget the colon (:) at the end of the <code>if</code> line, python needs it to know that a new block begins. The fact that python relies on indentation to delimit blocks is a very good property for beginners: it will force you to adhere to strict code presentation standards.[/!] It is very easy to get lost in your own code if it's not properly indented, so you want to clean it up so that working on your code remains pleasant and productive.
ta: In [!thelang], the தொகுதிகள் of குறியீடு அரே [!java|scala|c]enclosed between curly brackets: a { sign திறப்புகள் the block, while a } sign closes it. வெள்ளை இடங்கள் அரே not important[/!][!java|c].[/!][!scala], provided that your instructions அரே still separated with a semi-column or an end of line.[/!] [!java|scala|c]It is still very important பெறுநர் correctly indent your குறியீடு பெறுநர் keep it readable.[/!] [!python]marked by the indentation: every வரிகள் that அரே a துணுக்கு shifted பெறுநர் the வலது with வெள்ளை இடங்கள் belong பெறுநர் the block. Quite often, people use 4 இடங்கள் க்கு indentation, but it works if you use more or less spaces. Simply, any வரிகள் of the block must use the same amount of spaces. The end of பைதான் குறியீடு தொகுதிகள் அரே not marked by any specific char. Indenting வரிகள் starts a block and unindenting ends it. Do not forget the பெருங்குடல் (:) at the end of the <code>if</code> line, பைதான் needs it பெறுநர் know that a புதிய block begins. The fact that பைதான் relies on உள்தள்ளல் பெறுநர் delimit தொகுதிகள் is a very good property க்கு beginners: it will force you பெறுநர் adhere பெறுநர் strict குறியீடு presentation standards.[/!] It is very easy பெறுநர் get lost in your own குறியீடு if it's not properly indented, so you want பெறுநர் clean it மேலே so that working on your குறியீடு remains pleasant and productive.

source: All indentations of a given block must be consistent, and it is not possible to cut a block. The two following codes are incorrect and will raise errors.
ta: அனைத்தும் indentations of a given block must be consistent, and it is not possible பெறுநர் வெட்டு a block. The two following codes அரே incorrect and will raise errors.

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># one space too much </span> <b>whatToDoAnyway()</b>
ta: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># one இடைவெளி too much </span> <b>whatToDoAnyway()</b>

source: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> <b>whatToDoAnyway()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># this block is not hanging to a condition line</span>
ta: if <b>condition</b>: &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDo()</b> <b>whatToDoAnyway()</b> &nbsp;&nbsp;&nbsp;&nbsp;<b>whatToDoNext()</b> <span class="comment"># this block is not hanging பெறுநர் a condition line</span>

source: The condition must be a <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> expression. The inner block of code will get executed if the expression is evaluated to <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> and it will be ignored if it is <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>. [!python|scala|java]<code>[!java|scala]true[/!][!python]True[/!]</code> and <code>[!java|scala]false[/!][!python]False[/!]</code> are constant values defined by [!thelang] directly, just as 0 or 1 in mathematics.[/!]
ta: The condition must be a <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> expression. The inner block of குறியீடு will get executed if the கோவை is evaluated பெறுநர் <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> and it will be ignored if it is <code>[!c]0[/!][!java|scala]false[/!][!python]False[/!]</code>. [!python|scala|java]<code>[!java|scala]true[/!][!python]True[/!]</code> and <code>[!java|scala]false[/!][!python]False[/!]</code> அரே மாறா, மாறிலி values defined by [!thelang] directly, just அச் 0 or 1 in mathematics.[/!]

source: The condition can be a <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> variable (we will come back on variables in a later exercise, don't worry) or an arithmetic test, such as <code>x == 5</code>, which checks whether the current value of <code>x</code> is 5, or such as <b>!=</b> (checking inequality, that is, returning [!c]1[/!][!java|scala]true[/!][!python]True[/!] only if the left-hand side is different from the right-hand side), <b>&lt;</b> (smaller than), <b>&gt;</b> (larger than), <b>&lt;=</b> (smaller or equal to), <b>&gt;=</b> (larger or equal to).
ta: The condition can be a <code>[!c]int[/!][!java]boolean[/!][!scala|python]Boolean[/!]</code> variable (we will come பின் on மாறிகள் in a later exercise, don't worry) or an arithmetic test, such அச் <code>x == 5</code>, which checks whether the மின்னோட்ட்ம், ஓட்டம் மதிப்பு of <code>x</code> is 5, or such அச் <b>!=</b> (checking inequality, that is, returning [!c]1[/!][!java|scala]true[/!][!python]True[/!] only if the left-hand பக்கம் is different இருந்து the right-hand side), <b>&lt;</b> (smaller than), <b>&gt;</b> (larger than), <b>&lt;=</b> (smaller or equal to), <b>&gt;=</b> (larger or equal to).

source: Beware of the classical trap, which consists in testing the equality of a variable using = instead of ==. Hopefully, the [!java|scala|c]compiler[/!][!python]interpreter[/!] detects this problem most of the time, but it could get trapped is some cases (such as when you are affecting a [!c]int[/!][!java|python|scala]boolean[/!] variable). So you'd better to be careful...
ta: Beware of the classical trap, which consists in testing the equality of a variable using = instead of ==. Hopefully, the [!java|scala|c]compiler[/!][!python]interpreter[/!] detects this problem பெரும்பாலானவை of the time, but it could get trapped is some cases (such அச் when you அரே affecting a [!c]int[/!][!java|python|scala]boolean[/!] variable). So you'd better பெறுநர் be careful...

source: The condition can also be a call to some particular methods returning a boolean. For example, the <code>isFacingWall()</code> method of the buggle returns [!c]1[/!][!java|python|scala]true[/!] if the buggle is facing a wall, and [!c]0[/!][!java|python|scala]false[/!] in the other case.
ta: The condition can also be a call பெறுநர் some particular முறைகள் returning a boolean. க்கு example, the <code>isFacingWall()</code> method of the buggle returns [!c]1[/!][!java|python|scala]true[/!] if the buggle is facing a wall, and [!c]0[/!][!java|python|scala]false[/!] in the மற்றொன்று case.

source: <code>cond1 [!java|scala|c]&&[/!][!python]and[/!] cond2</code> is true when <tt>cond1</tt> <b>and</b> <tt>cond2</tt> are both true (if <tt>cond1</tt> is false, <tt>cond2</tt> is not even evaluated as we already know that the conjunction of both propositions cannot be true).
ta: <code>cond1 [!java|scala|c]&&[/!][!python]and[/!] cond2</code> is true when <tt>cond1</tt> <b>and</b> <tt>cond2</tt> அரே both true (if <tt>cond1</tt> is false, <tt>cond2</tt> is not இரட்டை evaluated அச் we already know that the conjunction of both propositions cannot be true).

source: <code>cond1 [!java|scala|c]||[/!][!python]or[/!] cond2</code> is true if <tt>cond1</tt> <b>or</b> <tt>cond2</tt> is true (if <tt>cond1</tt> is true, <tt>cond2</tt> is not even evaluated as we already know that the disjunction of both propositions cannot be false).
ta: <code>cond1 [!java|scala|c]||[/!][!python]or[/!] cond2</code> is true if <tt>cond1</tt> <b>or</b> <tt>cond2</tt> is true (if <tt>cond1</tt> is true, <tt>cond2</tt> is not இரட்டை evaluated அச் we already know that the disjunction of both propositions cannot be false).

source: When the expression becomes complicated, it is better to add parenthesis to force the order of evaluation. Do not hesitate to add more parenthesis to remove any ambiguities that may appear in an expression.
ta: When the கோவை becomes complicated, it is better பெறுநர் கூட்டு parenthesis பெறுநர் force the order of evaluation. Do not hesitate பெறுநர் கூட்டு more parenthesis பெறுநர் அகற்று any ambiguities that சி-வைகாசி appear in an expression.

source: Last, it is possible to specify what to do when the condition is false using the following syntax. In this case, the instruction <code>whatToDoIfItsFalse</code> will be executed only if the condition is false.
ta: Last, it is possible பெறுநர் specify what பெறுநர் do when the condition is false using the following syntax. In this case, the instruction <code>whatToDoIfItsFalse</code> will be executed only if the condition is false.

source: Don't forget the colon (:) after the else, it is indicating that a new block is beginning.
ta: Don't forget the பெருங்குடல் (:) after the else, it is indicating that a புதிய block is beginning.

source: <a name="Objectives"/> If the buggle is facing a wall, you must move one step back. If not, you must move one step forward. To detect whether you are facing a wall, simply use the <code>isFacingWall()</code> built-in, that every buggle understands.
ta: <a name="Objectives"/> If the buggle is facing a wall, you must move one படி back. If not, you must move one படி forward. பெறுநர் detect whether you அரே facing a wall, simply use the <code>isFacingWall()</code> built-in, that every buggle understands.

source: This exercise is a bit different: your code has to work for several buggles, each of them being in a specific initial condition. The same code will be executed for each of them.
ta: This exercise is a துணுக்கு different: your குறியீடு has பெறுநர் வேலை க்கு several buggles, each of them being in a specific initial condition. The same குறியீடு will be executed க்கு each of them.

source: When your program works, move forward to the next exercise, that is hidden in a sub-tree of the selection window.
ta: When your திட்டம் works, move forward பெறுநர் the அடுத்தது exercise, that is hidden in a sub-tree of the தேர்வு window.

source: In addition to conditionals, another handy construction is the ability to repeat an action while a specific condition does not appear. A while loop is used for that, with the following syntax.
ta: In கூட்டல் பெறுநர் conditionals, another handy construction is the திறமை பெறுநர் repeat an செயல் while a specific condition does not appear. A while loop is used க்கு that, with the following syntax.

source: The inner bloc is then executed again and again, as long as the condition remains true. More specifically, the buggle tests the value of the condition. If it's false, it ignores the bloc and continue below. If it's true, it executes the bloc. After that, it tests the condition. If it's now false (for example because the moves of the block made us facing the wall), it now ignores the bloc and continue. If it's still true, it execute the bloc and reevaluate the condition. It does so as long as the condition remains true.
ta: The inner bloc is then executed again and again, அச் long அச் the condition remains true. More specifically, the buggle தேர்வுகள் the மதிப்பு of the condition. If it's false, it ignores the bloc and தொடரவும் below. If it's true, it executes the bloc. After that, it தேர்வுகள் the condition. If it's now false (for example because the moves of the block made us facing the wall), it now ignores the bloc and continue. If it's still true, it execute the bloc and reevaluate the condition. It does so அச் long அச் the condition remains true.

source: Naturally, if the chosen action does not modify the value of the condition, the buggle will do the action endlessly. The <b>stop</b> button of the interface becomes then handy. To test this, you can try to type the following code in the editor:
ta: Naturally, if the chosen செயல் does not modify the மதிப்பு of the condition, the buggle will do the செயல் endlessly. The <b>stop</b> button of the இடைமுகம் becomes then handy. பெறுநர் தேர்வு this, you can try பெறுநர் வகை the following குறியீடு in the ஆசிரியர்:

source: This will let the buggle turn left as long as <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> remains true (ie, endlessly), or until you stop it manually using the stop button.
ta: This will let the buggle turn இடது அச் long அச் <code>[!c]1[/!][!java|scala]true[/!][!python]True[/!]</code> remains true (ie, endlessly), or until you நிறுத்து it manually using the நிறுத்து button.

source: You now have to write some code so that your buggles move forward until they encounter a wall. The idea is thus to do something like:
ta: You now have பெறுநர் write some குறியீடு so that your buggles move forward until they encounter a wall. The idea is thus பெறுநர் do something like:

source: while we are not facing a wall, do: &nbsp;&nbsp;moveForward()
ta: while we அரே not facing a wall, do: &nbsp;&nbsp;moveForward()

source: Look at the documentation (in "Help/About this world") for the full list of buggles' methods.
ta: Look at the ஆவணப்படுத்துதல் (in "Help/About this world") க்கு the full பட்டியல் of buggles' methods.

source: The buggle world can sometimes contain some <i>baggles</i>, which are little biscuits that buggles can carry from one point to another. For that, they have to use specific methods such as <code>isOverBaggle(), isCarryingBaggle(), pickupBaggle()</code> or <code>dropBaggle()</code>. Check their documentation in "Help/About this world" for more details.
ta: The buggle world can sometimes contain some <i>baggles</i>, which அரே little biscuits that buggles can carry இருந்து one புள்ளியம் பெறுநர் another. க்கு that, they have பெறுநர் use specific முறைகள் such அச் <code>isOverBaggle(), isCarryingBaggle(), pickupBaggle()</code> or <code>dropBaggle()</code>. சரிபார் their ஆவணப்படுத்துதல் in "Help/About this world" க்கு more details.

source: Let each buggle find its baggle by adapting the code you wrote in previous exercise (copy/paste what you've done before if you want).
ta: Let each buggle கண்டுபிடி its baggle by adapting the குறியீடு you wrote in previous exercise (copy/paste what you've முடிந்தது before if you want).

source: The programs we wrote so far are missing a fundamental point in computing. Actually, it is all about processing <b>data</b> through specific <b>instructions</b>. In the buggle world, the main data are a bit hidden behind the graphical representation, but that's no reason to never manipulate some data explicitly.
ta: The திட்டங்கள் we wrote so far அரே missing a fundamental புள்ளியம் in computing. Actually, it is அனைத்தும் பற்றி processing <b>data</b> through specific <b>instructions</b>. In the buggle world, the main தகவல்கள் அரே a துணுக்கு hidden behind the graphical representation, but that's இல்லை reason பெறுநர் ஒருபோதும் manipulate some தகவல்கள் explicitly.

source: Data in [!thelang]
ta: தகவல்கள் in [!thelang]

source: In a program, you can use several <i>types</i> of data, such as integers or strings of chars. If you want to use a data several times, you need to store it within a <i>variable</i>, which is a memory cell containing a value: you put your data (say the value '5') in the variable (say 'length'), and you can retrieve it later when you need it. That's very similar to a box of label 'gift' in which you would put some stuff, like a bottle of perfume "Channel N°5".
ta: In a program, you can use several <i>types</i> of data, such அச் integers or சரங்கள் of chars. If you want பெறுநர் use a தகவல்கள் several times, you need பெறுநர் store it within a <i>variable</i>, which is a memory கலன் containing a value: you put your தகவல்கள் (say the மதிப்பு '5') in the variable (say 'length'), and you can retrieve it later when you need it. That's very similar பெறுநர் a box of சிட்டை 'gift' in which you would put some stuff, like a bottle of perfume "Channel N°5".

source: <b>Declaring</b> (ie, creating) a variable in [!thelang], is very simple. You just need to write [!java]its type, a space, and the variable name.[/!] [!scala]the <code>var</code> keyword, the variable name, a column (:) and the variable type an equal sign (=) and an initial value.[/!] [!python]the variable name, an equal sign (=) and an initial value.[/!] The variable name is the label to retrieve it afterward[!python].[/!] [!java|scala] while the type is the kind of data that this variable accepts to store.[/!] It is forbidden to use spaces in variable names. You can name a variable <code>stepAmount</code> if you want, but <code>step amount</code> is not a valid name.
ta: <b>Declaring</b> (ie, creating) a variable in [!thelang], is very simple. You just need பெறுநர் write [!java]its type, a space, and the variable name.[/!] [!scala]the <code>var</code> keyword, the variable name, a நெடுவரிசை (:) and the variable வகை an equal sign (=) and an initial value.[/!] [!python]the variable name, an equal sign (=) and an initial value.[/!] The variable பெயர் is the சிட்டை பெறுநர் retrieve it afterward[!python].[/!] [!java|scala] while the வகை is the kind of தகவல்கள் that this variable accepts பெறுநர் store.[/!] It is forbidden பெறுநர் use இடங்கள் in variable names. You can பெயர் a variable <code>stepAmount</code> if you want, but <code>step amount</code> is not a valid name.

source: So, to create a variable named <b>x</b> intended to contain integers, one should write:
ta: So, பெறுநர் create a variable named <b>x</b> intended பெறுநர் contain integers, one should எழுது:

source: If you want, you can specify the initial value of the variable by adding an equal sign (=) followed by the value after the declaration.
ta: If you want, you can specify the initial மதிப்பு of the variable by adding an equal sign (=) followed by the மதிப்பு after the declaration.

source: So, if you want that the variable contains 5 as initial value, you should type:
ta: So, if you want that the variable contains 5 அச் initial value, you should தட்டச்சு:

source: x = 5
ta: ஃச் = 5

source: So, to create a variable named <b>x</b> intended to contain integers with 42 as initial value, one should write:
ta: So, பெறுநர் create a variable named <b>x</b> intended பெறுநர் contain integers with 42 அச் initial value, one should எழுது:

source: In most cases, the compiler is able to guess the type of the variable from the initialization value, and you can omit it:
ta: In பெரும்பாலானவை cases, the தொகுப்பி is able பெறுநர் guess the வகை of the variable இருந்து the முன்னமைவு value, and you can omit it:

source: var x = 42
ta: var ஃச் = 42

source: You still have to specify if you use some generic values as an initialization, such as the very particular value <code>null</code>, which type happens to be ambiguous. Even when the type is clear, you can still specify it if you prefer. So you want that the variable contains 5 as initial value, you should type:
ta: You still have பெறுநர் specify if you use some generic values அச் an initialization, such அச் the very particular மதிப்பு <code>null</code>, which வகை happens பெறுநர் be ambiguous. இரட்டை when the வகை is clear, you can still specify it if you prefer. So you want that the variable contains 5 அச் initial value, you should தட்டச்சு:

source: var x: Int = 5 <span class="comment">// I can define the type if I want to</span> var y = 10 <span class="comment">// or I can omit the type if I prefer</span>
ta: var x: Int = 5 <span class="comment">// I can define the வகை if I want to</span> var ஒய் = 10 <span class="comment">// or I can omit the வகை if I prefer</span>

source: As you can see, the variables are <b>typed</b> in [!thelang], which means that they are somehow specialized: A given variable can only store data of a given type; Don't even think of storing numbers in a variable that is tailored for letters! The [!thelang] language is said to be <b>statically typed</b>.
ta: அச் you can see, the மாறிகள் அரே <b>typed</b> in [!thelang], which means that they அரே somehow specialized: A given variable can only store தகவல்கள் of a given type; Don't இரட்டை think of storing numbers in a variable that is tailored க்கு letters! The [!thelang] மொழி is said பெறுநர் be <b>statically typed</b>.

source: Other languages (such as Python) are less picky and allow you to store any kind of data in any variable, without restriction (those languages are said to be <b>dynamically typed</b>). This seems easier at the first glance, but this kind of restriction allows the compiler to catch more logic errors for you, which is also good. In some sense, Python is easier to write but errors can sneak in more easily than in [!thelang].
ta: மற்றொன்று மொழிகள் (such அச் Python) அரே less எடுத்துரை and allow you பெறுநர் store any kind of தகவல்கள் in any variable, without restriction (those மொழிகள் அரே said பெறுநர் be <b>dynamically typed</b>). This seems easier at the first glance, but this kind of restriction allows the தொகுப்பி பெறுநர் catch more தருக்கம், ஏரணம் errors க்கு you, which is also good. In some sense, பைதான் is easier பெறுநர் write but errors can sneak in more easily than in [!thelang].

source: Here are some existing types in [!thelang]:
ta: Here அரே some existing வகைகள் in [!thelang]:

source: <b>[!java|c]int[/!][!scala]Int[/!]</b>, for integers;
ta: <b>[!java|c]int[/!][!scala]Int[/!]</b>, க்கு integers;

source: <b>[!java|c]double[/!][!scala]Double[/!]</b>, for dot numbers;
ta: <b>[!java|c]double[/!][!scala]Double[/!]</b>, க்கு dot numbers;

source: <b>[!c]int[/!][!java]boolean[/!][!scala]Boolean[/!]</b>, for booleans that are values being either [!c]1[/!][!java|scala]true[/!] or [!c]0[/!][!java|scala]false[/!];
ta: <b>[!c]int[/!][!java]boolean[/!][!scala]Boolean[/!]</b>, க்கு booleans that அரே values being either [!c]1[/!][!java|scala]true[/!] or [!c]0[/!][!java|scala]false[/!];

source: <b>[!c]char*[/!][!java|scala]String[/!]</b>, for char strings.
ta: <b>[!c]char*[/!][!java|scala]String[/!]</b>, க்கு char strings.

source: As you can see, the variables are not <b>typed</b> in Python, which means that they are not specialized in any type of data. A given variable store any type of data of a given type: you can store a number in a variable and later on store a number in the same variable. The values themselves are still typed, but not the variable. Python is said to be <b>dynamically typed</b>.
ta: அச் you can see, the மாறிகள் அரே not <b>typed</b> in Python, which means that they அரே not specialized in any வகை of data. A given variable store any வகை of தகவல்கள் of a given தட்டச்சு: you can store a எண் in a variable and later on store a எண் in the same variable. The values themselves அரே still typed, but not the variable. பைதான் is said பெறுநர் be <b>dynamically typed</b>.
