Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: The easiest to adapt the insertion sort to the baseball problem is to consider all positions as adjacent and forget about bases. For that, we define the methods <code>getColor[!c]Insert[/!](pos)</code>, <code>move[!c]Insert[/!](pos)</code> and <code>getHole[!c]Insert[/!]()</code> that all use a unique integer to designate a given position. These functions simply convert between the way to specify a position and then call the usual functions to interact with the world. If you have an <code>index</code> and want to convert it into a <code>base,pos</code>, then <code>base=index/2</code> and <code>pos=index%2</code>. To compute the reverse, <code>index=base*2+pos</code> (this works because <code>getPositionsAmount()</code> always returns 2).
ta: The easiest பெறுநர் adapt the insertion வரிசைப்படுத்து பெறுநர் the baseball problem is பெறுநர் consider அனைத்தும் positions அச் adjacent and forget பற்றி bases. க்கு that, we define the முறைகள் <code>getColor[!c]Insert[/!](pos)</code>, <code>move[!c]Insert[/!](pos)</code> and <code>getHole[!c]Insert[/!]()</code> that அனைத்தும் use a unique முழு எண் பெறுநர் designate a given position. These செயல்பாடுகள் simply convert between the way பெறுநர் specify a position and then call the usual செயல்பாடுகள் பெறுநர் interact with the world. If you have an <code>index</code> and want பெறுநர் convert it into a <code>base,pos</code>, then <code>base=index/2</code> and <code>pos=index%2</code>. பெறுநர் compute the reverse, <code>index=base*2+pos</code> (this works because <code>getPositionsAmount()</code> எப்போதும் returns 2).

source: For the algorithm itself, you should first move the hole to the position 1. The position 0 is considered to be the sorted area (of size 1 for now) while the area above 2 is the unsorted area. Then comes an iteration to sort each element of the unsorted area. Since this iteration is a bit complex, you should think of its loop invariant, that is, the condition that is true before and after the loop and which explains that the loop fulfills its goal. Here, the loop invariant is twofold: First, the hole is between the sorted area and the unsorted area, and then, the every elements of the sorted area are ... well sorted relatively to their neighbors.
ta: க்கு the படிமுறை itself, you should first move the hole பெறுநர் the position 1. The position 0 is considered பெறுநர் be the sorted area (of அளவு 1 க்கு now) while the area above 2 is the unsorted area. Then comes an மறுசெய்கை பெறுநர் வரிசைப்படுத்து each தனிமம் of the unsorted area. Since this மறுசெய்கை is a துணுக்கு complex, you should think of its loop invariant, that is, the condition that is true before and after the loop and which explains that the loop fulfills its goal. Here, the loop invariant is twofold: First, the hole is between the sorted area and the unsorted area, and then, the every elements of the sorted area அரே ... well sorted relatively பெறுநர் their neighbors.

source: Then, the loop body to sort an element should first descend the hole and the elements within the sorted area until the element is larger than the element before in the sorted area (2 moves per position to travel), and then move the hole back to its position between the sorted and unsorted areas (1 move per position).
ta: Then, the loop body பெறுநர் வரிசைப்படுத்து an தனிமம் should first descend the hole and the elements within the sorted area until the தனிமம் is larger than the தனிமம் before in the sorted area (2 moves per position பெறுநர் travel), and then move the hole பின் பெறுநர் its position between the sorted and unsorted areas (1 move per position).

source: Once you insert the last element within the sorted area, your whole set is sorted and you're done. I preserve the surprise of the border cases that will require some little adjustments to your algorithm to make it work properly :)
ta: Once you செருகவும் the last தனிமம் within the sorted area, your whole கணம் is sorted and you're done. I preserve the surprise of the border cases that will require some little adjustments பெறுநர் your படிமுறை பெறுநர் make it வேலை properly :)

source: Crap, we adapted the insertion sort because our selection sort required too much moves to get the selected players to their position, but the insertion sort requires an inordinate amount of changes to get the border elements to their position within the sorted area without mixing the already sorted elements. At the end of the day, our selection variant was more efficient with at most <code>3*amountOfBase</code> moves to sort one element (1 to get the hole alongside with the player, and 2 to get the hole+player in position) while our insertion variant requires at most <code>3*amountOfPlayers</code> to sort one element (2 to descend the hole and player in position, 1 to get the hole back to its position). That's twice as bad as there is two players per base. It may be possible to improve the insertion sort by moving by more than one element when descending, but it seems uneasy (at least, while not mixing the already sorted elements) and it would probably only ensure that our insertion variant becomes as efficient as our selection variant, not dramatically better.
ta: Crap, we adapted the insertion வரிசைப்படுத்து because our தேர்வு வரிசைப்படுத்து required too much moves பெறுநர் get the தேர்ந்தெடுக்கப்பட்டது players பெறுநர் their position, but the insertion வரிசைப்படுத்து requires an inordinate amount of changes பெறுநர் get the border elements பெறுநர் their position within the sorted area without mixing the already sorted elements. At the end of the day, our தேர்வு variant was more efficient with at பெரும்பாலானவை <code>3*amountOfBase</code> moves பெறுநர் வரிசைப்படுத்து one தனிமம் (1 பெறுநர் get the hole alongside with the player, and 2 பெறுநர் get the hole+player in position) while our insertion variant requires at பெரும்பாலானவை <code>3*amountOfPlayers</code> பெறுநர் வரிசைப்படுத்து one தனிமம் (2 பெறுநர் descend the hole and player in position, 1 பெறுநர் get the hole பின் பெறுநர் its position). That's twice அச் bad அச் there is two players per base. It சி-வைகாசி be possible பெறுநர் improve the insertion வரிசைப்படுத்து by moving by more than one தனிமம் when descending, but it seems uneasy (at least, while not mixing the already sorted elements) and it would probably only ensure that our insertion variant becomes அச் efficient அச் our தேர்வு variant, not dramatically better.

source: If we cannot make the sort faster, we can make it easier. If you think about it, it seems rather natural to adapt the bubble sort to this problem: the hole becomes the bubble that moves up and down, sorting a bit the array during each traversal. The big lines are simply: "while it's not sorted, move the hole down to base 0 (moving the biggest player of each base at each step) and then back to the maximal base (moving the smallest player of each base)". After a while, <code>isSorted()</code> will return true and your algorithm will stop.
ta: If we cannot make the வரிசைப்படுத்து faster, we can make it easier. If you think பற்றி it, it seems rather natural பெறுநர் adapt the bubble வரிசைப்படுத்து பெறுநர் this problem: the hole becomes the bubble that moves மேலே and down, sorting a துணுக்கு the array during each traversal. The big வரிகள் அரே simply: "while it's not sorted, move the hole down பெறுநர் காரம் 0 (moving the biggest player of each காரம் at each step) and then பின் பெறுநர் the maximal காரம் (moving the smallest player of each base)". After a while, <code>isSorted()</code> will return true and your படிமுறை will stop.

source: Surprisingly, the bubble sort variant requires ways less moves than the other variants. This is astonishing because usually, the bubble sort performs much worse than the others sorts, but it comes from the very good match between its big lines and the baseball universe. It actually happens rather often that a pleasantly written algorithm performs very decently. But this is not an universal rule either, as demonstrated by the naive algorithm of the first exercise, that was nice, simple and wrong ;)
ta: Surprisingly, the bubble வரிசைப்படுத்து variant requires ways less moves than the மற்றொன்று variants. This is astonishing because usually, the bubble வரிசைப்படுத்து performs much worse than the others sorts, but it comes இருந்து the very good match between its big வரிகள் and the baseball universe. It actually happens rather often that a pleasantly written படிமுறை performs very decently. But this is not an universal விதி either, அச் demonstrated by the naive படிமுறை of the first exercise, that was nice, simple and wrong ;)

source: The universe of turtles
ta: The அண்டம் of turtles

source: This is an adaptation of LOGO for the Programmer's Learning Machine.
ta: This is an adaptation of அடையாளம் க்கு the Programmer's Learning Machine.

source: It is directly inspired from the work of the mathematician Seymour Papert in the 60's. Inspired from the swiss psycholog Jean Piaget, he came up with a learning method called LOGO to teach programming to young childs. The world is full of turtles which leave a painting where they go and which respond to simple orders.
ta: It is directly inspired இருந்து the வேலை of the mathematician Seymour Papert in the 60's. Inspired இருந்து the swiss psycholog Jean Piaget, he came மேலே with a learning method called அடையாளம் பெறுநர் teach programming பெறுநர் young childs. The world is full of turtles which leave a painting where they go and which respond பெறுநர் simple orders.

source: Functions to move the turtle
ta: செயல்பாடுகள் பெறுநர் move the turtle

source: Moves forward or backward of the requested amount of steps.
ta: Moves forward or பின்னோக்கு of the requested amount of steps.

source: Turns left or right of the given angle (in degrees).
ta: Turns இடது or வலது of the given angle (in degrees).

source: Returns the current position of the turtle. Note that the point (0,0) is on the top left corner, as it is often the case in Computer Science.
ta: Returns the மின்னோட்ட்ம், ஓட்டம் position of the turtle. குறிப்பு that the புள்ளியம் (0,0) is on the மேலே இடது corner, அச் it is often the case in கணிப்பொறி, கணிணி Science.

source: Teleports the turtle to a new position (without leaving any trace).
ta: Teleports the turtle பெறுநர் a புதிய position (without leaving any trace).

source: Moves the turtle to a new position.
ta: Moves the turtle பெறுநர் a புதிய position.

source: Draw a circle of the specified radius centered on the turtle.
ta: Draw a circle of the specified ஆரம் centered on the turtle.

source: Returns the current heading of the turtle (in degrees).
ta: Returns the மின்னோட்ட்ம், ஓட்டம் heading of the turtle (in degrees).

source: Sets a new heading to the turtle (in degrees).
ta: Sets a புதிய heading பெறுநர் the turtle (in degrees).

source: Functions about the pen
ta: செயல்பாடுகள் பற்றி the pen

source: Moves the pen up (turtles have pens, not brushes as buggles). The turtle will not leave any trace during its subsequent moves.
ta: Moves the pen மேலே (turtles have pens, not brushes அச் buggles). The turtle will not leave any trace during its subsequent moves.

source: Returns the current pen position as a boolean.
ta: Returns the மின்னோட்ட்ம், ஓட்டம் pen position அச் a boolean.

source: Returns the current pen color.
ta: Returns the மின்னோட்ட்ம், ஓட்டம் pen color.

source: Other functions
ta: மற்றொன்று செயல்பாடுகள்

source: Returns whether the current turtle is selected in the graphical interface.
ta: Returns whether the மின்னோட்ட்ம், ஓட்டம் turtle is தேர்ந்தெடுக்கப்பட்டது in the graphical interface.

source: Name
ta: பெயர்

source: Since its inception in the 60's, the LOGO turtle fascinates by its ability to draw nice figures on computer. This lesson allows you to explore some of the classical figures, and draw your own.
ta: Since its inception in the 60's, the அடையாளம் turtle fascinates by its திறமை பெறுநர் draw nice figures on computer. This பாடம் allows you பெறுநர் explore some of the classical figures, and draw your own.

source: The language's syntax is absolutely not presented, but if you know a bit of it or if someone tells you, you can take these exercises even if you are an absolute beginner in programming.
ta: The language's syntax is absolutely not presented, but if you know a துணுக்கு of it or if someone tells you, you can take these exercises இரட்டை if you அரே an தனி, சார்பிலா beginner in programming.

source: Please send us your best contributions so that they get added to this gallery to inspire the next ones.
ta: Please send us your best contributions so that they get added பெறுநர் this gallery பெறுநர் inspire the அடுத்தது ones.

source: Other exercises should be added. A whole lot of exercises are available from <a href="http://neoparaiso.com/logo/#sect4">http://neoparaiso.com/logo/#sect4</a> or from <a href="http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html.">http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html</a>.
ta: மற்றொன்று exercises should be added. A whole நிறைய of exercises அரே available இருந்து <a href="http://neoparaiso.com/logo/#sect4">http://neoparaiso.com/logo/#sect4</a> or இருந்து <a href="http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html.">http://billkerr2.blogspot.fr/2009/08/40-maths-shapes-challenges.html</a>.

source: Missing: the built-ins arc() and arcTo(), that draw an arc, either w/o moving or by moving to the end of the arc.
ta: Missing: the built-ins arc() and arcTo(), that draw an arc, either w/o moving or by moving பெறுநர் the end of the arc.

source: Draw beautiful figures with the Logo turtle, and learn programming while playing.
ta: Draw beautiful figures with the அடையாளம் turtle, and learn programming while playing.

source: You should know the basic syntax of the programming language you will choose, but no exhaustive programming practice is required to take this lesson.
ta: You should know the அடிப்படை syntax of the programming மொழி you will choose, but இல்லை exhaustive programming practice is required பெறுநர் take this lesson.

source: This world allows you to experiment with the recursive lists, as they were first introduced in Lisp. It is very similar to the BatWorld, but you are supposed to write recursive functions working on [!python|java]recursive strings. Since [!thelang] does not provide such a construct natively, the ConsWorld defines recursive lists of type <code>RecList</code>.[/!] [!scala]lists of integers (<code>List[Int]</code>).[/!]
ta: This world allows you பெறுநர் experiment with the recursive lists, அச் they were first introduced in Lisp. It is very similar பெறுநர் the BatWorld, but you அரே supposed பெறுநர் write recursive செயல்பாடுகள் working on [!python|java]recursive strings. Since [!thelang] does not provide such a construct natively, the ConsWorld வரையறுக்கிறது recursive lists of வகை <code>RecList</code>.[/!] [!scala]lists of integers (<code>List[Int]</code>).[/!]

source: Any given such list is either the empty list (noted <code>[!scala]Nil[/!][!java]null[/!][!python]None[/!]</code>), or an integer followed by a list. If a list is not empty, you can retrieve its first integer with <code>list.head</code> and the list containing its other parameters with <code>list.tail</code>. Of course, the empty list has no head nor the tail, so trying to access these elements will result in an (unpleasant) error message.
ta: Any given such பட்டியல் is either the வெறுமை பட்டியல் (noted <code>[!scala]Nil[/!][!java]null[/!][!python]None[/!]</code>), or an முழு எண் followed by a list. If a பட்டியல் is not empty, you can retrieve its first முழு எண் with <code>list.head</code> and the பட்டியல் containing its மற்றொன்று parameters with <code>list.tail</code>. Of course, the வெறுமை பட்டியல் has இல்லை head nor the tail, so trying பெறுநர் access these elements will result in an (unpleasant) பிழை message.

source: To build your own list, you need to concatenate a head and a tail as follows: [!java|python]<code>cons(head, tail)</code>[/!] [!scala]<code>head::tail</code> Note that <code>::</code> is a generic operator in Scala to build lists.[/!]
ta: பெறுநர் உருவாக்கு your own list, you need பெறுநர் concatenate a head and a tail அச் follows: [!java|python]<code>cons(head, tail)</code>[/!] [!scala]<code>head::tail</code> குறிப்பு that <code>::</code> is a generic operator in Scala பெறுநர் உருவாக்கு lists.[/!]

source: So, in summary, you can solve every exercises of this lesson with the following constructs.
ta: So, in summary, you can solve every exercises of this பாடம் with the following constructs.

source: <b>The empty list:</b>
ta: <b>The வெறுமை list:</b>

source: <b>Get the first element of <code>l</code></b>
ta: <b>Get the first தனிமம் of <code>l</code></b>

source: <b>Get the rest of the list</b>, when the first element is removed:
ta: <b>Get the rest of the list</b>, when the first தனிமம் is removed:

source: <b>Build a list</b> from a <code>value</code> and a <code>list</code>: [!java|python]
ta: <b>Build a list</b> இருந்து a <code>value</code> and a <code>list</code>: [!java|python]

source: This lesson contains a bunch of classical exercises on recursive lists. It is certainly not the most pleasant lesson to do, but I think that it is the easiest of the PLM lessons dealing with recursion.
ta: This பாடம் contains a bunch of classical exercises on recursive lists. It is certainly not the பெரும்பாலானவை pleasant பாடம் பெறுநர் do, but I think that it is the easiest of the PLM lessons dealing with recursion.

source: New exercises could be proposed, such as http://webloria.loria.fr/~quinson/Teaching/TOP/02-td-recursivite-enonce.pdf If you know some others, please report them as an issue.
ta: புதிய exercises could be proposed, such அச் http://webloria.loria.fr/~quinson/Teaching/TOP/02-td-recursivite-enonce.pdf If you know some others, please report them அச் an issue.

source: It would be interesting to check the asymptotic complexity of the student's code, but that does not sound easy to do. In Python and Java (where we provide a hand-made RecList class), we could count the amount of cons per exercise, but it won't be easy to relate this to the right BatTest. For Scala, it sounds even more difficult as we use the classical :: operators of the language. That will be difficult to override to add a counting mechanism. Another solution would be to ensure that the call stack does not pass a given threshold, but that sounds very difficult too. Any idea is welcome.
ta: It would be interesting பெறுநர் சரிபார் the asymptotic complexity of the student's code, but that does not sound easy பெறுநர் do. In பைதான் and சாவா (where we provide a hand-made RecList class), we could எண்ணுங்கள் the amount of cons per exercise, but it won't be easy பெறுநர் relate this பெறுநர் the வலது BatTest. க்கு Scala, it sounds இரட்டை more difficult அச் we use the classical :: operators of the language. That will be difficult பெறுநர் override பெறுநர் கூட்டு a counting mechanism. Another நீர்மக்கூழ் would be பெறுநர் ensure that the call stack does not கணவாய் a given threshold, but that sounds very difficult too. Any idea is welcome.

source: [!python]Be careful, you are not supposed to use the Python lists, but the specific type defined in this exercise. [/!] Please refer to the world's documentation for more information about recursive lists.
ta: [!python]Be careful, you அரே not supposed பெறுநர் use the பைதான் lists, but the specific வகை defined in this exercise. [/!] Please refer பெறுநர் the world's ஆவணப்படுத்துதல் க்கு more செய்தி பற்றி recursive lists.

source: Your solution should be linear in time.
ta: Your நீர்மக்கூழ் should be நேரியல் in time.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer, return true if the given integer is one of the elements of the list, or false if it cannot be found.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer, return true if the given முழு எண் is one of the elements of the list, or false if it cannot be found.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer, return the amount of occurrences of the given integer in the list. If the integer is not a member of the list, the function should thus return 0.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer, return the amount of occurrences of the given முழு எண் in the list. If the முழு எண் is not a member of the list, the சார்பு should thus return 0.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return its last element. You can assume that the list is not empty.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return its last element. You can assume that the பட்டியல் is not empty.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return the smallest of its values. You will probably need an extra function, even if you can assume that the list is not empty.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return the smallest of its values. You will probably need an extra function, இரட்டை if you can assume that the பட்டியல் is not empty.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return whether its elements form an increasing sequence (i.e., if the elements are sorted from the smallest to the largest one).
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return whether its elements form an increasing வரிசை (i.e., if the elements அரே sorted இருந்து the smallest பெறுநர் the largest one).

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return the list containing every elements but the last one. You can assume that the list is not empty.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return the பட்டியல் containing every elements but the last one. You can assume that the பட்டியல் is not empty.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return a new list containing all elements of your parameter incremented by one.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!], return a புதிய பட்டியல் containing அனைத்தும் elements of your கூறளவு incremented by one.

source: Remove
ta: அகற்று

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] <code>L</code>and an integer, return a new list containing all elements of <code>L</code> that are not equal to the value received as parameter.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] <code>L</code>and an integer, return a புதிய பட்டியல் containing அனைத்தும் elements of <code>L</code> that அரே not equal பெறுநர் the மதிப்பு received அச் parameter.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the <code>N</code>th element of the list.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an முழு எண் <code>N</code>, return the <code>N</code>th தனிமம் of the list.

source: You can assume that the list is long enough, i.e. that there is at least <code>N</code> elements. Your solution should be linear in time.
ta: You can assume that the பட்டியல் is long enough, i.e. that there is at least <code>N</code> elements. Your நீர்மக்கூழ் should be நேரியல் in time.

source: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an integer <code>N</code>, return the list constituted of the first <code>N</code> elements. You can assume that the list is long enough, i.e. that there is at least <code>N</code> elements.
ta: Given a [!scala]List[Int][/!][!java|python]recursive list[/!] and an முழு எண் <code>N</code>, return the பட்டியல் constituted of the first <code>N</code> elements. You can assume that the பட்டியல் is long enough, i.e. that there is at least <code>N</code> elements.
