Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: It is possible to have several <code>return</code> instructions in several branches of a conditional. In fact, it is forbidden to have any execution path of your body without any <code>return</code>, or to write some code after the <code>return</code> instruction. Indeed, if the machine reaches the end of the function without finding any <code>return</code>, it cannot know what actual value to give back to the function caller. Moreover, <code>return</code> interrupts immediately the function execution (why bother looking further when you know the function result?). So, if there is some code after a <code>return</code>, it must be an error and the compiler warns you.
ta: It is possible பெறுநர் have several <code>return</code> instructions in several branches of a conditional. In fact, it is forbidden பெறுநர் have any execution பாதை of your body without any <code>return</code>, or பெறுநர் write some குறியீடு after the <code>return</code> instruction. Indeed, if the machine reaches the end of the சார்பு without finding any <code>return</code>, it cannot know what actual மதிப்பு பெறுநர் give பின் பெறுநர் the சார்பு caller. Moreover, <code>return</code> interrupts உடனடியாக the சார்பு execution (why bother looking further when you know the சார்பு result?). So, if there is some குறியீடு after a <code>return</code>, it must be an பிழை and the தொகுப்பி warns you.

source: [!java|scala|c][!java]boolean [/!][!c]int [/!][!scala]def [/!]isFrontFree()[!scala]:Boolean =[/!] { if (isFacingWall() == [!java|scala]true[/!][!c]1[/!]) { return [!java|scala]false[/!][!c]0[/!]; <span class="comment">/* no code allowed here */</span> } else { return [!java|scala]true[/!][!c]1[/!]; <span class="comment">/* here neither */</span> } <span class="comment">/* even here, forget it */</span> }[/!][!python]def isFrontFree(): if isFacingWall() == True: return False <span class="comment"># no code allowed here</span> else return True <span class="comment"># here neither</span> <span class="comment"># even here, forget it</span>[/!]
ta: [!java|scala|c][!java]boolean [/!][!c]int [/!][!scala]def [/!]isFrontFree()[!scala]:Boolean =[/!] { if (isFacingWall() == [!java|scala]true[/!][!c]1[/!]) { return [!java|scala]false[/!][!c]0[/!]; <span class="comment">/* இல்லை குறியீடு allowed here */</span> } else { return [!java|scala]true[/!][!c]1[/!]; <span class="comment">/* here neither */</span> } <span class="comment">/* இரட்டை here, forget it */</span> }[/!][!python]def isFrontFree(): if isFacingWall() == True: return False <span class="comment"># இல்லை குறியீடு allowed here</span> else return True <span class="comment"># here neither</span> <span class="comment"># இரட்டை here, forget it</span>[/!]

source: You will once again write a function that the buggle will use. Its name must be <code>haveBaggle</code>, and it returns a boolean value indicating whether the row in front of the buggle contains a baggle or not. The buggle will use it to search the first row containing a baggle, and stop here.
ta: You will once again write a சார்பு that the buggle will use. Its பெயர் must be <code>haveBaggle</code>, and it returns a boolean மதிப்பு indicating whether the நிரை in front of the buggle contains a baggle or not. The buggle will use it பெறுநர் தேடல் the first நிரை containing a baggle, and நிறுத்து here.

source: The easier for this function is to use a boolean variable called <code>seenBaggle</code> indicating whether or not we saw a baggle so far. Its initial value is '[!python]False[/!][!scala|java]false[/!][!c]0[/!]'.
ta: The easier க்கு this சார்பு is பெறுநர் use a boolean variable called <code>seenBaggle</code> indicating whether or not we saw a baggle so far. Its initial மதிப்பு is '[!python]False[/!][!scala|java]false[/!][!c]0[/!]'.

source: Then, move 6 steps forward (the world contains 7 cells and we already are on one of them). For each cell, if it contains a baggle, we store true in <code>sawBaggle</code> (and we don't do anything but moving forward if not).
ta: Then, move 6 படிகள் forward (the world contains 7 cells and we already அரே on one of them). க்கு each cell, if it contains a baggle, we store true in <code>sawBaggle</code> (and we don't do anything but moving forward if not).

source: At the end, we move back by 6 steps, and we return the value of <code>seenBaggle</code> to the caller.
ta: At the end, we move பின் by 6 steps, and we return the மதிப்பு of <code>seenBaggle</code> பெறுநர் the caller.

source: Note that the used buggle provides some hidden code that will call your <code>haveBaggle</code> function on each column, moving automatically between columns. It is thus very important that your <code>haveBaggle</code> function have no side effect: the position (and orientation) at the end of your code must be the one observed at the beginning of this code. It will move in between to seek for the baggle, but come back to the column start.
ta: குறிப்பு that the used buggle provides some hidden குறியீடு that will call your <code>haveBaggle</code> சார்பு on each column, moving automatically between columns. It is thus very important that your <code>haveBaggle</code> சார்பு have இல்லை பக்கம் effect: the position (and orientation) at the end of your குறியீடு must be the one observed at the beginning of this code. It will move in between பெறுநர் seek க்கு the baggle, but come பின் பெறுநர் the நெடுவரிசை start.

source: Also, this exercise is a bit different since there is two initial worlds, each with a specific objective. Your code must work for each of them. Observe that the world selection scrolling menu (right below the speed slider) allows to switch the observed world.
ta: Also, this exercise is a துணுக்கு different since there is two initial worlds, each with a specific objective. Your குறியீடு must வேலை க்கு each of them. Observe that the world தேர்வு scrolling பட்டியல் (right below the விரைவு slider) allows பெறுநர் ஆளி, நிலைமாறி the observed world.

source: When your function <code>haveBaggle</code> works, proceed to next exercise.
ta: When your சார்பு <code>haveBaggle</code> works, proceed பெறுநர் அடுத்தது exercise.

source: Don't you get tired of writing again and again the code to move by a fixed amount of steps? On the other hand, writing <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, as well as <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt>, and so on does not really help, to say the less.
ta: Don't you get tired of writing again and again the குறியீடு பெறுநர் move by a fixed amount of steps? On the மற்றொன்று hand, writing <tt>forward2()</tt>, <tt>forward3()</tt>, <tt>forward4()</tt>, அச் well அச் <tt>backward2()</tt>, <tt>backward3()</tt>, <tt>backward4()</tt>, and so on does not really help, பெறுநர் say the less.

source: Luckily, it is possible to pass <b>parameters</b> to your methods. You have to specify their type and name between the parenthesis after the method name. Then, you can use them in the method body as if it were variables defined in there, and which initial value is what the caller specified.
ta: Luckily, it is possible பெறுநர் கணவாய் <b>parameters</b> பெறுநர் your methods. You have பெறுநர் specify their வகை and பெயர் between the parenthesis after the method name. Then, you can use them in the method body அச் if it were மாறிகள் defined in there, and which initial மதிப்பு is what the caller specified.

source: [!java|c]double [/!]divideByTwo([!java|c]double [/!]x[!scala]: Double[/!])[!scala]: Double =[/!] [!java|scala|c]{[/!][!python]:[/!] return x / 2[!java|c];[/!] [!scala|java|c]}[/!]
ta: [!java|c]double [/!]divideByTwo([!java|c]double [/!]x[!scala]: Double[/!])[!scala]: இரட்டை =[/!] [!java|scala|c]{[/!][!python]:[/!] return ஃச் / 2[!java|c];[/!] [!scala|java|c]}[/!]

source: As caller, you have to specify the initial value of this "variables" between the call's parenthesis.
ta: அச் caller, you have பெறுநர் specify the initial மதிப்பு of this "variables" between the call's parenthesis.

source: If you want several parameters, you need to separate them with comas (,) both in the declaration and calls.
ta: If you want several parameters, you need பெறுநர் separate them with comas (,) both in the சாற்றுதல் and calls.

source: [!java|c]double divide(double x, double y) {[/!] [!scala]def divide(x:Double, y:Double): Double = {[/!] [!python]def divide(x, y):[/!] return x / y[!java|c];[/!] [!java|scala|c]}[/!]
ta: [!java|c]double divide(double ஃச், இரட்டை y) {[/!] [!scala]def divide(x:Double, y:Double): இரட்டை = {[/!] [!python]def divide(x, y):[/!] return ஃச் / y[!java|c];[/!] [!java|scala|c]}[/!]

source: In [!thelang], you can declare several methods of the same name as long as they don't have the same <b>signature</b>, that is, the same amount of parameters and the same parameters' types.
ta: In [!thelang], you can declare several முறைகள் of the same பெயர் அச் long அச் they don't have the same <b>signature</b>, that is, the same amount of parameters and the same parameters' types.

source: [!java]double max(double x, double y)[/!][!scala]def max(x:Double, y:Double): Double =[/!] { if (x > y) { return x; } return y; }[!java]int max(int x, int y)[/!][!scala]def max(x:Int, y:Int): Int =[/!] { if (x > y) { return x; } return y; } [!java]int max(int x, int y; int z)[/!][!scala]def max(x:Int, y:Int, z:Int): Int =[/!] { if (x > y && x > z) { return x; } if (y > z) { return y; } return z; }
ta: [!java]double max(double ஃச், இரட்டை y)[/!][!scala]def max(x:Double, y:Double): இரட்டை =[/!] { if (x > y) { return x; } return y; }[!java]int max(int ஃச், int y)[/!][!scala]def max(x:Int, y:Int): Int =[/!] { if (x > y) { return x; } return y; } [!java]int max(int ஃச், int y; int z)[/!][!scala]def max(x:Int, y:Int, z:Int): Int =[/!] { if (x > ஒய் && ஃச் > z) { return x; } if (y > z) { return y; } return z; }

source: Observe that we omitted the <tt>else</tt> branches of each <tt>if</tt>. It works anyway because a <tt>return</tt> interrupts the method execution. If we arrive to the last line of <code>[!java]max(int,int)[/!][!scala]max(Int,Int):Int[/!]</code>, we know that <code>x&lt;=y</code> because otherwise, the <tt>return</tt> of line 2 would have stopped the execution.
ta: Observe that we omitted the <tt>else</tt> branches of each <tt>if</tt>. It works anyway because a <tt>return</tt> interrupts the method execution. If we arrive பெறுநர் the last வரி of <code>[!java]max(int,int)[/!][!scala]max(Int,Int):Int[/!]</code>, we know that <code>x&lt;=y</code> because otherwise, the <tt>return</tt> of வரி 2 would have நிறுத்தப்பட்டது the execution.

source: This time, you have to write a <code> [!java|c]move(int stepCount,[!java]boolean[/!][!c]int[/!] forward)[/!] [!scala]move(stepCount: Int,forward: Boolean)[/!] [!python]move(stepCount,forward)[/!] </code> method which moves forward by <code>stepCount</code> steps if <code>forward</code> is true, and moves back of that amount of steps if the boolean is false.
ta: This time, you have பெறுநர் write a <code> [!java|c]move(int stepCount,[!java]boolean[/!][!c]int[/!] forward)[/!] [!scala]move(stepCount: Int,forward: Boolean)[/!] [!python]move(stepCount,forward)[/!] </code> method which moves forward by <code>stepCount</code> படிகள் if <code>forward</code> is true, and moves பின் of that amount of படிகள் if the boolean is false.

source: This time, there is only one world but seven buggles, all sharing the same code. This code should not be really problematic for you to write, actually.
ta: This time, there is only one world but seven buggles, அனைத்தும் sharing the same code. This குறியீடு should not be really problematic க்கு you பெறுநர் write, actually.

source: Your buggle decided to flower a bit the pot it lives in. You have to help it reproducing the drawing of its dreams (check the "Objective" tab to see it).
ta: Your buggle decided பெறுநர் flower a துணுக்கு the pot it lives in. You have பெறுநர் உதவி it reproducing the drawing of its dreams (check the "Objective" தாவல் பெறுநர் see it).

source: For that, you have to write a <code>growFlowers()</code> method that does not take any parameter and does not return any result. You could probably make it without defining this method, but this is part of the assignment.
ta: க்கு that, you have பெறுநர் write a <code>growFlowers()</code> method that does not take any கூறளவு and does not return any result. You could probably make it without defining this method, but this is பகுதி of the assignment.

source: Also, you should try to decompose this complex drawing in sub-steps so that your code remains short and easy to read. A method to draw one flower of the color passed in parameter sounds like a good start, but it is probably not enough.
ta: Also, you should try பெறுநர் decompose this அணைவு drawing in sub-steps so that your குறியீடு remains குறுக்கு and easy பெறுநர் read. A method பெறுநர் draw one flower of the color passed in கூறளவு sounds like a good start, but it is probably not enough.

source: For your information, this drawing uses five colors that are listed below. [!java|scala|c]The data type of these constants is <code>Color</code>, that naturally describes a particular color.[/!]
ta: க்கு your information, this drawing uses five colors that அரே listed below. [!java|scala|c]The தகவல்கள் வகை of these மாறிலிகள் is <code>Color</code>, that naturally describes a particular color.[/!]

source: Flower Display Case
ta: Flower காட்சி Case

source: Whao! That's not a little pot anymore! That's a huge large flower display case! Your buggle can't help but starts flowering this gorgeous place. You should help it to prevent that it bumps into a wall...
ta: Whao! That's not a little pot anymore! That's a huge large flower காட்சி case! Your buggle can't உதவி but starts flowering this gorgeous place. You should உதவி it பெறுநர் prevent that it bumps into a wall...

source: If you observe carefully the picture to draw, it is constituted of four parts depicting a sort of V using a different color. A possible decomposition is to write a method in charge of drawing a V of the specified color from the current position. Its prototype can be:
ta: If you observe carefully the picture பெறுநர் draw, it is constituted of நான்கு, நாலடி, நான்கடி பாகங்கள் depicting a வரிசைப்படுத்து of V using a different color. A possible decomposition is பெறுநர் write a method in மின்னூட்டு of drawing a V of the specified color இருந்து the மின்னோட்ட்ம், ஓட்டம் position. Its prototype can be:

source: [!java|c]void [/!]makeV([!java|c]Color [/!]c[!scala]: Color[/!])[!python] <span class="comment"># parameter c is of type Color</span>[/!]
ta: [!java|c]void [/!]makeV([!java|c]Color [/!]c[!scala]: Color[/!])[!python] <span class="comment"># கூறளவு c is of வகை Color</span>[/!]

source: The <code>Color</code> data type naturally describes a particular color. Your code should probably call <code>makeV</code> with the following arguments (a different color for each call):
ta: The <code>Color</code> தகவல்கள் வகை naturally describes a particular color. Your குறியீடு should probably call <code>makeV</code> with the following arguments (a different color க்கு each call):

source: In <code>makeV()</code>, you should use the <code>setBrushColor()</code> method (predefined in the buggle) to change the color of the buggle's brush, as well as <code>brushUp()</code> and <code>brushDown()</code> to change the brush position.
ta: In <code>makeV()</code>, you should use the <code>setBrushColor()</code> method (predefined in the buggle) பெறுநர் change the color of the buggle's brush, அச் well அச் <code>brushUp()</code> and <code>brushDown()</code> பெறுநர் change the மின்தொடி position.

source: It may be wise to write the <code>makeV()</code> so that it places directly the buggle in position for the next V.
ta: It சி-வைகாசி be wise பெறுநர் write the <code>makeV()</code> so that it places directly the buggle in position க்கு the அடுத்தது V.

source: Your turn now. I'm sure you can imagine the other methods you need to keep your code simple and pleasant to read. Complete the method <code>run()</code> that should be called automatically (once). [!java]the <code>public</code> keyword means more or less that anybody can call this method, which is good because the PLM infrastructure calls it directly.[/!]
ta: Your turn now. I'm sure you can imagine the மற்றொன்று முறைகள் you need பெறுநர் keep your குறியீடு simple and pleasant பெறுநர் read. Complete the method <code>run()</code> that should be called automatically (once). [!java]the <code>public</code> keyword means more or less that anybody can call this method, which is good because the PLM infrastructure calls it directly.[/!]

source: You thus have to declare even more methods to use the repetitions of the pattern and factorize your code. Another solution is to <i>parametrize</i> your functions to reuse the code you wrote previously by changing the size.
ta: You thus have பெறுநர் declare இரட்டை more முறைகள் பெறுநர் use the repetitions of the pattern and factorize your code. Another நீர்மக்கூழ் is பெறுநர் <i>parametrize</i> your செயல்பாடுகள் பெறுநர் reuse the குறியீடு you wrote previously by changing the size.

source: Here is yet another exercise where you have to reproduce the pattern provided in the "Objective" tab.
ta: Here is yet another exercise where you have பெறுநர் reproduce the pattern provided in the "Objective" tab.

source: This one is a bit more difficult than the one seen previously. Look for repeating patterns, even if the color changes, and write a method drawing each of them.
ta: This one is a துணுக்கு more difficult than the one seen previously. Look க்கு repeating patterns, இரட்டை if the color changes, and write a method drawing each of them.

source: Now that your <code>isFacingTrail()</code> method is working, it's time to write the code to organize the hunting party. Copy/paste your code from the previous exercise, and complete the <code>hunt()</code> method.
ta: Now that your <code>isFacingTrail()</code> method is working, it's time பெறுநர் write the குறியீடு பெறுநர் organize the hunting party. Copy/paste your குறியீடு இருந்து the previous exercise, and complete the <code>hunt()</code> method.

source: Following a track is not very difficult: move forward as long as you have the track in front of you. If there is not track in front of you anymore, check whether the rest of the track is on your left or on your right, and follow it further.
ta: Following a மின்தடம் is not very difficult: move forward அச் long அச் you have the மின்தடம் in front of you. If there is not மின்தடம் in front of you anymore, சரிபார் whether the rest of the மின்தடம் is on your இடது or on your right, and follow it further.

source: To ensure that you don't mix the track you come from with the one in front of you, the easier is to erase the track when you follow it. Use the method <code>brushDown()</code> to put your brush down and mark the ground, and <code>brushUp()</code> to move it up again.
ta: பெறுநர் ensure that you don't mix the மின்தடம் you come இருந்து with the one in front of you, the easier is பெறுநர் erase the மின்தடம் when you follow it. Use the method <code>brushDown()</code> பெறுநர் put your மின்தொடி down and mark the ground, and <code>brushUp()</code> பெறுநர் move it மேலே again.

source: Finally, do not forget to capture your prey once you found it (using <code>pickupBaggle()</code>).
ta: Finally, do not forget பெறுநர் capture your prey once you found it (using <code>pickupBaggle()</code>).

source: <a name="Objectives"> Complete the <code>hunt()</code> method. You probably want to copy over the <code>isFacingTrail()</code> method that you wrote in previous exercise. </a>
ta: <a name="Objectives"> Complete the <code>hunt()</code> method. You probably want பெறுநர் நகலெடு வீச்சலகு the <code>isFacingTrail()</code> method that you wrote in previous exercise. </a>

source: Your buggle is super happy! It just found the green dribbling trail, certainly left by a big yummy slug. At its end, the buggle is certain to entertain itself with this appetizing slug (represented as a baggle).
ta: Your buggle is super happy! It just found the பச்சை dribbling trail, certainly இடது by a big yummy slug. At its end, the buggle is certain பெறுநர் entertain itself with this appetizing குருட்டடி (represented அச் a baggle).

source: To reach that goal, you had to write a method <tt>isFacingTrail</tt> that will be called automatically by the buggle on each step. Your method should return [!python]True[/!][!java|scala]true[/!] if facing a green cell, or [!python]False[/!][!java|scala]false[/!] if not. Of course, if we are facing a wall, it should return false without bumping into it. You should make sure that this method has no <b>side effect</b>, i.e. that it does not change the state of the calling buggle nor of its world.
ta: பெறுநர் reach that goal, you had பெறுநர் write a method <tt>isFacingTrail</tt> that will be called automatically by the buggle on each step. Your method should return [!python]True[/!][!java|scala]true[/!] if facing a பச்சை cell, or [!python]False[/!][!java|scala]false[/!] if not. Of course, if we அரே facing a wall, it should return false without bumping into it. You should make sure that this method has இல்லை <b>side effect</b>, i.e. that it does not change the state of the calling buggle nor of its world.

source: Your tool to that end is the <code>getGroundColor()</code> that returns the color of the current cell. Just go to the cell you want to test and run that function. [!java]You cannot test whether this color is equal to <code>Color.green</code> with an <code>==</code> sign but instead you have to write something like <code>getGroundColor().equals(Color.green)</code>. This is because green is an <i>object</i> in Java, and <code>.equals()</code> is the way to go to test equality between Java objects.[/!] [!python|scala|c]So you just have to test whether the returned color is equal to the value <code>[!scala|python]Color.green[/!][!c]GREEN[/!]</code>, that represents the green color.[/!]
ta: Your கருவி பெறுநர் that end is the <code>getGroundColor()</code> that returns the color of the மின்னோட்ட்ம், ஓட்டம் cell. Just go பெறுநர் the கலன் you want பெறுநர் தேர்வு and ஓடு that function. [!java]You cannot தேர்வு whether this color is equal பெறுநர் <code>Color.green</code> with an <code>==</code> sign but instead you have பெறுநர் write something like <code>getGroundColor().equals(Color.green)</code>. This is because பச்சை is an <i>object</i> in Java, and <code>.equals()</code> is the way பெறுநர் go பெறுநர் தேர்வு equality between சாவா objects.[/!] [!python|scala|c]So you just have பெறுநர் தேர்வு whether the returned color is equal பெறுநர் the மதிப்பு <code>[!scala|python]Color.green[/!][!c]GREEN[/!]</code>, that represents the பச்சை color.[/!]

source: Yuhu! This time, your buggle found the tracks of much more preys! In the first world, that's a yummy Kitty Slug (leaving a pink trail) while on the second world, that's a big fat snail that awaits your buggle at the end of the orange trail.
ta: Yuhu! This time, your buggle found the tracks of much more preys! In the first world, that's a yummy Kitty குருட்டடி (leaving a இளஞ்சிவப்பு trail) while on the second world, that's a big fat snail that awaits your buggle at the end of the ஆரஞ்சு trail.

source: You have to copy/paste your code again, and change it so that your methods take the color of the trail to follow as a parameter. Beside of this, your code should work as earlier.
ta: You have பெறுநர் copy/paste your குறியீடு again, and change it so that your முறைகள் take the color of the trail பெறுநர் follow அச் a parameter. Beside of this, your குறியீடு should வேலை அச் earlier.
