Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: As you can see, we achieve one join in 2 flips in the cases 1 or 2.a. Since we need to achieve n joins to sort the stack, we can sort the stack in <i>2n</i> steps if case 2.b does not occurs.
ta: அச் you can see, we achieve one join in 2 flips in the cases 1 or 2.a. Since we need பெறுநர் achieve n joins பெறுநர் வரிசைப்படுத்து the stack, we can வரிசைப்படுத்து the stack in <i>2n</i> படிகள் if case 2.b does not occurs.

source: That case 2.b requires a very different handling as it is obviously not possible to achieve a join in only 2 flips. But fortunately, we can leverage the very specific setting of the stack in that case to provide the following algorithm. It sorts a stack in that exact configuration after exactly <i>2n</i> steps.
ta: That case 2.b requires a very different handling அச் it is obviously not possible பெறுநர் achieve a join in only 2 flips. But fortunately, we can leverage the very specific setting of the stack in that case பெறுநர் provide the following algorithm. It sorts a stack in that exact உள்ளமைவு after exactly <i>2n</i> steps.

source: Repeat n times Flip the whole stack of n pancakes Flip the top (n-1) pancakes
ta: Repeat n times Flip the whole stack of n pancakes Flip the மேலே (n-1) pancakes

source: It may sound somehow magic, but it actually works, as depicted on an example below.
ta: It சி-வைகாசி sound somehow magic, but it actually works, அச் depicted on an example below.

source: So, all in all, the Cohen algorithm manages to sort the stack of burnt pancakes in <i>2n</i> steps in all cases. Quite a win over the naive algorithm for burnt pancakes that requires <i>3n</i> steps.
ta: So, அனைத்தும் in all, the Cohen படிமுறை manages பெறுநர் வரிசைப்படுத்து the stack of burnt pancakes in <i>2n</i> படிகள் in அனைத்தும் cases. Quite a win வீச்சலகு the naive படிமுறை க்கு burnt pancakes that requires <i>3n</i> steps.

source: Don't worry. This exercise is very difficult, so it's ok if it does not work right away for you. Add some relevant logging to your code to understand where it stop performing correctly. Make sure to use the method <code>isSelected()</code> so that your logs only appears in the currently displayed world. In particular, it may help to print textually the state of the world each time you enter the main loop.
ta: Don't worry. This exercise is very difficult, so it's சரி if it does not வேலை வலது away க்கு you. கூட்டு some relevant logging பெறுநர் your குறியீடு பெறுநர் understand where it நிறுத்து performing correctly. Make sure பெறுநர் use the method <code>isSelected()</code> so that your logs only appears in the currently displayed world. In particular, it சி-வைகாசி உதவி பெறுநர் அச்சிடுக textually the state of the world each time you enter the main loop.

source: This activity is inspired from the orange game, from the "Computer Science Unplugged" activities repository. It was however heavily since then, first for the CSIRL (my repository of <i>free</i> unplugged activities to introduce computer science, available at http://www.loria.fr/~quinson/Mediation/SMN/) and now for PLM.
ta: This செய்கைப்பாடு is inspired இருந்து the ஆரஞ்சு game, இருந்து the "Computer Science Unplugged" activities repository. It was however heavily since then, first க்கு the CSIRL (my களஞ்சியம் of <i>free</i> unplugged activities பெறுநர் introduce கணிப்பொறி, கணிணி science, available at http://www.loria.fr/~quinson/Mediation/SMN/) and now க்கு PLM.

source: In the literature, the generalized form of this problem is known as the pebble motion problem (the bases can be connected by any kind of graph, and the affinity of pebbles with bases may be different). Another variant of this problem is the well known 15-puzzle, with one player per base, and a two dimensional square grid. Much more information about these problems can be found on wikipedia, as usual.
ta: In the literature, the generalized form of this problem is known அச் the pebble இயக்கம் problem (the bases can be connected by any kind of graph, and the affinity of pebbles with bases சி-வைகாசி be different). Another variant of this problem is the well known 15-puzzle, with one player per base, and a two dimensional square grid. Much more செய்தி பற்றி these problems can be found on wikipedia, அச் usual.

source: How do you know that the naive algorithm won't loop on that initial situation?
ta: How do you know that the naive படிமுறை won't loop on that initial situation?

source: Well, we simply tested all possible situations to see when this algorithm loops and when it finds the correct solution. We found that it works for all situations where no player is at home (there is 84 such situations for 4 bases, once you take the symmetries into account). It obviously works for some situations that do not respect this criteria (such as all situations it encounters from one of those 84 boards to the final state), but that's another story. Having such a criteria allows us to generate pseudo-random initial situations for the first exercise for which the algorithm we propose is guarenteed to work.
ta: Well, we simply tested அனைத்தும் possible situations பெறுநர் see when this படிமுறை வளையங்கள் and when it finds the சரியான solution. We found that it works க்கு அனைத்தும் situations where இல்லை player is at வீடு (there is 84 such situations க்கு 4 bases, once you take the symmetries into account). It obviously works க்கு some situations that do not respect this criteria (such அச் அனைத்தும் situations it encounters இருந்து one of those 84 boards பெறுநர் the final state), but that's another story. Having such a criteria allows us பெறுநர் generate pseudo-random initial situations க்கு the first exercise க்கு which the படிமுறை we propose is guarenteed பெறுநர் work.

source: We also explored bigger instances of the problem, and unfortunately, we have no such criteria for them. With 5 bases, the algorithm wrongly loops for 24 of the 1824 possible boards where no player is home (that's 1.31%). With 6 bases, it fails on 1251 of the 58860 such boards (2.12%). With 7 bases, it fails for 84444 out of 2633940 (that's 3.2%). I am still looking for a criteria ensuring that the algorithm won't loop. If you discover one, please report it. Ideally, it would be simple to enforce manually so that we can use it during our unplugged activities.
ta: We also explored bigger instances of the problem, and unfortunately, we have இல்லை such criteria க்கு them. With 5 bases, the படிமுறை wrongly வளையங்கள் க்கு 24 of the 1824 possible boards where இல்லை player is வீடு (that's 1.31%). With 6 bases, it fails on 1251 of the 58860 such boards (2.12%). With 7 bases, it fails க்கு 84444 out of 2633940 (that's 3.2%). I am still looking க்கு a criteria ensuring that the படிமுறை won't loop. If you கண்டுபிடி one, please report it. Ideally, it would be simple பெறுநர் enforce manually so that we can use it during our unplugged activities.

source: Other graphical representations could be proposed, such as a linear one (for the existing exercises) or other ones (such as a grid or a tree, if an exercise on this kind of graph proves interesting).
ta: மற்றொன்று graphical representations could be proposed, such அச் a நேரியல் one (for the existing exercises) or மற்றொன்று ones (such அச் a வலைவாய் or a tree, if an exercise on this kind of graph proves interesting).

source: Other exercises on other algorithms on this variant, or on other variants such as the 15-puzzle.
ta: மற்றொன்று exercises on மற்றொன்று algorithms on this variant, or on மற்றொன்று மாறுபாடுகள் such அச் the 15-puzzle.

source: The colors are represented by integers, between <code>0</code> and <code>amount of bases -1</code>. The hole is represented by the special value <code>-1</code>. The color of each base is its rank. So base <code>1</code> is of color <code>1</code>. In the graphical interface, the base <code>0</code> is the dark blue one while the base <code>1</code> is the fuscia one.
ta: The colors அரே represented by integers, between <code>0</code> and <code>amount of bases -1</code>. The hole is represented by the special மதிப்பு <code>-1</code>. The color of each காரம் is its rank. So காரம் <code>1</code> is of color <code>1</code>. In the graphical interface, the காரம் <code>0</code> is the dark நீலம் one while the காரம் <code>1</code> is the fuscia one.

source: Once every players on the field are in their home base, the hole should be in the last base, that is of rank <code>getBasesAmount()-1</code>.
ta: Once every players on the புலம் அரே in their வீடு base, the hole should be in the last base, that is of rank <code>getBasesAmount()-1</code>.

source: Functions to retrieve the world's dimensions
ta: செயல்பாடுகள் பெறுநர் retrieve the world's dimensions

source: Returns the amount of player's positions per base on this field.
ta: Returns the amount of player's positions per காரம் on this field.

source: Functions to retrieve the world's state
ta: செயல்பாடுகள் பெறுநர் retrieve the world's state

source: Returns the base in which the hole is located.
ta: Returns the காரம் in which the hole is located.

source: Returns the hole position within its base
ta: Returns the hole position within its காரம்

source: Returns whether all players of the field are at home.
ta: Returns whether அனைத்தும் players of the புலம் அரே at home.

source: Returns whether all players of a given base are at home.
ta: Returns whether அனைத்தும் players of a given காரம் அரே at home.

source: Functions to change the world
ta: செயல்பாடுகள் பெறுநர் change the world

source: Moves a given player into the hole. This throws an IllegalArgumentException if the specified player is not near the hole (at most one base away).
ta: Moves a given player into the hole. This throws an IllegalArgumentException if the specified player is not near the hole (at பெரும்பாலானவை one காரம் away).

source: Today, the buggles decided to play a baseball game, but they are rather out of luck, actually. First, kinda forgot the rules, and ... well ... they cannot find the ball and bats again. So they decided to "adapt a bit" the rules. As the are no ball, the buggles can only running around the field, what they do happily: for a while, all attending buggle run at full speed in all directions around the field.
ta: Today, the buggles decided பெறுநர் play a baseball game, but they அரே rather out of luck, actually. First, kinda forgot the rules, and ... well ... they cannot கண்டுபிடி the ball and பாட்ச் again. So they decided பெறுநர் "adapt a bit" the rules. அச் the அரே இல்லை ball, the buggles can only running around the field, what they do happily: க்கு a while, அனைத்தும் attending buggle ஓடு at full விரைவு in அனைத்தும் directions around the field.

source: But after a few collisions, they decide to invent new rules to organize a bit the game: They make one team per base and two players per team. One of the teams has only one player so that its base has an empty location. Then, the players are dispatched randomly around the bases, and the game for them is to reach their home base. The whole game stops when all players are home. There is no winning team: either all players win, or they all lose. Actually, this game is very different from the original baseball. The only rule that remains is that you can only run around the field, from one base to the next one, without crossing middle of the field.
ta: But after a few collisions, they decide பெறுநர் invent புதிய rules பெறுநர் organize a துணுக்கு the game: They make one team per காரம் and two players per team. One of the teams has only one player so that its காரம் has an வெறுமை location. Then, the players அரே dispatched randomly around the bases, and the game க்கு them is பெறுநர் reach their வீடு base. The whole game stops when அனைத்தும் players அரே home. There is இல்லை winning team: either அனைத்தும் players win, or they அனைத்தும் lose. Actually, this game is very different இருந்து the original baseball. The only விதி that remains is that you can only ஓடு around the field, இருந்து one காரம் பெறுநர் the அடுத்தது one, without crossing middle of the field.

source: Now, they are asking you to help them deciding who and when should move so that each player returns to its base. Only one buggle can move at each round, from its position to the empty spot. The maximal distance that a buggle can cover in one round is of one base.
ta: Now, they அரே asking you பெறுநர் உதவி them deciding who and when should move so that each player returns பெறுநர் its base. Only one buggle can move at each round, இருந்து its position பெறுநர் the வெறுமை spot. The maximal distance that a buggle can cover in one round is of one base.

source: So, at each round, the empty spot is on one base (say <code>B</code>), and you should decide which buggle enters that empty spot. There is four candidates (two from base <code>B-1</code> and two from base <code>B+1</code>). Actually, there is a fifth candidate since the buggle that is on the same base than the empty spot can change its position, but that's not really helping.
ta: So, at each round, the வெறுமை spot is on one காரம் (say <code>B</code>), and you should decide which buggle enters that வெறுமை spot. There is நான்கு, நாலடி, நான்கடி candidates (two இருந்து காரம் <code>B-1</code> and two இருந்து காரம் <code>B+1</code>). Actually, there is a fifth candidate since the buggle that is on the same காரம் than the வெறுமை spot can change its position, but that's not really helping.

source: The Naïve algorithm
ta: The Naïve படிமுறை

source: In this exercise, we will first explore a very simple algorithm. To decide which of the four candidate buggles should enter the empty spot, we first restrict ourselves and decide that buggles can only turn clockwise. Then, from the two remaining candidates, we pick the one that has the largest distance to cover to reach its base (turning clockwise). Click on the demo button: this works rather well in practice.
ta: In this exercise, we will first explore a very simple algorithm. பெறுநர் decide which of the நான்கு, நாலடி, நான்கடி candidate buggles should enter the வெறுமை spot, we first restrict ourselves and decide that buggles can only turn clockwise. Then, இருந்து the two remaining candidates, we pick the one that has the largest distance பெறுநர் cover பெறுநர் reach its காரம் (turning clockwise). Click on the demo button: this works rather well in practice.

source: It's hard to find a simpler algorithm for this problem: While it's not sorted, search for the base containing the candidate buggles: if the hole is in base <code>B</code>, it's the base <code>B+1</code>, modulo the amount of bases. Then, compute the distance that each buggle of that base still has to run to reach its base (0 if it's already home). Once you found the buggle that should enter the empty spot, just use the <code>move</code> method on it, and iterate.
ta: It's hard பெறுநர் கண்டுபிடி a simpler படிமுறை க்கு this problem: While it's not sorted, தேடல் க்கு the காரம் containing the candidate buggles: if the hole is in காரம் <code>B</code>, it's the காரம் <code>B+1</code>, modulo the amount of bases. Then, compute the distance that each buggle of that காரம் still has பெறுநர் ஓடு பெறுநர் reach its காரம் (0 if it's already home). Once you found the buggle that should enter the வெறுமை spot, just use the <code>move</code> method on it, and iterate.

source: The main difficulty should be to get the few equations right: determining the base next to the hole should be easy, but determining the distance that a player has to cover may reveal a bit more challenging. Don't hesitate to draw pictures on a paper to cover all possible cases. It should not be that difficult either: there is not that many cases after all.
ta: The main difficulty should be பெறுநர் get the few equations வலது: determining the காரம் அடுத்தது பெறுநர் the hole should be easy, but determining the distance that a player has பெறுநர் cover சி-வைகாசி reveal a துணுக்கு more challenging. Don't hesitate பெறுநர் draw pictures on a paper பெறுநர் cover அனைத்தும் possible cases. It should not be that difficult either: there is not that many cases after all.

source: Selection Baseball
ta: தேர்வு Baseball

source: The previous algorithm is very pleasant: it's rather simple and rather fast to implement, but unfortunately, it is also rather wrong! In some cases, it never stops, which is obviously bad. If you don't believe it, just copy paste your previous code, and hit the run button. The first world of this exercise is one of these unfortunate situations that drives our previous algorithm crazy.
ta: The previous படிமுறை is very pleasant: it's rather simple and rather fast பெறுநர் implement, but unfortunately, it is also rather wrong! In some cases, it ஒருபோதும் stops, which is obviously bad. If you don't believe it, just நகலெடு ஒட்டு your previous code, and hit the ஓடு button. The first world of this exercise is one of these unfortunate situations that drives our previous படிமுறை crazy.

source: So we have to find another algorithm, preferably one that works in all cases.
ta: So we have பெறுநர் கண்டுபிடி another algorithm, preferably one that works in அனைத்தும் cases.

source: For that, the best solution is to start from a well known algorithm instead of trying to invent a new one from scratch as we just did. When you think a bit about this problem, this can is very similar to a sorting problem: Just make sure that the players are sorted by their colors and you're set. And while we are at it, let's generalize the game to allow more that 4 bases.
ta: க்கு that, the best நீர்மக்கூழ் is பெறுநர் தொடங்கு இருந்து a well known படிமுறை instead of trying பெறுநர் invent a புதிய one இருந்து scratch அச் we just did. When you think a துணுக்கு பற்றி this problem, this can is very similar பெறுநர் a sorting problem: Just make sure that the players அரே sorted by their colors and you're set. And while we அரே at it, let's generalize the game பெறுநர் allow more that 4 bases.

source: Let's adapt the selection sort to our situation. The big lines of the algorithm is then "for each base, select the players that should occupy this base and make sure that they come to their position". This way, we will grow an sorted area where all players are already sorted (and never changed) while the unsorted area shrinks.
ta: Let's adapt the தேர்வு வரிசைப்படுத்து பெறுநர் our situation. The big வரிகள் of the படிமுறை is then "for each base, தேர்ந்தெடு the players that should occupy this காரம் and make sure that they come பெறுநர் their position". This way, we will grow an sorted area where அனைத்தும் players அரே already sorted (and ஒருபோதும் changed) while the unsorted area shrinks.

source: Selecting the player should be no problem; Do not hesitate to define some methods such as <code>findPlayer()</code> or <code>findPlayerBase()</code>. This will ensure that your code remains understandable.
ta: Selecting the player should be இல்லை problem; Do not hesitate பெறுநர் define some முறைகள் such அச் <code>findPlayer()</code> or <code>findPlayerBase()</code>. This will ensure that your குறியீடு remains understandable.

source: The most problematic aspect is to move the selected players into position. For that, you have to move the hole to the position where the player is, and then move both the player and the hole to the base that is next to the player's goal (probably in a loop), and finally put the player in the right position of its target base.
ta: The பெரும்பாலானவை problematic aspect is பெறுநர் move the தேர்ந்தெடுக்கப்பட்டது players into position. க்கு that, you have பெறுநர் move the hole பெறுநர் the position where the player is, and then move both the player and the hole பெறுநர் the காரம் that is அடுத்தது பெறுநர் the player's goal (probably in a loop), and finally put the player in the வலது position of its target base.

source: As often in programming, the devil is in the details: there is a bunch of corner cases that you should detect and deal with correctly, such as the cases where the player is already in the base (but not in the position that you would like), or when the hole is on the right of the player (probably when you sort the first base). But you will find and hunt these while debugging your code.
ta: அச் often in programming, the devil is in the details: there is a bunch of corner cases that you should detect and deal with correctly, such அச் the cases where the player is already in the காரம் (but not in the position that you would like), or when the hole is on the வலது of the player (probably when you வரிசைப்படுத்து the first base). But you will கண்டுபிடி and hunt these while debugging your code.

source: The good point of adapting the selection sort to the baseball problem is that we know that it works (provided that our adaptation is correct). That's much better than the first naive algorithm, that was unable to converge to the solution in some situations. But actually, the selection sort is not perfect either as it requires a lot of swaps: we have to bring the hole to the selected player and then both the player and hole in position, and more. We can do better.
ta: The good புள்ளியம் of adapting the தேர்வு வரிசைப்படுத்து பெறுநர் the baseball problem is that we know that it works (provided that our adaptation is correct). That's much better than the first naive algorithm, that was unable பெறுநர் converge பெறுநர் the நீர்மக்கூழ் in some situations. But actually, the தேர்வு வரிசைப்படுத்து is not perfect either அச் it requires a நிறைய of swaps: we have பெறுநர் bring the hole பெறுநர் the தேர்ந்தெடுக்கப்பட்டது player and then both the player and hole in position, and more. We can do better.

source: For example, each player can run quite a long way from its initial position to its target solution. Instead, it may be more interesting to split the field in two parts: one on the left where all players are sorted relatively to each others, and one on the right where the players are still at their initial positions. Then, at each iteration, we take the player at the border between the sorted and unsorted areas (that is, the left-most player of the unsorted area) and move it to the left (within the sorted area) until it reaches its position (that is, until the position where it's bigger that its left neighbor). This would at least reduce the travel of players to the sorted area as we use the first one on the border.
ta: க்கு example, each player can ஓடு quite a long way இருந்து its initial position பெறுநர் its target solution. Instead, it சி-வைகாசி be more interesting பெறுநர் split the புலம் in two parts: one on the இடது where அனைத்தும் players அரே sorted relatively பெறுநர் each others, and one on the வலது where the players அரே still at their initial positions. Then, at each iteration, we take the player at the border between the sorted and unsorted areas (that is, the left-most player of the unsorted area) and move it பெறுநர் the இடது (within the sorted area) until it reaches its position (that is, until the position where it's bigger that its இடது neighbor). This would at least reduce the travel of players பெறுநர் the sorted area அச் we use the first one on the border.

source: Actually, that's exactly what an insertion sort would do: maintain a sorted area on the left, and put iteratively the player on the border to its position within the sorted area. This is good, as we know that our algorithm is not inherently flawed since we adapt a well known one.
ta: Actually, that's exactly what an insertion வரிசைப்படுத்து would do: maintain a sorted area on the left, and put iteratively the player on the border பெறுநர் its position within the sorted area. This is good, அச் we know that our படிமுறை is not inherently flawed since we adapt a well known one.
