Repository: oster/PLM
Catalog: l10n/missions/*.po
Languages: ta

source: We will now teach the buggle to explore its world. Its initial position is the bottom left corner, and it should visit any cells up to the top (coloring the ground on its path. The main loop of your code is something like:
ta: We will now teach the buggle பெறுநர் explore its world. Its initial position is the கீழே இடது corner, and it should visit any cells மேலே பெறுநர் the மேலே (coloring the ground on its path. The main loop of your குறியீடு is something like:

source: move brush down while we did not reach the final position move like a snake
ta: move மின்தொடி down while we did not reach the final position move like a snake

source: We thus have to write two specific methods: The first one returns a boolean indicating whether we are on a final position while the second moves one snake step forward.
ta: We thus have பெறுநர் write two specific methods: The first one returns a boolean indicating whether we அரே on a final position while the second moves one snake படி forward.

source: We reached the final position if and only if both conditions are true:
ta: We reached the final position if and only if both conditions அரே true:

source: We are facing a wall
ta: We அரே facing a wall

source: There is a wall on the north of the buggle. So, if the buggle is facing east, you should check whether there is a wall on the left, and if the buggle is facing west, you should check on the right side.
ta: There is a wall on the வடக்கு of the buggle. So, if the buggle is facing east, you should சரிபார் whether there is a wall on the left, and if the buggle is facing west, you should சரிபார் on the வலது side.

source: We can get the current heading of the buggle using the <code>getDirection()</code>, and we know whether it looks east using <code>getDirection() == [!scala|python|java]Direction.[/!]EAST</code> (WEST for west).
ta: We can get the மின்னோட்ட்ம், ஓட்டம் heading of the buggle using the <code>getDirection()</code>, and we know whether it looks கிழக்கு using <code>getDirection() == [!scala|python|java]Direction.[/!]EAST</code> (WEST க்கு west).

source: To check, nothing magical: you have to turn the buggle and check whether it is facing a wall afterward.
ta: பெறுநர் check, nothing magical: you have பெறுநர் turn the buggle and சரிபார் whether it is facing a wall afterward.

source: Then, a snake step can be achieved by moving one step forward if we are not facing a wall, and moving to the upper line else (i.e., if you look to the west facing a wall, you have to turn right, forward and turn right).
ta: Then, a snake படி can be achieved by moving one படி forward if we அரே not facing a wall, and moving பெறுநர் the upper வரி else (i.e., if you look பெறுநர் the மேற்கு facing a wall, you have பெறுநர் turn right, forward and turn right).

source: Hint: the main loop of your code must continue while the testing function returns false. There is two ways of writing it:
ta: குறிப்பு: the main loop of your குறியீடு must தொடரவும் while the testing சார்பு returns false. There is two ways of writing it:

source: [!python]You may prefer to write it as:[/!] [!java|scala|c]Since the exclamation mark (!) denotes the boolean negation in [!thelang], you may write it as:[/!]
ta: [!python]You சி-வைகாசி prefer பெறுநர் write it as:[/!] [!java|scala|c]Since the exclamation mark (!) denotes the boolean negation in [!thelang], you சி-வைகாசி write it as:[/!]

source: The goal of this serie of exercises is to let the buggle traverse its world. It must number the cells it walks on to show its traversal order.
ta: The goal of this serie of exercises is பெறுநர் let the buggle traverse its world. It must எண் the cells it walks on பெறுநர் காட்டு its traversal order.

source: The main loop of your code should be something like:
ta: The main loop of your குறியீடு should be something like:

source: while we are not on the final position go to the next position label the cell with its number
ta: while we அரே not on the final position go பெறுநர் the அடுத்தது position சிட்டை the கலன் with its number

source: In contrary to the exercises we saw so far, we won't use the <code>forward()</code>, <code>backward()</code> and similar methods. Instead, we will compute the coordinate of the next buggle position and use the <code>setPos(x, y)</code> method to <i>teleport</i> the buggle directly to this position. For example, <code>setPos(3, 5)</code> teleports the buggle to the cell where x=3 and y=5.
ta: In contrary பெறுநர் the exercises we saw so far, we won't use the <code>forward()</code>, <code>backward()</code> and similar methods. Instead, we will compute the ஆயம் of the அடுத்தது buggle position and use the <code>setPos(x, y)</code> method பெறுநர் <i>teleport</i> the buggle directly பெறுநர் this position. க்கு example, <code>setPos(3, 5)</code> teleports the buggle பெறுநர் the கலன் where x=3 and y=5.

source: Your first task is thus to write a boolean function indicating whether the buggle reached the final position or not, ie if it reached the bottom right corner of the world. For this, you can use <code>getWorldWidth()</code> and <code>getWorldHeight()</code> which return respectively the world's width and height. Your test is about comparing the buggle's current position (that you can access with <code>getX()</code> and <code>getY()</code>) to the world dimensions.
ta: Your first task is thus பெறுநர் write a boolean சார்பு indicating whether the buggle reached the final position or not, ie if it reached the கீழே வலது corner of the world. க்கு this, you can use <code>getWorldWidth()</code> and <code>getWorldHeight()</code> which return respectively the world's width and height. Your தேர்வு is பற்றி comparing the buggle's மின்னோட்ட்ம், ஓட்டம் position (that you can access with <code>getX()</code> and <code>getY()</code>) பெறுநர் the world dimensions.

source: Beware, the first line and column are numbered 0 and not 1, and the point (0,0) is on the top left corner. This may seem surprising, but it is very often so in Computer Science.
ta: Beware, the first வரி and நெடுவரிசை அரே numbered 0 and not 1, and the புள்ளியம் (0,0) is on the மேலே இடது corner. This சி-வைகாசி seem surprising, but it is very often so in கணிப்பொறி, கணிணி Science.

source: Then, you have to write the code to reach the next position. In this exercise, you have to traverse the world row after row. So, if you are at the bottom of a row, you have to move to the top of next row. Else, you have to move to the cell below.
ta: Then, you have பெறுநர் write the குறியீடு பெறுநர் reach the அடுத்தது position. In this exercise, you have பெறுநர் traverse the world நிரை after row. So, if you அரே at the கீழே of a row, you have பெறுநர் move பெறுநர் the மேலே of அடுத்தது row. Else, you have பெறுநர் move பெறுநர் the கலன் below.

source: At this point, you can launch your program to check that the buggle correctly traverse the world in the expected order, and that it stops when it has to. Use the <b>stop</b> button if the buggle does not stop correctly.
ta: At this point, you can launch your திட்டம் பெறுநர் சரிபார் that the buggle correctly traverse the world in the expected order, and that it stops when it has to. Use the <b>stop</b> button if the buggle does not நிறுத்து correctly.

source: It is now time to write down the cell numbers. For that, you will need a counter initialiser to zero at the beginning of your code, and incremented by one at each step (for example with <code>counter += 1;</code>). Then, you have to use <code>writeMessage()</code> to write the value on the ground.
ta: It is now time பெறுநர் write down the கலன் numbers. க்கு that, you will need a counter initialiser பெறுநர் சுழிமம் at the beginning of your code, and incremented by one at each படி (for example with <code>counter += 1;</code>). Then, you have பெறுநர் use <code>writeMessage()</code> பெறுநர் write the மதிப்பு on the ground.

source: You probably need to write the first [!java|scala|c]or last [/!]value out of the main loop [!java|scala|c], depending on whether you prefer to use a <code>while</code> or a <code>do/while</code> one[/!].
ta: You probably need பெறுநர் write the first [!java|scala|c]or last [/!]value out of the main loop [!java|scala|c], depending on whether you prefer பெறுநர் use a <code>while</code> or a <code>do/while</code> one[/!].

source: You once again have to let the buggle traverse the world numbering the cells on its way, but the goal of this exercise is to write a line traversal. Most of the code you wrote for previous exercise remains usable here. Simply, the method computing the coordinates of the next buggle position has to be correctly updated: if you are at the right of a line, you have to go to the beginning of the next one. If not, you have to go to the right cell.
ta: You once again have பெறுநர் let the buggle traverse the world numbering the cells on its way, but the goal of this exercise is பெறுநர் write a வரி traversal. பெரும்பாலானவை of the குறியீடு you wrote க்கு previous exercise remains usable here. Simply, the method computing the coordinates of the அடுத்தது buggle position has பெறுநர் be correctly updated: if you அரே at the வலது of a line, you have பெறுநர் go பெறுநர் the beginning of the அடுத்தது one. If not, you have பெறுநர் go பெறுநர் the வலது cell.

source: This time, you are asked to traverse the world one diagonal after the other. Have a look at the objective world for more details on the requested traversal order.
ta: This time, you அரே asked பெறுநர் traverse the world one மூலைவிட்டம் after the other. Have a look at the objective world க்கு more details on the requested traversal order.

source: You may find useful to use an integer variable <code>diag</code> storing the number of the diagonal you are traversing.
ta: You சி-வைகாசி கண்டுபிடி useful பெறுநர் use an முழு எண் variable <code>diag</code> storing the எண் of the மூலைவிட்டம் you அரே traversing.

source: This time, you have to zigzag on the way up. Have a look at the objective world for more details on the requested traversal order.
ta: This time, you have பெறுநர் zigzag on the way up. Have a look at the objective world க்கு more details on the requested traversal order.

source: You buggles got stuck in the mines of Moria! Some rocks are blocking the exit, and you will have to clear your way to the exit. Well of course these are only baggles and you could simply walk away, but it will be easier to program the buggles so that they move those "rocks" than convincing them to walk away without solving the problem. Dwarfs are sometimes really stubborns...
ta: You buggles got stuck in the mines of Moria! Some rocks அரே blocking the exit, and you will have பெறுநர் clear your way பெறுநர் the exit. Well of course these அரே only baggles and you could simply walk away, but it will be easier பெறுநர் திட்டம் the buggles so that they move those "rocks" than convincing them பெறுநர் walk away without solving the problem. Dwarfs அரே sometimes really stubborns...

source: So, you have to find the first baggle blocking the exit (simply walk to the east until you are over a baggle), take it and move it back to the other side of the tunnel (walk to the west while you are not over a baggle, and then move back one step to the east and drop your baggle), and iterate until you find the exit (that is, the wall to the east side). Afterward, move out as in the objective world. That's only a few more steps away.
ta: So, you have பெறுநர் கண்டுபிடி the first baggle blocking the exit (simply walk பெறுநர் the கிழக்கு until you அரே வீச்சலகு a baggle), take it and move it பின் பெறுநர் the மற்றொன்று பக்கம் of the tunnel (walk பெறுநர் the மேற்கு while you அரே not வீச்சலகு a baggle, and then move பின் one படி பெறுநர் the கிழக்கு and drop your baggle), and iterate until you கண்டுபிடி the exit (that is, the wall பெறுநர் the கிழக்கு side). Afterward, move out அச் in the objective world. That's only a few more படிகள் away.

source: To make things worse, you have to write a program that works for every buggle, even if writing a specific program for each of them would be easier. It seems that using <code>while</code> loops is the only solution to move the buggles correctly.
ta: பெறுநர் make things worse, you have பெறுநர் write a திட்டம் that works க்கு every buggle, இரட்டை if writing a specific திட்டம் க்கு each of them would be easier. It seems that using <code>while</code> வளையங்கள் is the only நீர்மக்கூழ் பெறுநர் move the buggles correctly.

source: Once you manage to escape this trap, you can move forward to the next exercise. This exercise is a bit more complex, so you can also leave it for now and come back later if you don't get it right now.
ta: Once you manage பெறுநர் escape this trap, you can move forward பெறுநர் the அடுத்தது exercise. This exercise is a துணுக்கு more complex, so you can also leave it க்கு now and come பின் later if you don't get it வலது now.

source: This set of activities lets you play with Langton's ants, that are 2D turing machines. They constitute very simple application problems, achievable by beginners, and open the door to an amazing world.
ta: This கணம் of activities lets you play with Langton's ants, that அரே 2D turing machines. They constitute very simple application problems, achievable by beginners, and திற the door பெறுநர் an amazing world.

source: This mechanism were invented in 1986 by Chris Langton, and later generalized in several ways (as we shall see in the next exercises). It was proven that Turmites and Turing machines are of equal power: An ant's trajectory can be used to compute any boolean circuit, and thus that an ant is capable of universal computation. Put simply, any possible computation can be achieved using a turmite as a computing device. Yet another subject of fascination...
ta: This mechanism were invented in 1986 by Chris Langton, and later generalized in several ways (as we shall see in the அடுத்தது exercises). It was proven that Turmites and Turing machines அரே of equal power: An ant's எறிபாதை can be used பெறுநர் compute any boolean circuit, and thus that an ant is capable of universal computation. Put simply, any possible computation can be achieved using a turmite அச் a computing device. Yet another பொருள் of fascination...

source: Multicolor Langton's ants were discovered in 1995 by Propp et Al. Another funny fact is that the ants which name is a list of consecutive pair of identical letters (LL and RR) produce symmetric patterns. This fact was even formally proved.
ta: Multicolor Langton's ants were discovered in 1995 by Propp et Al. Another funny fact is that the ants which பெயர் is a பட்டியல் of consecutive பேரிக்காய் of identical letters (LL and RR) produce சமச்சீர் patterns. This fact was இரட்டை formally proved.

source: Check the corresponding wikipedia web page, of which this exercise is inspired, for further details.
ta: சரிபார் the corresponding wikipedia விரலிடைத் தோல் page, of which this exercise is inspired, க்கு further details.

source: What can I do to improve this PLM universe?
ta: What can I do பெறுநர் improve this PLM universe?

source: As usual, there are several things that could be done in the code of this universe to improve it:
ta: அச் usual, there அரே several things that could be முடிந்தது in the குறியீடு of this அண்டம் பெறுநர் improve it:

source: We are probably missing some good exercises. The turmite creator exercise is a bit harsh: we could introduce the patterns in a more friendly manner.
ta: We அரே probably missing some good exercises. The turmite creator exercise is a துணுக்கு harsh: we could introduce the patterns in a more friendly manner.

source: We may want to write an exercise on the busy beaver, maybe?
ta: We சி-வைகாசி want பெறுநர் write an exercise on the busy beaver, maybe?

source: Discover the Langton's ants, that are 2D turing machines.
ta: கண்டுபிடி the Langton's ants, that அரே 2D turing machines.

source: These activities are very simple application problems, achievable by beginners, and open the door to an amazing world.
ta: These activities அரே very simple application problems, achievable by beginners, and திற the door பெறுநர் an amazing world.

source: In this exercise, you will turn your buggle into a <i>Langton's ant</i>. These artificial little animals are very interesting because they are given simple rules that depend only on their local environment, and after a period of apparent chaotic behavior, a general pattern <i>emerges</i>.
ta: In this exercise, you will turn your buggle into a <i>Langton's ant</i>. These artificial little animals அரே very interesting because they அரே given simple rules that depend only on their local environment, and after a காலசுழற்சி of apparent chaotic behavior, a பொது pattern <i>emerges</i>.

source: The rules are absolutely trivial: to compute what the next step should be, you should check the current color of the ground (using <code>getGroundColor()</code>). If it's white, change it to black, turn right and move forward by one cell. If the ground is currently black, change it to white, turn left and move forward by one cell.
ta: The rules அரே absolutely trivial: பெறுநர் compute what the அடுத்தது படி should be, you should சரிபார் the மின்னோட்ட்ம், ஓட்டம் color of the ground (using <code>getGroundColor()</code>). If it's white, change it பெறுநர் black, turn வலது and move forward by one cell. If the ground is currently black, change it பெறுநர் white, turn இடது and move forward by one cell.

source: It's hard to come up with simpler rules isn't it? Well, let's go and code it now. You have to complete the <code>step()</code> method, which encodes the behavior of the ant at each step. You will probably use the <code>getGroundColor()</code> method to retrieve the color of the cell on which the ant is currently. Colors of interest are simply named <code>Color.black</code> and <code>Color.white</code>.
ta: It's hard பெறுநர் come மேலே with simpler rules isn't it? Well, let's go and குறியீடு it now. You have பெறுநர் complete the <code>step()</code> method, which encodes the behavior of the ant at each step. You will probably use the <code>getGroundColor()</code> method பெறுநர் retrieve the color of the கலன் on which the ant is currently. Colors of interest அரே simply named <code>Color.black</code> and <code>Color.white</code>.

source: To compare colors, you cannot use the equal signs (==), because these things are not scalar values but objects. Instead, you need to write something like the following:
ta: பெறுநர் compare colors, you cannot use the equal signs (==), because these things அரே not அளவெண் values but objects. Instead, you need பெறுநர் write something like the following:

source: Color c /* = some initialization */; if (c.equals(Color.black)) { /* that's equal */ } else { /* that was not equal */ }
ta: Color c /* = some முன்னமைவு */; if (c.equals(Color.black)) { /* that's equal */ } else { /* that was not equal */ }

source: Changing the ground color is not difficult, but a bit long: you have to change the brush color of your buggle, set the brush down (to mark the current cell -- with <code>brushDown()</code>), and set the brush back up (with <code>brushUp()</code>) to avoid further issues when the buggle will move. You are naturally free of organizing your code the way you want, but you may want to write a <code>setGroundColor(color)</code> method to factorize things a bit.
ta: Changing the ground color is not difficult, but a துணுக்கு long: you have பெறுநர் change the மின்தொடி color of your buggle, கணம் the மின்தொடி down (to mark the மின்னோட்ட்ம், ஓட்டம் கலன் -- with <code>brushDown()</code>), and கணம் the மின்தொடி பின் மேலே (with <code>brushUp()</code>) பெறுநர் avoid further issues when the buggle will move. You அரே naturally free of organizing your குறியீடு the way you want, but you சி-வைகாசி want பெறுநர் write a <code>setGroundColor(color)</code> method பெறுநர் factorize things a bit.

source: As you can see from the execution of this exercise, the interest in this algorithm is that after about 10000 steps of relative chaotic behavior, the ant start building a regular pattern. This emergence of a regular pattern from the chaos is rather fascinating, isn't it? Move on to the next exercise to see more of them.
ta: அச் you can see இருந்து the execution of this exercise, the interest in this படிமுறை is that after பற்றி 10000 படிகள் of relative chaotic behavior, the ant தொடங்கு building a regular pattern. This emergence of a regular pattern இருந்து the chaos is rather fascinating, isn't it? Move on பெறுநர் the அடுத்தது exercise பெறுநர் see more of them.

source: There is several ways to extend the concept of Langton's ant. In this exercise, we explore first one, using more than two colors. It remains very similar to the base case: the behavior at each step still depends on the ground color, but you have more than 2 possibilities. It allows to have more than one kind of ant, depending on what you decide to do for each color. For example, the ant LRL takes 3 colors. It turns left on the first color, right on the second one and left on the third color. According to this definition, the basic ant is a RL (since it turns right on white cells and left on black ones).
ta: There is several ways பெறுநர் extend the concept of Langton's ant. In this exercise, we explore first one, using more than two colors. It remains very similar பெறுநர் the காரம் case: the behavior at each படி still depends on the ground color, but you have more than 2 possibilities. It allows பெறுநர் have more than one kind of ant, depending on what you decide பெறுநர் do க்கு each color. க்கு example, the ant LRL takes 3 colors. It turns இடது on the first color, வலது on the second one and இடது on the third color. According பெறுநர் this definition, the அடிப்படை ant is a RL (since it turns வலது on வெள்ளை cells and இடது on கருப்பு ones).

source: Some of these ants draw fascinating patterns (switch the world to see them): LLRR build a symmetric figure resembling loosely to a ball, LRRRRRLLR draws a square, LLRRRLRLRLLR draws a convoluted regular pattern after a period of seemingly chaotic behavior, and RRLLLRLLLRRR seems to fill a hour glass...
ta: Some of these ants draw fascinating patterns (switch the world பெறுநர் see them): LLRR உருவாக்கு a சமச்சீர் figure resembling loosely பெறுநர் a ball, LRRRRRLLR draws a square, LLRRRLRLRLLR draws a convoluted regular pattern after a காலசுழற்சி of seemingly chaotic behavior, and RRLLLRLLLRRR seems பெறுநர் fill a hour glass...

source: Changing your buggle into a generic Langton's ant is not very complicated, although it is not completely trivial. As previously, you have to write a <code>step</code> function. But this time, it receives two arrays as parameters. The first one defines the rules to follow depending on the ground color while the second one gives the sequence of colors to use. For example, the basic ant would have [!java]<code>{'R', 'L'}</code> and <code>{Color.white, Color.black}</code>[/!] [!python]<code>['R', 'L']</code> and <code>[Color.white, Color.black]</code>[/!] [!scala]<code>Array('R', 'L')</code> and <code>Array(Color.white, Color.black)</code>[/!] as arguments.
ta: Changing your buggle into a generic Langton's ant is not very complicated, although it is not completely trivial. அச் previously, you have பெறுநர் write a <code>step</code> function. But this time, it receives two arrays அச் parameters. The first one வரையறுக்கிறது the rules பெறுநர் follow depending on the ground color while the second one gives the வரிசை of colors பெறுநர் use. க்கு example, the அடிப்படை ant would have [!java]<code>{'R', 'L'}</code> and <code>{Color.white, Color.black}</code>[/!] [!python]<code>['R', 'L']</code> and <code>[Color.white, Color.black]</code>[/!] [!scala]<code>Array('R', 'L')</code> and <code>Array(Color.white, Color.black)</code>[/!] அச் arguments.
