Repository: oster/PLM
Catalog: l10n/engine/*.po
Languages: ta

source: The PLM can save your data anonymously on remote servers. That way, you can retrieve your session from your anonymous tag from any connected computer. This anonymous data also helps scientists understanding how people learn programming. No nominative information is stored, only the source code written to solve the challenges.
ta: தொலைநிலை சேவையகங்களில் உங்கள் தரவை அநாமதேயமாக சேமிக்க பி.எல்.எம். அந்த வழியில், நீங்கள் இணைக்கப்பட்ட எந்த கணினியிலிருந்தும் உங்கள் அநாமதேய குறிச்சொல்லிலிருந்து உங்கள் அமர்வை மீட்டெடுக்க முடியும். இந்த அநாமதேய தரவு விஞ்ஞானிகளுக்கு மக்கள் எவ்வாறு கற்றுக்கொள்கிறார்கள் என்பதைப் புரிந்துகொள்ள உதவுகிறது நிரலாக்க. பெயரிடப்பட்ட தகவல்கள் எதுவும் சேமிக்கப்படவில்லை, மூலக் குறியீடு மட்டுமே எழுதப்பட்டுள்ளது சவால்களை தீர்க்க.

source: Do you want to store your data online?
ta: உங்கள் தரவை ஆன்லைனில் சேமிக்க விரும்புகிறீர்களா?

source: Ok, save my data online
ta: சரி, எனது தரவை ஆன்லைனில் சேமிக்கவும்

source: No, keep everything local
ta: இல்லை, எல்லாவற்றையும் உள்ளக வைத்திருங்கள்

source: Let me decide later
ta: பின்னர் முடிவு செய்கிறேன்

source: Launch the execution of your code
ta: உங்கள் குறியீட்டின் செயல்பாட்டைத் தொடங்கவும்

source: Cannot launch the execution right now. Wait a bit, or interrupt current activity with the Stop button.
ta: சாவுஒறுப்பு இப்போது தொடங்க முடியாது. சிறிது காத்திருங்கள், அல்லது நிறுத்த பொத்தானைக் கொண்டு தற்போதைய செயல்பாட்டை குறுக்கிடவும்.

source: Execute one step of your code
ta: உங்கள் குறியீட்டின் ஒரு படிநிலையை இயக்கவும்

source: Impossible to step your code now. Need to stop the execution first?
ta: உங்கள் குறியீட்டை இப்போது காலடி எடுத்து வைக்க இயலாது. முதலில் சாவுஒறுப்பு நிறுத்த வேண்டுமா?

source: Stop your code
ta: உங்கள் குறியீட்டை நிறுத்துங்கள்

source: No execution to stop right now
ta: இப்போதே நிறுத்த எந்த மரணதண்டனையும் இல்லை

source: Switch to another exercise
ta: மற்றொரு உடற்பயிற்சிக்கு மாறவும்

source: Please choose the user you want to use
ta: நீங்கள் பயன்படுத்த விரும்பும் பயனரைத் தேர்வுசெய்க

source: User {0} already selected.
ta: பயனர் {0} ஏற்கனவே தேர்ந்தெடுக்கப்பட்டார்.

source: User {0} now selected.
ta: பயனர் {0} இப்போது தேர்ந்தெடுக்கப்பட்டுள்ளது.

source: Operation canceled by user request
ta: பயனர் கோரிக்கையால் செயல்பாடு ரத்து செய்யப்பட்டது

source: Operation canceled as requested by user.
ta: பயனர் கோரியபடி செயல்பாடு ரத்து செய்யப்பட்டது.

source: PLM - Mission Editor (modified)
ta: பி.எல்.எம் - மிசன் எடிட்டர் (மாற்றியமைக்கப்பட்டது)

source: PLM - Mission Editor
ta: பி.எல்.எம் - மிசன் எடிட்டர்

source: Error while reading {0}
ta: {0} படிக்கும்போது பிழை

source: You did not save you changes. Do you want to save it before quiting?
ta: உங்கள் மாற்றங்களை நீங்கள் சேமிக்கவில்லை. வெளியேறுவதற்கு முன்பு அதை சேமிக்க விரும்புகிறீர்களா?

source: Save or loose your change?
ta: உங்கள் மாற்றத்தை சேமிக்கவா?

source: Open Mission...
ta: திறந்த பணி ...

source: You did not save you changes. Do you want to save it before opening another file?
ta: நீங்கள் மாற்றங்களைச் சேமிக்கவில்லை. மற்றொரு கோப்பைத் திறப்பதற்கு முன்பு அதை சேமிக்க விரும்புகிறீர்களா?

source: HTML files
ta: உஉகுமொ கோப்புகள்

source: You chose a translated mission text for edition ({0}). This is wrong. The translations should be handled with po4a in the PLM. Please refer to https://github.com/oster/PLM/wiki/Working-with-the-translations for more information. Proceed anyway?
ta: பதிப்பிற்கான மொழிபெயர்க்கப்பட்ட பணி உரையைத் தேர்ந்தெடுத்தீர்கள் ({0}). இது தவறு. மொழிபெயர்ப்புகளை பி.எல்.எம்மில் PO4A உடன் கையாள வேண்டும். மேலும் தகவலுக்கு https://github.com/oster/plm/wiki/working-with-the-translations ஐப் பார்க்கவும். எப்படியும் தொடரவா?

source: This is a translated mission text
ta: இது மொழிபெயர்க்கப்பட்ட பணி உரை

source: Quit Map Editor
ta: வரைபட எடிட்டரை விட்டு வெளியேறவும்

source: Create New Map
ta: புதிய வரைபடத்தை உருவாக்கவும்

source: Open Map...
ta: திறந்த வரைபடம் ...

source: PLM map files
ta: பி.எல்.எம் வரைபட கோப்புகள்

source: Property
ta: சொத்து

source: Value
ta: மதிப்பு

source: World name
ta: உலக பெயர்

source: World width
ta: உலக அகலம்

source: World height
ta: உலக உயரம்

source: Selected cell X
ta: தேர்ந்தெடுக்கப்பட்ட செல் ஃச்

source: Selected cell Y
ta: தேர்ந்தெடுக்கப்பட்ட செல் ஒய்

source: Ground color (name or r/g/b)
ta: தரை நிறம் (பெயர் அல்லது ஆர்/சி/பி)

source: Top wall?
ta: மேல் சுவர்?

source: Left wall?
ta: இடது சுவர்?

source: Baggle?
ta: பேக்லே?

source: Buggle name
ta: பிழையான பெயர்

source: Buggle direction (N|S|E|W)
ta: பிழையான திசை (n | s | இ | w)

source: Buggle color (name or r/g/b)
ta: பிழையான நிறம் (பெயர் அல்லது ஆர்/சி/பி)

source: Brush color (name or r/g/b)
ta: தூரிகை நிறம் (பெயர் அல்லது ஆர்/சி/பி)

source: black
ta: கருப்பு

source: blue
ta: நீலம்

source: cyan
ta: சியான்

source: dark grey
ta: இருண்ட சாம்பல்

source: grey
ta: சாம்பல்

source: green
ta: பச்சை

source: light grey
ta: வெளிர் சாம்பல்

source: magenta
ta: மெசந்தா

source: orange
ta: ஆரஞ்சு

source: pink
ta: இளஞ்சிவப்பு

source: red
ta: சிவப்பு

source: white
ta: வெள்ளை

source: yellow
ta: மஞ்சள்

source: NORTH
ta: வடக்கு

source: EAST
ta: கிழக்கு

source: SOUTH
ta: தெற்கு

source: WEST
ta: மேற்கு

source: Exception {0}: {1}
ta: விதிவிலக்கு {0}: {1}

source: Sorry Dave, I cannot let you use penDown() here. Buggles have brushes, not pens. Use brushDown() instead.
ta: மன்னிக்கவும் டேவ், இங்கே பெண்டவுன் () ஐப் பயன்படுத்த அனுமதிக்க முடியாது. பங்குகள் தூரிகைகள் உள்ளன, பேனாக்கள் அல்ல. அதற்கு பதிலாக பிரச் பேரூர் () ஐப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use penUp() here. Buggles have brushes, not pens. Use brushUp() instead.
ta: மன்னிக்கவும் டேவ், இங்கே பெனப் () ஐப் பயன்படுத்த அனுமதிக்க முடியாது. பங்குகள் தூரிகைகள் உள்ளன, பேனாக்கள் அல்ல. அதற்கு பதிலாக துலக்குதல் () ஐப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use Left() with an uppercase. Use left() instead.
ta: மன்னிக்கவும் டேவ், இடது () ஐ ஒரு பெரிய எழுத்துடன் பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக இடது () பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use Right() with an uppercase. Use right() instead.
ta: மன்னிக்கவும் டேவ், ஒரு பெரிய எழுத்துடன் சரியான () ஐப் பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக சரியான () ஐப் பயன்படுத்தவும்.

source: You tried to access a cell with Y={0}, but the maximal Y in this world is {1}.
ta: நீங்கள் ஒய் = {0 with உடன் ஒரு கலத்தை அணுக முயற்சித்தீர்கள், ஆனால் இந்த உலகில் அதிகபட்ச ஒய் {0}.

source: You tried to access a cell with X={0}, but the maximal X in this world is {1}.
ta: நீங்கள் ஃச் = {0 with உடன் ஒரு கலத்தை அணுக முயற்சித்தீர்கள், ஆனால் இந்த உலகில் அதிகபட்ச ஃச் {0}.

source: You tried to set X to {0}, but the maximal X in this world is {1}.
ta: நீங்கள் ஃச் ஐ {0 bo ஆக அமைக்க முயற்சித்தீர்கள், ஆனால் இந்த உலகில் அதிகபட்ச ஃச் {0}.

source: You tried to set Y to {0}, but the maximal Y in this world is {1}.
ta: நீங்கள் ஒய் ஐ {0 பெறுநர் ஆக அமைக்க முயற்சித்தீர்கள், ஆனால் இந்த உலகில் அதிகபட்ச ஒய் {0}.

source: There is no baggle to pick up here.
ta: இங்கே எடுக்க எந்த பாக்கிலும் இல்லை.

source: You are already carrying a baggle.
ta: நீங்கள் ஏற்கனவே ஒரு பேக்கலை சுமந்து செல்கிறீர்கள்.

source: Its value is 'null', which is never good.
ta: அதன் மதிப்பு 'பூச்யம்', இது ஒருபோதும் நல்லதல்ல.

source: It should not carry that baggle.
ta: அது அந்த பாக்கலை சுமக்கக்கூடாது.

source: It is not carrying any baggle.
ta: இது எந்த பேக்கிலையும் சுமக்கவில்லை.

source: Unexpected issue: {0}
ta: எதிர்பாராத சிக்கல்: {0}

source: It encountered an unexpected issue (such as bumping into a wall).
ta: இது எதிர்பாராத சிக்கலை எதிர்கொண்டது (ஒரு சுவரில் மோதுவது போன்றவை).

source: It did not encounter the expected issue: {0}
ta: இது எதிர்பார்த்த சிக்கலை எதிர்கொள்ளவில்லை: {0}

source: It did not encounter an issue as expected (such as bumping into a wall).
ta: இது எதிர்பார்த்தபடி ஒரு சிக்கலை எதிர்கொள்ளவில்லை (ஒரு சுவரில் மோதியது போன்றவை).

source: Its position is ({0},{1}); expected: ({2},{3}).
ta: அதன் நிலை ({0}, {1}); எதிர்பார்க்கப்படுகிறது: ({2}, {3}).

source: Its direction is {0}; expected: {1}.
ta: அதன் திசை {0}; எதிர்பார்க்கப்படுகிறது: {1}.

source: Its color is {0}; expected: {1}.
ta: அதன் நிறம் {0}; எதிர்பார்க்கப்படுகிறது: {1}.

source: The color of its brush is {0}; expected: {1}.
ta: அதன் தூரிகையின் நிறம் {0}; எதிர்பார்க்கப்படுகிறது: {1}.

source: {0}: The path to the map on disk should not include the .map extension (or it won''t work in jarfiles). Please fix your exercise.
ta: {0}: வட்டில் வரைபடத்திற்கான பாதையில் .map நீட்டிப்பு இருக்கக்கூடாது (அல்லது அது சார்ஃபைல்களில் வேலை செய்யாது). உங்கள் உடற்பயிற்சியை சரிசெய்யவும்.

source: {0}.map: this file does not seem to be a serialized BuggleWorld (the file is empty).
ta: {0} .மேப்: இந்த கோப்பு சீரியல் செய்யப்பட்ட பிழைத்திருத்தமாகத் தெரியவில்லை (கோப்பு காலியாக உள்ளது).

source: {0}.map: This file does not seem to be a serialized BuggleWorld (malformated first line: {1}).
ta: {0} .மேப்: இந்த கோப்பு ஒரு சீரியல் பிழைத்திருத்தமாகத் தெரியவில்லை (தவறாக முதல் வரி: {1}).

source: {0}.map: End of file reached before world size specification.
ta: {0} .மேப்: உலக அளவு விவரக்குறிப்புக்கு முன் கோப்பின் முடிவு.

source: {0}.map:1: Expected ''Size: NNxMM'' but got ''{0}''.
ta: {0} .மேப்: 1: எதிர்பார்க்கப்படும் '' அளவு: nnxmm '' ஆனால் '' {0} '' கிடைத்தது.

source: Cannot put a buggle on coordinate {0},{1}: that''s out of the world.
ta: ஒருங்கிணைப்பு {0}, {1} இல் ஒரு பிழையை வைக்க முடியாது: அது உலகத்திற்கு வெளியே உள்ளது.

source: Invalid buggle''s direction: {0}
ta: தவறான பிழையான 'இன் திசை: {0}

source: Invalid buggle''s color name: {0}
ta: தவறான பிழையான 'இன் வண்ண பெயர்: {0}

source: Cannot define a cell on coordinate {0},{1}: that''s out of the world.
ta: ஒருங்கிணைப்பு {0}, {1} இல் ஒரு கலத்தை வரையறுக்க முடியாது: அது உலகத்திற்கு வெளியே உள்ளது.

source: Invalid color name: {0}
ta: தவறான வண்ண பெயர்: {0}

source: Expecting ''baggle'' or ''nobaggle'' but got {0} instead.
ta: '' பேக்லே '' அல்லது '' நோபாகல் '' என்று எதிர்பார்க்கிறது, ஆனால் அதற்கு பதிலாக {0} கிடைத்தது.

source: Expecting ''topwall'' or ''notopwall'' but got {0} instead.
ta: '' டாப்வால் '' அல்லது '' நோட்டோப்வால் '' என்று எதிர்பார்க்கிறது, ஆனால் அதற்கு பதிலாக {0} கிடைத்தது.

source: Expecting ''leftwall'' or ''noleftwall'' but got {0} instead.
ta: '' லெப்ட்வால் '' அல்லது '' நோல்ப்ட்வால் '' என்று எதிர்பார்க்கிறது, ஆனால் அதற்கு பதிலாக {0} கிடைத்தது.

source: The cell {0},{1} seem to be defined more than once. At least, there is two baggles here, which is not allowed.
ta: செல் {0}, {1} ஒன்றுக்கு மேற்பட்ட முறை வரையறுக்கப்பட்டதாகத் தெரிகிறது. குறைந்த பட்சம், இங்கே இரண்டு பேக்குகள் உள்ளன, அது அனுமதிக்கப்படவில்லை.

source: Parse error. I was expecting a cell or a buggle description but got: {0}
ta: பிழை. நான் ஒரு செல் அல்லது பிழையான விளக்கத்தை எதிர்பார்த்தேன், ஆனால் கிடைத்தது: {0}

source: The world''s name is {0}
ta: உலகின் பெயர் {0}

source: There is {0} entities where {1} were expected.
ta: {1} எதிர்பார்க்கப்பட்ட {0} நிறுவனங்கள் உள்ளன.

source: Something is wrong about buggle ''{0}'':
ta: பிழையானது பற்றி ஏதோ தவறு '' {0} '':

source: There is already a baggle here.
ta: ஏற்கனவே இங்கே ஒரு பாக்கில் உள்ளது.

source: , there shouldn't be this baggle
ta: , இந்த பேக்லே இருக்கக்கூடாது

source: , there should be a baggle
ta: , ஒரு பேக்லே இருக்க வேண்டும்

source: , the ground should not be {0}
ta: , தரை {0 be ஆக இருக்கக்கூடாது

source: , the ground is expected to be {0}, but it is {1}
ta: , தரை {0 அச் ஆக இருக்கும் என்று எதிர்பார்க்கப்படுகிறது, ஆனால் அது {0}

source: , the ground reads ''{0}'' (expected: ''{1}'')
ta: , தரை '' {0} '' (எதிர்பார்க்கப்படுகிறது: '' {1} '')

source: , there shouldn't be any wall at west
ta: , மேற்கில் எந்த சுவரும் இருக்கக்கூடாது

source: , there should be a wall at west
ta: , மேற்கில் ஒரு சுவர் இருக்க வேண்டும்

source: , there shouldn't be any wall at north
ta: , வடக்கில் எந்த சுவரும் இருக்கக்கூடாது

source: , there should be a wall at north
ta: , வடக்கில் ஒரு சுவர் இருக்க வேண்டும்

source: Buggles cannot traverse walls
ta: பருப்புகளால் சுவர்களைக் கடந்து செல்ல முடியாது

source: You have no baggle to drop
ta: நீங்கள் கைவிட பாக்கிள் இல்லை

source: forward
ta: முன்னோக்கி

source: forward()
ta: முன்னோக்கி ()

source: backward
ta: பின்னோக்கு

source: backward()
ta: பின்தங்கிய ()

source: left
ta: இடது

source: left()
ta: இடது ()

source: right
ta: வலது

source: right()
ta: சரி ()

source: mark
ta: குறி

source: brushUp()
ta: (பேச்சு வழக்கில்) திருப்புதல் ()

source: brushDown()
ta: பிரச்டு

source: setBrushColor(Color.{0})
ta: setBrushColor (நிறம். {0})

source: Wall hugging error
ta: சுவர் கட்டிப்பிடிக்கும் பிழை

source: Your buggle has collided with a wall, it hurts a lot ! ='(
ta: உங்கள் பிழையானது ஒரு சுவருடன் மோதியது, அது நிறைய வலிக்கிறது! = '(

source: Brush Color
ta: தூரிகை நிறம்

source: go
ta: போ

source: copy({0},{1})
ta: நகலெடு ({0}, {1})

source: swap
ta: இடமாற்றம்

source: copy
ta: நகலெடு

source: This is very weird: There is not the same amount of values! Expected: {0}; Found: {1}
ta: இது மிகவும் வித்தியாசமானது: அதே அளவு மதிப்புகள் இல்லை! எதிர்பார்க்கப்படுகிறது: {0}; கிடைத்தது: {1}

source: Invalid read count. Expected: {0}; Found: {1}
ta: தவறான வாசிப்பு எண்ணிக்கை. எதிர்பார்க்கப்படுகிறது: {0}; கிடைத்தது: {1}

source: Invalid write count. Expected: {0}; Found: {1}
ta: தவறான எழுது எண்ணிக்கை. எதிர்பார்க்கப்படுகிறது: {0}; கிடைத்தது: {1}

source: Value at index {0} differs. Expected {1}; Found {2}
ta: குறியீட்டு {0} இல் உள்ள மதிப்பு வேறுபடுகிறது. எதிர்பார்க்கப்படுகிறது {1}; {2}

source: Out of bounds in swap({0},{1}): {2}<0
ta: இடமாற்றத்தில் உள்ள எல்லைக்கு வெளியே ({0}, {1}): {2} <0

source: Out of bounds in swap({0},{1}): {2}>value count
ta: இடமாற்றத்தில் உள்ள எல்லைக்கு வெளியே ({0}, {1}): {2}> மதிப்பு எண்ணிக்கை

source: x1 differs.
ta: ஃச் 1 வேறுபடுகிறது.

source: x2 differs.
ta: ஃச் 2 வேறுபடுகிறது.

source: y1 differs.
ta: Y1 வேறுபடுகிறது.

source: y2 differs.
ta: Y2 வேறுபடுகிறது.

source: The color differs.
ta: நிறம் வேறுபடுகிறது.

source: I dont see the difference (please report this bug).
ta: நான் வித்தியாசத்தைக் காணவில்லை (தயவுசெய்து இந்த பிழையைப் புகாரளிக்கவும்).

source: That's not a line (please report this bug).
ta: அது ஒரு வரி அல்ல (தயவுசெய்து இந்த பிழையைப் புகாரளிக்கவும்).

source: Sorry Dave, I cannot let you use brushDown() here. Turtles have pens, not brushes. Use penDown() instead.
ta: மன்னிக்கவும் டேவ், இங்கே பிரச் பேரூர் () ஐப் பயன்படுத்த அனுமதிக்க முடியாது. ஆமைகளில் பேனாக்கள் உள்ளன, தூரிகைகள் அல்ல. அதற்கு பதிலாக பெண்டவுன் () ஐப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use brushUp() here. Turtles have pens, not brushes. Use penUp() instead.
ta: மன்னிக்கவும் டேவ், இங்கே பிரசப் () ஐப் பயன்படுத்த அனுமதிக்க முடியாது. ஆமைகளில் பேனாக்கள் உள்ளன, தூரிகைகள் அல்ல. அதற்கு பதிலாக பெனப் () ஐப் பயன்படுத்தவும்.

source: The turtle {0} is not heading to the right direction.
ta: ஆமை {0} சரியான திசையில் செல்லவில்லை.

source: The turtle {0} is at the right location.
ta: ஆமை {0} சரியான இடத்தில் உள்ளது.

source: There is {0} entities, but {1} entities were expected
ta: {0} நிறுவனங்கள் உள்ளன, ஆனால் {1} நிறுவனங்கள் எதிர்பார்க்கப்பட்டன

source: There is {0} shapes, but only {1} shapes were expected
ta: {0} வடிவங்கள் உள்ளன, ஆனால் {1} வடிவங்கள் மட்டுமே எதிர்பார்க்கப்பட்டன

source: There is only {0} shapes, but {1} shapes were expected
ta: {0} வடிவங்கள் மட்டுமே உள்ளன, ஆனால் {1} வடிவங்கள் எதிர்பார்க்கப்பட்டன

source: Superflous shapes in your solution:
ta: உங்கள் தீர்வில் மிதமிஞ்சிய வடிவங்கள்:

source: Missing shapes in your solution:
ta: உங்கள் தீர்வில் வடிவங்களைக் காணவில்லை:

source: {0} (got {1} instead of {2})
ta: {0} ({2 க்கு க்கு பதிலாக {1} கிடைத்தது)
