Repository: oster/PLM
Catalog: l10n/engine/*.po
Languages: ta

source: Error while loading your session
ta: உங்கள் அமர்வை ஏற்றும்போது பிழை

source: Abording on user request
ta: பயனர் கோரிக்கையின் பேரில்

source: Reusing the disk session located at {0}.
ta: {0 at இல் அமைந்துள்ள வட்டு அமர்வை மீண்டும் பயன்படுத்துதல்.

source: Initialize a new disk session at {0}.
ta: புதிய வட்டு அமர்வை {0 at இல் துவக்கவும்.

source: Your session {0} was automatically retrieved from the servers.
ta: உங்கள் அமர்வு {0} தானாகவே சேவையகங்களிலிருந்து மீட்டெடுக்கப்பட்டது.

source: Couldn't retrieve a corresponding session from the servers...
ta: சேவையகங்களிலிருந்து தொடர்புடைய அமர்வை மீட்டெடுக்க முடியவில்லை ...

source: Pushing to the remote repository before exiting.
ta: வெளியேறுவதற்கு முன் தொலை களஞ்சியத்திற்கு தள்ளுதல்.

source: An error occurred while configuring the repository...
ta: களஞ்சியத்தை உள்ளமைக்கும் போது பிழை ஏற்பட்டது ...

source: Retrieving your session from the servers...
ta: சேவையகங்களிலிருந்து உங்கள் அமர்வை மீட்டெடுப்பது ...

source: An error occurred while checking out the user's branch:
ta: பயனரின் கிளையைப் பார்க்கும்போது பிழை ஏற்பட்டது:

source: Last session data successfully retrieved.
ta: கடைசி அமர்வு தரவு வெற்றிகரமாக மீட்டெடுக்கப்பட்டது.

source: Last session data successfully merged.
ta: கடைசி அமர்வு தரவு வெற்றிகரமாக இணைக்கப்பட்டுள்ளது.

source: Conflicts have been detected while synchronizing with last session data, trying to resolve it...
ta: கடைசி அமர்வு தரவுகளுடன் ஒத்திசைக்கும்போது மோதல்கள் கண்டறியப்பட்டுள்ளன, அதைத் தீர்க்க முயற்சிக்கின்றன ...

source: Canceled the merge operation because of the following failures:
ta: பின்வரும் தோல்விகள் காரணமாக ஒன்றிணைந்த செயல்பாட்டை ரத்து செய்தது:

source: Can't merge data retrieved from server with local session data.
ta: சேவையகத்திலிருந்து மீட்டெடுக்கப்பட்ட தரவை உள்ளக அமர்வு தரவுகளுடன் ஒன்றிணைக்க முடியாது.

source: Cannot synchronize your session with the servers (network down).
ta: உங்கள் அமர்வை சேவையகங்களுடன் ஒத்திசைக்க முடியாது (நெட்வொர்க் டவுன்).

source: Your session has been successfully saved into the clouds.
ta: உங்கள் அமர்வு வெற்றிகரமாக மேகங்களில் சேமிக்கப்பட்டுள்ளது.

source: Fetching the server's last version...
ta: சேவையகத்தின் கடைசி பதிப்பைப் பெறுதல் ...

source: Fetching the data's last version didn't solve the issue, please report this bug.
ta: தரவின் கடைசி பதிப்பைப் பெறுவது சிக்கலைத் தீர்க்கவில்லை, தயவுசெய்து இந்த பிழையைப் புகாரளிக்கவும்.

source: A bug occurred while synchronizing your data with the server, please report the following error:
ta: சேவையகத்துடன் உங்கள் தரவை ஒத்திசைக்கும்போது ஒரு பிழை ஏற்பட்டது, தயவுசெய்து பின்வரும் பிழையைப் புகாரளிக்கவும்:

source: About lesson -
ta: பாடம் பற்றி -

source: About the PLM
ta: பி.எல்.எம் பற்றி

source: <html><h3 style="color:#666666;margin:0px;padding:0px;">version {0}&nbsp;<span style="font-size:8px; color:#AAAAAA;margin:0px;padding:0px;">({1})</span></h3><br/>&copy; 2008-2020 Contributors. All rights reserved.<br/><ul style="margin-left:20px;"><li>Original idea: <i>L. Turbak (Wellesley College)</i></li><li>Design and code: <i>M. Quinson and G. Oster</i></li><li>Tests: <i>Telecom Nancy students (classes from ''11 to ''15)</i></li></ul><br/>Your code is saved to {2}<br/>Your secret session ID is {3}<br/></html>
ta: <html> <h3 சூல் தண்டு = "color:#666666; விளிம்பு: 0px; திணிப்பு: 0px;"> பதிப்பு {0} & nbsp; : 0px; 2008-2020 பங்களிப்பாளர்கள். அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை. டர்பக் (வெல்லச்லி கல்லூரி) </i> </li> <li> வடிவமைப்பு மற்றும் குறியீடு: <i> மீ. குயின்சன் மற்றும் சி. > உங்கள் குறியீடு {1} <br/> க்கு சேமிக்கப்படுகிறது உங்கள் ரகசிய அமர்வு ஐடி {2} <br/> </html>

source: About
ta: பற்றி

source: Changes
ta: மாற்றங்கள்

source: <h2>The PLM is proudly Free Software</h2> <p>Copyright (c) 2008-2021.<br/> The PLM Team: Martin Quinson, Gérald Oster and others.<br/> (see the git logs for the exact authorship of each file).</p> <p>The PLM software was written internally by the team. This software is distributed under the GNU general public license version 3 (GPLv3).</p> <p>The pedagogical material distributed with the PLM is covered both by the GPLv3 license (mainly for the included code) and by the CC-BY-SA license (mainly for the other media files). But the exact boundary here between the source code and the media is left as an exercise to the reader, so this material is distributed under both licenses for sake of simplicity.</p> <p>The GPLv3 license can be found in the archive under the name LICENSE-GPL-3. The CC-BY-SA license can be found online: http://creativecommons.org/licenses/by-sa/3.0/</p> <p>The whole artwork is free content, licenced under CC-BY-SA, GPL, LGPL and/or CC0-public domain. Some parts were done by us, other parts were borowed from free collections. The specific license and origin of each files is listed in the COPYING file distributed with the archive.</p>
ta: <H2> பி.எல்.எம் பெருமையுடன் இலவச மென்பொருள் </H2> <p> பதிப்புரிமை (இ) 2008-2021. <br/> பி.எல்.எம் குழு: மார்ட்டின் குயின்சன், கெரால்ட் ஓச்டர் மற்றும் பலர். <br/> (ஒவ்வொரு கோப்பின் சரியான படைப்புரிமைக்கான அறிவிலி பதிவுகளைப் பார்க்கவும்). </p> <p> பி.எல்.எம் மென்பொருள் அணியால் உள்நாட்டில் எழுதப்பட்டது. இந்த மென்பொருள் குனு பொது பொது உரிமம் பதிப்பு 3 (சிபிஎல்.வி 3) இன் கீழ் விநியோகிக்கப்படுகிறது. </P> <p> பி.எல்.எம் உடன் விநியோகிக்கப்படும் கற்பித்தல் பொருள் சி.பி.எல்.வி 3 உரிமம் (முக்கியமாக சேர்க்கப்பட்ட குறியீட்டிற்கு) மற்றும் சிசி-பை-எச்ஏ உரிமத்தால் (முக்கியமாக பிற ஊடக கோப்புகளுக்கு) மூடப்பட்டுள்ளது. ஆனால் மூலக் குறியீட்டிற்கும் ஊடகத்திற்கும் இடையிலான சரியான எல்லை வாசகருக்கு ஒரு பயிற்சியாக விடப்படுகிறது, எனவே இந்த பொருள் இரு உரிமங்களின் கீழ் எளிமைக்காக விநியோகிக்கப்படுகிறது. </P> <p> GPLV3 உரிமத்தை உரிமம்-GPL-3 என்ற பெயரில் காப்பகத்தில் காணலாம். CC-BY-SA உரிமத்தை ஆன்லைனில் காணலாம்: http://creativecommons.org/licenses/by-sa/3.0/ </p> <p> முழு கலைப்படைப்புகளும் இலவச உள்ளடக்கம், CC-BY-SA, GPL, LGPL மற்றும்/அல்லது CC0-PUBLIC டொமைன் கீழ் உரிமம் பெற்றவை. சில பகுதிகள் எங்களால் செய்யப்பட்டன, மற்ற பகுதிகள் இலவச சேகரிப்புகளிலிருந்து இணைக்கப்பட்டன. ஒவ்வொரு கோப்புகளின் குறிப்பிட்ட உரிமமும் தோற்றம் காப்பகத்துடன் விநியோகிக்கப்பட்ட நகலெடுக்கும் கோப்பில் பட்டியலிடப்பட்டுள்ளது. </P>

source: Copying
ta: நகலெடுக்கும்

source: Close
ta: மூடு

source: About world - {0}
ta: உலகத்தைப் பற்றி - {0}

source: Choose your next exercise
ta: உங்கள் அடுத்த உடற்பயிற்சியைத் தேர்வுசெய்க

source: Choose your lesson
ta: உங்கள் பாடத்தைத் தேர்வுசெய்க

source: <table border="0" align="center"><tr> <td valign="center"><img src="img/world_buggle.png" /></td> <td valign="center">&nbsp;&nbsp;<font size="+2">Welcome to the Programmer's Learning Machine</font>&nbsp;&nbsp;</td> <td valign="center"><img src="img/world_buggle.png" /></td> </tr></table> <p><font size="+1">The PLM is a Learning Management System (LMS) aiming at teaching the art of computer programming through interactive exercises. It offers an extensive set of varied exercises, allowing you to practice at your own pace.</font></p><br/>
ta: <அட்டவணை எல்லை = "0" Align = "மையம்"> <tr> <td valign = "மையம்"> <img src = "img/world_buggle.png"/> </td> <td valign = "மையம்"> & nbsp; & nbsp; <font அளவு = "+2"> புரோகிராமரின் கற்றல் இயந்திரத்திற்கு வருக </font> & nbsp; & nbsp; </td> <td valign = "மையம்"> <img src = "img/world_buggle.png"/> </td> </tr> </sable> <p> <font அளவு = "+1"> பி.எல்.எம் என்பது ஒரு கற்றல் மேலாண்மை அமைப்பு (எல்.எம்.எச்) என்பது ஊடாடும் பயிற்சிகள் மூலம் கணினி நிரலாக்க கலையை கற்பிப்பதை நோக்கமாகக் கொண்டுள்ளது. இது மாறுபட்ட பயிற்சிகளின் விரிவான தொகுப்பை வழங்குகிறது, இது உங்கள் சொந்த வேகத்தில் பயிற்சி செய்ய உங்களை அனுமதிக்கிறது. </Font> </p> <br/>

source: PLM lesson files
ta: பி.எல்.எம் பாடம் கோப்புகள்

source: Error
ta: பிழை

source: <h1>Please pick a lesson</h1> <p>Please click on an icon on the left to select a lesson.</p> <p>Lessons located above are generally simpler than the ones located below.</p>
ta: <H1> தயவுசெய்து ஒரு பாடத்தைத் தேர்ந்தெடுக்கவும் </H1> <p> ஒரு பாடத்தைத் தேர்ந்தெடுக்க இடதுபுறத்தில் உள்ள ஒரு ஐகானைக் சொடுக்கு செய்க. </p> <p> மேலே அமைந்துள்ள பாடங்கள் பொதுவாக கீழே அமைந்துள்ளதை விட எளிமையானவை. </p>

source: <p>(unable to display the short description of this lesson: file {0} not found)</p>
ta: <p> (இந்த பாடத்தின் குறுகிய விளக்கத்தைக் காட்ட முடியவில்லை: கோப்பு {0} கிடைக்கவில்லை) </p>

source: <p><b>Your score:</b>
ta: <p> <b> உங்கள் மதிப்பெண்: </b>

source: {0} out of {1} exercises passed.
ta: {0} வெளியே {1} பயிற்சிகள் அனுப்பப்பட்டன.

source: {0} out of {1} exercises passed in {2}.
ta: {0} வெளியே {1} பயிற்சிகள் {2 at இல் அனுப்பப்பட்டன.

source: You never attempted this lesson.
ta: இந்த பாடத்தை நீங்கள் ஒருபோதும் முயற்சித்ததில்லை.

source: <i>Practice makes perfect</i>, as they say.
ta: <i> பயிற்சி சரியானது </i>, அவர்கள் சொல்வது போல்.

source: <i>To err is human</i>, as they say.
ta: <i> தவறு செய்வது மனிதர் </i>, அவர்கள் சொல்வது போல்.

source: You should keep trying until you get it right!
ta: நீங்கள் அதை சரியாகப் பெறும் வரை நீங்கள் தொடர்ந்து முயற்சி செய்ய வேண்டும்!

source: We all learn from our mistakes, so, good job!
ta: நாம் அனைவரும் எங்கள் தவறுகளிலிருந்து கற்றுக்கொள்கிறோம், எனவே, நல்ல வேலை!

source: We learn from failure, not from success!
ta: நாம் தோல்வியிலிருந்து கற்றுக்கொள்கிறோம், வெற்றியிலிருந்து அல்ல!

source: Success comes after failure
ta: தோல்விக்குப் பிறகு செய் வருகிறது

source: <i>The master has failed more time than the beginner has even tried</i>,<br> as they say.
ta: <i> தொடக்க வீரர் முயற்சித்ததை விட மாச்டர் அதிக நேரம் தோல்வியுற்றார் </i>, <br> அவர்கள் சொல்வது போல்.

source: <i>Anyone who has never made a mistake has never <br>tried anything new.</i> (Einstein).
ta: <i> ஒருபோதும் தவறு செய்யாத எவரும் ஒருபோதும் புதிதாக எதையும் முயற்சித்ததில்லை. </i> (ஐன்ச்டீன்).

source: <i>Success does not consist in never making mistakes,<br> but in never making the same one a second time.</i> (Shaw)
ta: <i> செய் ஒருபோதும் தவறுகளைச் செய்வதில் இல்லை, <br> ஆனால் ஒருபோதும் அதை இரண்டாவது முறையாக மாற்றுவதில்லை. </i> (சா)

source: Mmm, not quite
ta: ம்ம், மிகவும் இல்லை

source: <html>You didn''t manage to reach your objective this time. <br> That''s fine. {0}<br> <br> You should graphically compare the final state of your world <br> with the objective to understand the problem. <br> <br> If you don''t see the error, check the details below for a <br> textual description of this difference between both worlds.</html>
ta: <HTML> இந்த நேரத்தில் உங்கள் நோக்கத்தை அடைய நீங்கள் நிர்வகிக்கவில்லை. <br> அது நன்றாக இருக்கிறது. {0} <br> <br> உங்கள் உலகின் இறுதி நிலையை நீங்கள் வரைபடமாக ஒப்பிட வேண்டும் <br> சிக்கலைப் புரிந்துகொள்வதற்கான நோக்கத்துடன். <br> <br> நீங்கள் பிழையைக் காணவில்லை என்றால், ஒரு <br> க்கு கீழே உள்ள விவரங்களைச் சரிபார்க்கவும் இரு உலகங்களுக்கும் இடையிலான இந்த வேறுபாட்டின் உரை விளக்கம். </html>

source: <html>Compilation error.<br> You can find below the detailed error message (as given by {0}).<br> Please read it carefully to understand the problem, and fix your code.</html>
ta: <HTML> தொகுப்பு பிழை. <br> விரிவான பிழை செய்திக்கு கீழே காணலாம் ({0 by வழங்கியபடி). <br> சிக்கலைப் புரிந்துகொள்ள கவனமாகப் படித்து, உங்கள் குறியீட்டை சரிசெய்யவும். </Html>

source: Details >>
ta: விவரங்கள் >>

source: Details <<
ta: விவரங்கள் <<

source: Exercice passed \o/
ta: உடற்பயிற்சி கடந்து \ o/

source: Congrats
ta: வாழ்த்துக்கள்

source: <html>Congratulations, you passed this exercise.<br>{0} tests passed.</html>
ta: <HTML> வாழ்த்துக்கள், நீங்கள் இந்த பயிற்சியை நிறைவேற்றினீர்கள். <br> {0} சோதனைகள் நிறைவேற்றப்பட்டன. </html>

source: <html>Congratulations, you passed this exercise.</html>
ta: <HTML> வாழ்த்துக்கள், நீங்கள் இந்த பயிற்சியை நிறைவேற்றினீர்கள். </html>

source: <html>Congratulations, you passed this exercise.<br>({0} tests passed)<br><br><br>Select your next exercise:</html>
ta: <HTML> வாழ்த்துக்கள், நீங்கள் இந்த பயிற்சியை நிறைவேற்றினீர்கள்.

source: <html>Congratulations, you passed this exercise.<br><br><br><br>Select your next exercise:</html>
ta: <HTML> வாழ்த்துக்கள், நீங்கள் இந்த பயிற்சியை நிறைவேற்றினீர்கள். <br> <br> <br> <br> உங்கள் அடுத்த பயிற்சியைத் தேர்ந்தெடுக்கவும்: </html>

source: Give feedback
ta: கருத்து தெரிவிக்கவும்

source: Please help us to improve this exercise by filling this little evaluation.
ta: இந்த சிறிய மதிப்பீட்டை நிரப்புவதன் மூலம் இந்த பயிற்சியை மேம்படுத்த எங்களுக்கு உதவுங்கள்.

source: Difficulty:
ta: சிரமம்:

source: (please choose)
ta: (தயவுசெய்து தேர்வு செய்யவும்)

source: Too easy
ta: மிகவும் எளிதானது

source: Easy
ta: எளிதானது

source: Just right
ta: சரியாக

source: Difficult
ta: கடினம்

source: Too difficult
ta: மிகவும் கடினம்

source: Interest:
ta: ஆர்வம்:

source: Really good
ta: உண்மையில் நல்லது

source: Amusing
ta: வேடிக்கையான

source: Just okay
ta: சரி

source: Boring
ta: சலிப்பு

source: Really bad
ta: உண்மையில் மோசமானது

source: Free comments on that exercise:
ta: அந்த பயிற்சியின் இலவச கருத்துகள்:

source: Change the speed of execution
ta: சாவுஒறுப்பு வேகத்தை மாற்றவும்

source: World
ta: உலகம்

source: The world as it is right now
ta: உலகம் இப்போது உள்ளது

source: Objective
ta: குறிக்கோள்

source: The world as it should be
ta: உலகம் இருக்க வேண்டும்

source: Switch the displayed world
ta: காட்டப்பட்ட உலகத்தை மாற்றவும்

source: Switch the entity
ta: நிறுவனத்தை மாற்றவும்

source: Please describe the problem in a few words
ta: சில வார்த்தைகளில் சிக்கலை விவரிக்கவும்

source: Your suggestion comes here, with all necessary details. (The following helps us fixing your problem, please don't erase) --------------------[ Technical Information ]--------------------
ta: உங்கள் பரிந்துரை தேவையான அனைத்து விவரங்களுடனும் இங்கு வருகிறது. (பின்வருவது உங்கள் சிக்கலை சரிசெய்ய எங்களுக்கு உதவுகிறது, தயவுசெய்து அழிக்க வேண்டாம்) -------------------- [தொழில்நுட்ப தகவல்] --------------------------

source: --------------------[ my code for this exercise ]--------------------
ta: -------------------- [இந்த பயிற்சிக்கான எனது குறியீடு] ----------------------------

source: Report your feedback
ta: உங்கள் கருத்தைப் புகாரளிக்கவும்

source: Issue title:
ta: வெளியீட்டு தலைப்பு:

source: <h1>Asking a question about the PLM</h1> <p>If you're stuck or unsure, you can come and discuss with us on our <a href='https://discord.gg/agxNPGj'>Discord server</a>. You can also use this channel to chat about new ideas to extend the PLM, or simply to chat with us with working with the PLM.</p> <h1>Reporting a bug in PLM</h1> <p>If you have your own GitHub account, please head to the <a href='https://github.com/BuggleInc/PLM'>PLM Bug Tracker</a>. If not, you can use this window to report an issue in the PLM (be it in one exercise or in the PLM itself), but <b>don't ask questions in this window</b>, as we have no way to provide an answer on this channel. Please write your report in English or French if possible.</p> <p>You should include all relevant information that could help us fixing the issue. Don't remove the technical details unless you are certain that they are not relevant. What you write here will be public: <b>Never disclose passwords or other sensible information on a bug tracker</b></p> <p>When you find a typo or a sentence that is hard to understand, it really helps to suggest a new wording.If you encounter a technical bug, please tell us what you did, which outcome you were expecting and what happened instead.</p><br/>
ta: <H1> பி.எல்.எம் பற்றி கேள்வி கேட்கிறது </எச் 1> <p> நீங்கள் சிக்கிக்கொண்டால் அல்லது உறுதியாக தெரியவில்லை என்றால், நீங்கள் எங்களுடன் வந்து எங்களுடன் எங்கள் <a href = 'https: //discord.gg/agxnpgj'> முரண்பாடு சேவையகம் </a> இல் விவாதிக்கலாம். பி.எல்.எம் நீட்டிக்க புதிய யோசனைகளைப் பற்றி அரட்டையடிக்க இந்த சேனலைப் பயன்படுத்தலாம் அல்லது பி.எல்.எம் உடன் பணிபுரியும் எங்களுடன் அரட்டையடிக்கலாம். </P> <H1> பி.எல்.எம் </எச் 1> இல் ஒரு பிழையைப் புகாரளித்தல் <p> உங்களிடம் உங்கள் சொந்த அறிவிலிமையம் கணக்கு இருந்தால், தயவுசெய்து <a href = 'https: //github.com/buggleinc/plm'> plm பிழை டிராக்கர் </a> க்குச் செல்லுங்கள். இல்லையென்றால், பி.எல்.எம்மில் ஒரு சிக்கலைப் புகாரளிக்க இந்த சாளரத்தைப் பயன்படுத்தலாம் (அது ஒரு உடற்பயிற்சியில் அல்லது பி.எல்.எம். இந்த சேனலில் பதிலை வழங்க. முடிந்தால் உங்கள் அறிக்கையை ஆங்கிலம் அல்லது பிரஞ்சு மொழியில் எழுதுங்கள். </P> <p> சிக்கலை சரிசெய்ய எங்களுக்கு உதவும் அனைத்து தொடர்புடைய தகவல்களையும் நீங்கள் சேர்க்க வேண்டும். தொழில்நுட்ப விவரங்கள் பொருந்தாது என்று உங்களுக்குத் தெரியாவிட்டால் அவற்றை அகற்ற வேண்டாம். நீங்கள் இங்கே எழுதுவது பொதுவில் இருக்கும்: <b> பிழை டிராக்கரில் கடவுச்சொற்கள் அல்லது பிற விவேகமான தகவல்களை ஒருபோதும் வெளியிட வேண்டாம் </b> </p> <p> புரிந்துகொள்ள கடினமாக இருக்கும் ஒரு எழுத்துப்பிழை அல்லது வாக்கியத்தைக் கண்டறிந்தால், இது ஒரு புதிய சொற்களை பரிந்துரைக்க உதவுகிறது. நீங்கள் ஒரு தொழில்நுட்ப பிழையை எதிர்கொண்டால், நீங்கள் என்ன செய்தீர்கள், எந்த விளைவு நீங்கள் எதிர்பார்த்தீர்கள், அதற்கு பதிலாக என்ன நடந்தது என்பதை எங்களிடம் கூறுங்கள். </p> <br/>

source: Cancel
ta: ரத்துசெய்

source: Do you really want to cancel your feedback and lose any edit?
ta: உங்கள் கருத்தை ரத்துசெய்து எந்த திருத்தத்தையும் இழக்க விரும்புகிறீர்களா?

source: are you sure?
ta: நீங்கள் உறுதியாக இருக்கிறீர்களா?

source: Send feedback
ta: கருத்துக்களை அனுப்பவும்

source: Thank you for your remark, we will do our best to integrate it. Follow our progress at {0}.
ta: உங்கள் கருத்துக்கு நன்றி, அதை ஒருங்கிணைக்க நாங்கள் எங்களால் முடிந்த அனைத்தையும் செய்வோம். எங்கள் முன்னேற்றத்தை {0 at இல் பின்பற்றவும்.

source: Thanks for your suggestion
ta: உங்கள் பரிந்துரைக்கு நன்றி

source: Error while uploading your feedback
ta: உங்கள் கருத்தை பதிவேற்றும்போது பிழை

source: Your feedback needs some little changes before being send, please fix the following issue(s):
ta: உங்கள் கருத்துக்கு அனுப்புவதற்கு முன் சில சிறிய மாற்றங்கள் தேவை, பின்வரும் சிக்கலை (களை) சரிசெய்யவும்:

source: Incorrect feedback
ta: தவறான கருத்து

source: The feedback's title is still the default one, please specify a relevant one.
ta: பின்னூட்டத்தின் தலைப்பு இன்னும் இயல்புநிலை ஒன்றாகும், தயவுசெய்து தொடர்புடைய ஒன்றைக் குறிப்பிடவும்.

source: The current title is empty, please specify a relevant title.
ta: தற்போதைய தலைப்பு காலியாக உள்ளது, தயவுசெய்து தொடர்புடைய தலைப்பைக் குறிப்பிடவும்.

source: The feedback still contains the explanatory text (above the line of ---------), please remove it.
ta: பின்னூட்டத்தில் விளக்கமளிக்கும் உரை உள்ளது (-------------- க்கு மேலே), தயவுசெய்து அதை அகற்றவும்.

source: Where error and other messages get written
ta: பிழை மற்றும் பிற செய்திகள் எழுதப்பட்டவை

source: File
ta: கோப்பு

source: File related functions
ta: கோப்பு தொடர்பான செயல்பாடுகள்

source: Save a picture
ta: ஒரு படத்தை சேமிக்கவும்

source: PNG Image Files
ta: பி.என்.சி படக் கோப்புகள்

source: Do you want to overwrite {0}?
ta: {0} ஐ மேலெழுத விரும்புகிறீர்களா?

source: {0} exists
ta: {0} உள்ளது

source: Image saved into {0}.
ta: படம் {0 துணுக்கு இல் சேமிக்கப்பட்டது.

source: Quit
ta: வெளியேறு

source: Exercise
ta: உடற்பயிற்சி

source: Switch lesson
ta: பாடம் சுவிட்ச்

source: Switch exercise
ta: உடற்பயிற்சியை மாற்றவும்

source: Revert Exercise
ta: உடற்பயிற்சியை மாற்றவும்

source: Debug mode
ta: பிழைத்திருத்த முறை

source: Creative mode
ta: படைப்பு முறை

source: Session
ta: அமர்வு

source: Write Session to disk
ta: அமர்வை வட்டுக்கு எழுதுங்கள்

source: Read Session from disk
ta: வட்டில் இருந்து அமர்வைப் படியுங்கள்

source: Add user
ta: பயனரைச் சேர்க்கவும்

source: Switch user
ta: பயனரை மாற்றவும்

source: Remove user
ta: பயனரை அகற்று

source: Language
ta: மொழி

source: Human
ta: மனித

source: Computer
ta: கணிப்பொறி, கணிணி

source: Help
ta: உதவி

source: Provide feedback
ta: கருத்துக்களை வழங்கவும்

source: About this lesson
ta: இந்த பாடம் பற்றி

source: About this world
ta: இந்த உலகத்தைப் பற்றி

source: Show the mission in a window
ta: ஒரு சாளரத்தில் பணியைக் காட்டு

source: Run
ta: ஓடு

source: Step
ta: படி

source: Stop
ta: நிறுத்து

source: Reset
ta: மீட்டமை

source: Demo
ta: டெமோ

source: Next
ta: அடுத்தது

source: Please wait, while the PLM is saving your session data.
ta: தயவுசெய்து காத்திருங்கள், பி.எல்.எம் உங்கள் அமர்வு தரவைச் சேமிக்கும்போது.

source: Lesson related functions
ta: பாடம் தொடர்பான செயல்பாடுகள்

source: Export Session Cache
ta: ஏற்றுமதி அமர்வு தற்காலிக சேமிப்பு

source: Import Session Cache
ta: இறக்குமதி அமர்வு தற்காலிக சேமிப்பு

source: Mission
ta: மிசன்

source: Description of the work to do
ta: செய்ய வேண்டிய வேலையின் விளக்கம்

source: Type your code here
ta: உங்கள் குறியீட்டை இங்கே தட்டச்சு செய்க

source: <img> tag without src attribute at offset {0}.
ta: <myg> ஆஃப்செட் {0 at இல் எச்.ஆர்.சி பண்புக்கூறு இல்லாமல் குறிச்சொல்.

source: <img> tag without src attribute in exercise {0} at offset {1}
ta: <myg> ஆஃப்செட் {0} இல் உடற்பயிற்சியில் SRC பண்புக்கூறு இல்லாமல் குறிச்சொல்

source: Saving
ta: சேமிப்பு

source: Compiling
ta: தொகுத்தல்

source: Running
ta: இயங்கும்

source: Playing demo
ta: டெமோ விளையாடுவது

source: Loading
ta: ஏற்றுகிறது

source: Tips
ta: உதவிக்குறிப்புகள்

source: (no tips to display)
ta: (காண்பிக்க உதவிக்குறிப்புகள் இல்லை)

source: If you already have a UUID, paste it here. If not, you can use that randomly generated identifier.
ta: உங்களிடம் ஏற்கனவே ஒரு UUID இருந்தால், அதை இங்கே ஒட்டவும். இல்லையென்றால், தோராயமாக உருவாக்கப்பட்ட அடையாளங்காட்டியை நீங்கள் பயன்படுத்தலாம்.

source: Username:
ta: பயனர்பெயர்:

source: Secret UUID:
ta: மறைபொருள் UUID:

source: Your new user has been added successfully! You were automatically switched to that user.
ta: உங்கள் புதிய பயனர் வெற்றிகரமாக சேர்க்கப்பட்டுள்ளது! நீங்கள் தானாகவே அந்த பயனருக்கு மாற்றப்பட்டீர்கள்.

source: Invalid UUID! Either paste a correct identifier or use the randomly generated one.
ta: தவறான uuid! சரியான அடையாளங்காட்டியை ஒட்டவும் அல்லது தோராயமாக உருவாக்கப்பட்ட ஒன்றைப் பயன்படுத்தவும்.

source: Please ask here your question for the teacher:
ta: ஆசிரியருக்கான உங்கள் கேள்வியை இங்கே கேளுங்கள்:

source: Call for help
ta: உதவிக்கு அழைக்கவும்

source: Cancel call
ta: அழைப்பை ரத்துசெய்

source: Call for Help
ta: உதவிக்கு அழைக்கவும்

source: Run the demo of what you should code for this exercise
ta: இந்த பயிற்சிக்கு நீங்கள் என்ன குறியிட வேண்டும் என்பதற்கான டெமோவை இயக்கவும்

source: Impossible to run the demo right now
ta: இப்போது டெமோவை இயக்க இயலாது

source: Quit the application
ta: விண்ணப்பத்தை விட்டு வெளியேறவும்

source: Impossible to quit the application right now
ta: இப்போது விண்ணப்பத்தை விட்டு வெளியேற முடியாது

source: <html>Please choose from the drop-down menu the user you want to remove.</html>
ta: <HTML> நீங்கள் அகற்ற விரும்பும் பயனரை கீழ்தோன்றும் மெனுவிலிருந்து தேர்வு செய்யவும். </html>

source: A deleted user is definitely lost if you don''t know its full UUID (something like 110E8400-E29B-11D4-A716-446655440000). Are you sure that you want to delete the user {0}?
ta: நீக்கப்பட்ட பயனர் உங்களுக்குத் தெரியாவிட்டால் நிச்சயமாக இழக்கப்படுவார் முழு UUID (110E8400-E29B-11D4-A716-446655440000). பயனரை {0} நீக்க விரும்புகிறீர்கள் என்பதில் உறுதியாக இருக்கிறீர்களா?

source: Confirm user deletion
ta: பயனர் நீக்குதலை உறுதிப்படுத்தவும்

source: User {0} successfully deleted
ta: பயனர் {0} வெற்றிகரமாக நீக்கப்பட்டது

source: Sorry, you can't delete the current user.
ta: மன்னிக்கவும், தற்போதைய பயனரை நீக்க முடியாது.

source: Try again
ta: மீண்டும் முயற்சிக்கவும்

source: Reset your world to the initial state
ta: உங்கள் உலகத்தை ஆரம்ப நிலைக்கு மீட்டமைக்கவும்

source: World cannot be reset right now
ta: உலகத்தை இப்போது மீட்டமைக்க முடியாது

source: OK
ta: சரி

source: Reverting this exercise will erase all your work and cannot be undone. Are you sure that you want to proceed?
ta: இந்த பயிற்சியை மாற்றியமைப்பது உங்கள் எல்லா வேலைகளையும் அழிக்கும், மேலும் செயல்தவிர்க்க முடியாது. நீங்கள் தொடர விரும்புகிறீர்கள் என்று உறுதியாக இருக்கிறீர்களா?

source: Warning
ta: எச்சரிக்கை

source: Revert canceled on user request -- your work was preserved.
ta: பயனர் கோரிக்கையின் பேரில் ரத்துசெய்யப்பட்டது - உங்கள் பணி பாதுகாக்கப்பட்டது.

source: Exercise reverted
ta: உடற்பயிற்சி மாற்றப்பட்டது
