Repository: oster/PLM
Catalog: l10n/engine/*.po
Languages: ta

source: A light is still off.
ta: ஒரு ஒளி இன்னும் முடக்கப்பட்டுள்ளது.

source: {0} lights (out of {1}) are still off.
ta: {0} விளக்குகள் ({1} வெளியே) இன்னும் முடக்கப்பட்டுள்ளன.

source: Sorry Dave, I cannot let you use setX(x) in this exercise. Walk to your goal instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் செட்எக்ச் (எக்ச்) ஐப் பயன்படுத்த அனுமதிக்க முடியாது. அதற்கு பதிலாக உங்கள் இலக்கை நோக்கி நடந்து செல்லுங்கள்.

source: Sorry Dave, I cannot let you use setY(y) in this exercise. Walk to your goal instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் செட்டி (y) ஐப் பயன்படுத்த நான் அனுமதிக்க முடியாது. அதற்கு பதிலாக உங்கள் இலக்கை நோக்கி நடந்து செல்லுங்கள்.

source: Sorry Dave, I cannot let you use setPos(x,y) in this exercise. Walk to your goal instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் செட்ச்போச் (எக்ச், ஒய்) ஐப் பயன்படுத்த அனுமதிக்க முடியாது. அதற்கு பதிலாக உங்கள் இலக்கை நோக்கி நடந்து செல்லுங்கள்.

source: Sorry Dave, I cannot let you move disks between slots 0 and 2 directly. Use the intermediate slot in all moves.
ta: மன்னிக்கவும் டேவ், 0 மற்றும் 2 இடங்களுக்கு இடையில் வட்டுகளை நேரடியாக நகர்த்த அனுமதிக்க முடியாது. எல்லா நகர்வுகளிலும் இடைநிலை ச்லாட்டைப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you move disks counterclockwise. Move from 0 to 1, from 1 to 2 or from 2 to 0 only, not from {0} to {1}.
ta: மன்னிக்கவும் டேவ், வட்டுகளை எதிரெதிர் திசையில் நகர்த்த அனுமதிக்க முடியாது. 0 முதல் 2 வரை அல்லது 2 முதல் 2 வரை அல்லது 2 முதல் 0 வரை மட்டுமே நகர்த்தவும், {0} முதல் {1} வரை அல்ல.

source: move({0},{1})
ta: நகர்த்து ({0}, {1})

source: Invalid move
ta: தவறான நடவடிக்கை

source: The disks were not moved the same amount of time: {0} vs. {1}.
ta: வட்டுகள் ஒரே நேரத்தில் நகர்த்தப்படவில்லை: {0} vs. {1}.

source: Disk #{0} of slot #{1} differs: {2} vs. {3}.
ta: ச்லாட் #{0}} வேறுபடுகிறது: {1} vs. {2}.

source: Color of disk #{0} of slot #{1} differs: {2} vs. {3}.
ta: ச்லாட் #{1 of வட்டு #{0} வேறுபடுகிறது: {1} vs. {2}.

source: Cannot move from slot {0} to {1}: the only existing slots are numbered from 0 to {2}.
ta: ச்லாட் {0} இலிருந்து {1 பெறுநர் க்கு செல்ல முடியாது: தற்போதுள்ள இடங்கள் 0 முதல் {1} வரை எண்ணப்படுகின்றன.

source: Cannot move from slot {0} to itself.
ta: ச்லாட் {0} இலிருந்து தனக்குத்தானே செல்ல முடியாது.

source: No disc to move from slot {0}.
ta: ச்லாட்டிலிருந்து செல்ல வட்டு இல்லை {0}.

source: Cannot move disc from slot {0} to {1} small disk must remain over large ones but {2} > {3}.
ta: ச்லாட் {0} முதல் {1} வரை வட்டை நகர்த்த முடியாது} சிறிய வட்டு பெரியவற்றுக்கு மேல் இருக்க வேண்டும், ஆனால் {2}> {3}.

source: Invalid slot: {0}.
ta: தவறான ச்லாட்: {0}.

source: Slot {0} is only {1} high; Cannot get the color of the {2}th disk.
ta: ச்லாட் {0} மட்டுமே {1} உயர்ந்தது; {2} வது வட்டின் நிறத்தைப் பெற முடியாது.

source: Go
ta: போ

source: The player {0} of the base {1} cannot reach the hole that is too far from its position
ta: {1} அடித்தளத்தின் பிளேயர் {0} அதன் நிலையில் இருந்து வெகு தொலைவில் உள்ள துளை அடைய முடியாது

source: This is not a baseball world :-(
ta: இது ஒரு பேச்பால் உலகம் அல்ல :-(

source: Differing amount of bases: {0} vs {1}
ta: தளங்களின் மாறுபட்ட அளவு: {0} vs {1}

source: Differing amount of players: {0} vs {1}
ta: வீரர்களின் மாறுபட்ட அளவு: {0} vs {1}

source: Player at base {0}, pos {1} differs: {2} vs {3}
ta: அடித்தளத்தில் {0}, போச் {1} வேறுபடுகிறது: {2} vs {3}

source: It''s still not sorted!! PLEASE REPORT THIS BUG, along with the following information: Exercise: {0}; Amount of bases: {1}; Initial situation: {2}
ta: இது இன்னும் வரிசைப்படுத்தப்படவில்லை !! பின்வரும் தகவலுடன் இந்த பிழையைப் புகாரளிக்கவும்: உடற்பயிற்சி: {0}; தளங்களின் அளவு: {1}; ஆரம்ப நிலைமை: {2}

source: Cannot move from base {0} since it''s not between 0 and {1}
ta: 0 மற்றும் {1 between க்கு இடையில் இல்லாததால் {0} அடித்தளத்திலிருந்து நகர முடியாது

source: Cannot move from position {0} since it''s not between 0 and {1})
ta: 0 மற்றும் {1 between க்கு இடையில் இல்லாததால் {0} நிலையிலிருந்து நகர முடியாது)

source: The player {0} from base {1} is too far from the hole (at base {2}) to reach it in one move
ta: அடித்தளத்திலிருந்து {2} {0} {1} ஒரு நகர்வில் அதை அடைய துளையிலிருந்து (அடிவாரத்தில் {2}) வெகு தொலைவில் உள்ளது

source: Switch to time view
ta: நேரக் காட்சிக்கு மாறவும்

source: Switch to state view
ta: மாநில பார்வைக்கு மாறவும்

source: Flag sorter
ta: கொடிகள் வரிசைப்படுத்துகின்றன

source: This world is not a dutch flag
ta: இந்த உலகம் டச்சு கொடி அல்ல

source: The two worlds are of differing size
ta: இரண்டு உலகங்களும் மாறுபட்ட அளவு

source: Ray #{0} differs: color {1} is not color {2}
ta: கதிர் #{0} வேறுபடுகிறது: வண்ணம் {1} வண்ணம் அல்ல {2}

source: Cannot swap {0} and {1} because {2} is not between 0 and {3}
ta: {0} மற்றும் {1} இடமாற்றம் செய்ய முடியாது, ஏனெனில் {2} 0 மற்றும் {3 between க்கு இடையில் இல்லை

source: Cannot get the color of line #{0} because it''s not between 0 and {1}
ta: #{0} வரியின் நிறத்தைப் பெற முடியாது, ஏனெனில் அது 0 மற்றும் {1 between க்கு இடையில் இல்லை

source: It''s still not sorted!! PLEASE REPORT THIS BUG, along with the following information: Initial situation: {0}
ta: இது இன்னும் வரிசைப்படுத்தப்படவில்லை !! பின்வரும் தகவலுடன் இந்த பிழையைப் புகாரளிக்கவும்: ஆரம்ப நிலைமை: {0}

source: swap({0},{1})
ta: இடமாற்று ({0}, {1})

source: flip({0})
ta: புரட்ட ({0})

source: This is not a world of pancakes.
ta: இது அப்பத்தை ஒரு உலகம் அல்ல.

source: The two worlds are of differing size.
ta: இரண்டு உலகங்களும் மாறுபட்ட அளவு.

source: Stacks were not flipped the same amount of time: {0} vs. {1}.
ta: அடுக்குகள் ஒரே நேரத்தில் புரட்டப்படவில்லை: {0} vs. {1}.

source: Pancake #{0} differs: {1} vs. {2}.
ta: பான்கேக் #{0} வேறுபடுகிறது: {1} vs. {2}.

source: Asked to flip {0} pancakes, but you must flip at least one.
ta: {0} அப்பத்தை புரட்டும்படி கேட்டார், ஆனால் நீங்கள் குறைந்தது ஒன்றையாவது புரட்ட வேண்டும்.

source: Asked to flip {0} pancakes, but there is only {1} pancakes on this stack.
ta: {0} அப்பத்தை புரட்டும்படி கேட்டார், ஆனால் இந்த அடுக்கில் {1} அப்பங்கள் மட்டுமே உள்ளன.

source: Cannot get the radius of pancake #{0} because it''s not between 0 and {1}.
ta: பான்கேக் #{0 of இன் ஆரம் பெற முடியாது, ஏனெனில் அது 0 மற்றும் {1 between க்கு இடையில் இல்லை.

source: Cannot get the orientation of pancake #{0} because it''s not between 0 and {1}.
ta: பான்கேக் #{0 of இன் நோக்குநிலையைப் பெற முடியாது, ஏனெனில் இது 0 மற்றும் {1 between க்கு இடையில் இல்லை.

source: Sorry Dave, I cannot let you use forward with an argument in this exercise. Use a loop instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் ஒரு வாதத்துடன் முன்னோக்கி பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக ஒரு வளையத்தைப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use backward with an argument in this exercise. Use a loop instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் ஒரு வாதத்துடன் பின்னோக்கி பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக ஒரு வளையத்தைப் பயன்படுத்தவும்.

source: Sorry Dave, you cannot run backward like this. Exercising is hard enough -- please don't overplay.
ta: மன்னிக்கவும் டேவ், நீங்கள் இப்படி பின்னோக்கி ஓட முடியாது. உடற்பயிற்சி செய்வது போதுமானது - தயவுசெய்து மிகைப்படுத்த வேண்டாம்.

source: You fall into water.
ta: நீங்கள் தண்ணீரில் விழுகிறீர்கள்.

source: Test failed
ta: சோதனை தோல்வியடைந்தது

source: I cannot let you use forward with an argument in this exercise. Use a loop instead.
ta: இந்த பயிற்சியில் ஒரு வாதத்துடன் முன்னோக்கி பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக ஒரு வளையத்தைப் பயன்படுத்தவும்.

source: I cannot let you use backward with an argument in this exercise. Use a loop instead.
ta: இந்த பயிற்சியில் ஒரு வாதத்துடன் பின்னோக்கி பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக ஒரு வளையத்தைப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use right() in this exercise. Use left() instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் சரியான () ஐப் பயன்படுத்த நான் அனுமதிக்க முடியாது. அதற்கு பதிலாக இடது () பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use left() both in lines {0} and {1} in this exercise. You can write left() only once in this exercise.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் இடது () இரண்டையும் {0} மற்றும் {1 the வரிகளில் பயன்படுத்த அனுமதிக்க முடியாது. இந்த பயிற்சியில் ஒரு முறை மட்டுமே இடது () எழுத முடியும்.

source: Sorry Dave, I cannot let you use forward() in this exercise. Use setPos(x,y) instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் நான் உங்களை முன்னோக்கி பயன்படுத்த அனுமதிக்க முடியாது. அதற்கு பதிலாக SetPos (x, y) ஐப் பயன்படுத்தவும்.

source: Sorry Dave, I cannot let you use backward() in this exercise. Use setPos(x,y) instead.
ta: மன்னிக்கவும் டேவ், இந்த பயிற்சியில் பின்னோக்கி () பயன்படுத்த நான் உங்களை அனுமதிக்க முடியாது. அதற்கு பதிலாக SetPos (x, y) ஐப் பயன்படுத்தவும்.

source: Your entity failed to start. Did you forgot to put your code within a method? This problem often arises when the exercise expects you to put all the code within a method e.g. run(), but you put some statements (e.g. forward()) outside of any method. The easiest solution to sort it out is to copy all your code (Ctrl-A Ctrl-C), use the 'Exercise/Revert' menu to reset the template, and paste (Ctrl-V) your code within the provided method.
ta: உங்கள் நிறுவனம் தொடங்கத் தவறிவிட்டது. உங்கள் குறியீட்டை ஒரு முறைக்குள் வைக்க மறந்துவிட்டீர்களா? உடற்பயிற்சி நீங்கள் அனைத்து குறியீடுகளையும் வைக்க வேண்டும் என்று எதிர்பார்க்கும்போது இந்த சிக்கல் பெரும்பாலும் எழுகிறது முறை எ.கா. () இயக்கவும், ஆனால் எந்தவொரு முறைக்கும் வெளியே சில அறிக்கைகளை (எ.கா. முன்னோக்கி ()) வைக்கிறீர்கள். அதை வரிசைப்படுத்த எளிதான தீர்வு உங்கள் எல்லா குறியீட்டையும் (Ctrl-a ctrl-c) நகலெடுப்பது, பயன்படுத்தவும் வார்ப்புருவை மீட்டமைக்க 'உடற்பயிற்சி/மாற்றியமைத்தல்' பட்டியல், மற்றும் உங்கள் குறியீட்டை ஒட்டவும் (Ctrl-V) உள்ளே வழங்கப்பட்ட முறை.

source: Your entity failed to start. Your constructor seems to be broken, but I have no clue.
ta: உங்கள் நிறுவனம் தொடங்கத் தவறிவிட்டது. உங்கள் கட்டமைப்பாளர் உடைந்ததாகத் தெரிகிறது, ஆனால் எனக்கு எந்த துப்பும் இல்லை.

source: The execution of your program raised a {0} exception: {1} Please fix your code.
ta: உங்கள் திட்டத்தின் செயல்பாடு {0} விதிவிலக்கு: {1} உங்கள் குறியீட்டை சரிசெய்யவும்.

source: Compilation error:
ta: தொகுப்பு பிழை:

source: Valgrind does not seem to be installed.
ta: Valgrind நிறுவப்பட்டதாகத் தெரியவில்லை.

source: Error, please recompile the exercise.
ta: பிழை, தயவுசெய்து உடற்பயிற்சியை மீண்டும் தொகுக்கவும்.

source: Compilation failed.
ta: தொகுப்பு தோல்வியடைந்தது.

source: Syntax error: {0} Line {1}: {2} In doubt, check your indentation, and that you don't mix tabs and spaces
ta: தொடரியல் பிழை: {0} வரி {1}: {2} ஐயம், உங்கள் உள்தள்ளலை சரிபார்க்கவும், நீங்கள் தாவல்களையும் இடங்களையும் கலக்கவில்லை என்பதையும் சரிபார்க்கவும்

source: Indentation error: {0} line {1}: {2} Please, check that you did not mix tabs and spaces. Use the TAB and shift-TAB keys to clean your indentation.
ta: உள்தள்ளல் பிழை: {0} வரி {1}: {2} தயவுசெய்து, நீங்கள் தாவல்களையும் இடங்களையும் கலக்கவில்லை என்பதை சரிபார்க்கவும். உங்கள் உள்தள்ளலை தூய்மை செய்ய தாவல் மற்றும் சிப்ட்-டேப் விசைகளைப் பயன்படுத்தவும்.

source: You interrupted the execution, did you fall into an infinite loop ? Your program must stop by itself to successfully pass the exercise.
ta: நீங்கள் சாவுஒறுப்பு குறுக்கிட்டீர்கள், நீங்கள் எல்லையற்ற வளையத்தில் விழுந்தீர்களா? உடற்பயிற்சியை வெற்றிகரமாக அனுப்ப உங்கள் நிரல் தானே நிறுத்தப்பட வேண்டும்.

source: NameError raised: You seem to use a non-existent identifier; Please check for typos.
ta: நேபெரர் உயர்த்தப்பட்டது: நீங்கள் இல்லாத அடையாளங்காட்டியைப் பயன்படுத்துவதாகத் தெரிகிறது; எழுத்துப்பிழைகள் சரிபார்க்கவும்.

source: TypeError raised: you are probably misusing a function or something.
ta: தட்டச்சு செய்யப்பட்டது: நீங்கள் ஒரு செயல்பாடு அல்லது எதையாவது தவறாகப் பயன்படுத்துகிறீர்கள்.

source: UnboundLocalError raised: you are probably using a global variable that is not declared as such.
ta: அன்ஃபவுண்ட்லோகிரர் உயர்த்தப்பட்டது: நீங்கள் ஒரு உலகளாவிய மாறியைப் பயன்படுத்துகிறீர்கள், அது அவ்வாறு அறிவிக்கப்படவில்லை.

source: Error: there is no baggle to pickup under the buggle.
ta: பிழை: பிழையின் கீழ் எடுக்க பிழையானது இல்லை.

source: Error: a buggle cannot carry more than one baggle at the same time.
ta: பிழை: ஒரு பிழையானது ஒரே நேரத்தில் ஒன்றுக்கு மேற்பட்ட பேக்கர்களை எடுத்துச் செல்ல முடியாது.

source: Error: your buggle just teleported to the outer space...
ta: பிழை: உங்கள் பிழையானது வெளிப்புற இடத்திற்கு டெலிபோர்ட் செய்யப்பட்டது ...

source: Error: your buggle just hit a wall. That hurts.
ta: பிழை: உங்கள் பிழையானது ஒரு சுவரைத் தாக்கும். அது வலிக்கிறது.

source: Unknown error (please report): {0} Its value is: {1}
ta: தெரியாத பிழை (தயவுசெய்து புகாரளிக்கவும்): {0} அதன் மதிப்பு: {1}

source: No ScriptEngine for {0}. Please check your classpath and similar settings.
ta: {0 க்கு க்கு ச்கிரிப்டெங்கின் இல்லை. உங்கள் வகுப்பறை மற்றும் ஒத்த அமைப்புகளை சரிபார்க்கவும்.

source: No {0} script source for entity {1}. Please report that bug against the PLM.
ta: இல்லை {0} நிறுவனத்திற்கான ச்கிரிப்ட் சான்று {1}. பி.எல்.எம் -க்கு எதிராக அந்த பிழையைப் புகாரளிக்கவும்.

source: Received a ScriptException that does not come from the {0} language.
ta: {0} மொழியிலிருந்து வராத ஒரு ச்கிரிப்டெக்ச்செப்சன் பெற்றது.

source: Script evaluation raised an exception that is not a ScriptException but a {0}. Please report this as a bug against the PLM, with all details allowing to reproduce it. Exception message: {1}
ta: ச்கிரிப்ட் மதிப்பீடு ஒரு ச்கிரிப்டெக்ச்செப்சன் அல்ல, ஆனால் {0} என்ற விதிவிலக்கை எழுப்பியது. தயவுசெய்து இதை பி.எல்.எம் -க்கு எதிரான பிழையாகப் புகாரளிக்கவும், அனைத்து விவரங்களும் அதை இனப்பெருக்கம் செய்ய அனுமதிக்கின்றன. விதிவிலக்கு செய்தி: {1}

source: Scala is usable on your machine. Congratulations.
ta: உங்கள் கணினியில் ச்கலா பயன்படுத்தக்கூடியது. வாழ்த்துக்கள்.

source: Please install Scala version 2.11 or higher to use it in the PLM.
ta: பி.எல்.எம்மில் பயன்படுத்த ச்கலா பதிப்பு 2.11 அல்லது அதற்கு மேல் நிறுவவும்.

source: Jython is usable on your machine. Congratulations.
ta: உங்கள் கணினியில் சைத்தான் பயன்படுத்தக்கூடியது. வாழ்த்துக்கள்.

source: Please install jython to use the python programming language in the PLM.
ta: பி.எல்.எம்மில் பைதான் நிரலாக்க மொழியைப் பயன்படுத்த சைத்தனை நிறுவவும்.

source: C is usable on your machine. Congratulations.
ta: சி உங்கள் கணினியில் பயன்படுத்தக்கூடியது. வாழ்த்துக்கள்.

source: Please install gcc to use the C programming language in the PLM.
ta: பி.எல்.எம்மில் சி நிரலாக்க மொழியைப் பயன்படுத்த சி.சி.சியை நிறுவவும்.

source: Warning, the default programming language is neither ''Java'' nor ''python'' or ''Scala'' or ''C'' but {0}. This language will be used to setup the worlds, possibly leading to severe issues for the exercises that don''t expect it. It is safer to change the current language, and restart the PLM before proceeding. Alternatively, the property {1} can be changed in your configuration file ({2}/plm.properties).
ta: எச்சரிக்கை, இயல்புநிலை நிரலாக்க மொழி '' சாவா 'அல்லது' 'பைதான்' 'அல்லது' 'ச்கலா' 'அல்லது' 'சி' 'ஆனால் {0} அல்ல. இந்த மொழி உலகங்களை அமைப்பதற்கு பயன்படுத்தப்படும், இது எதிர்பார்க்காத பயிற்சிகளுக்கு கடுமையான சிக்கல்களுக்கு வழிவகுக்கும். தற்போதைய மொழியை மாற்றுவது பாதுகாப்பானது, மேலும் தொடர்வதற்கு முன் பி.எல்.எம். மாற்றாக, உங்கள் உள்ளமைவு கோப்பில் ({2} /plm.properties) சொத்து {1} மாற்றப்படலாம்.

source: The default programming language is Scala, but your scala installation is not usable. Switching to Java instead.
ta: இயல்புநிலை நிரலாக்க மொழி ச்கலா, ஆனால் உங்கள் ச்கலா நிறுவல் பயன்படுத்த முடியாதது. அதற்கு பதிலாக சாவாவுக்கு மாறுகிறது.

source: The default programming language is python, but your python installation is not usable. Switching to Java instead.
ta: இயல்புநிலை நிரலாக்க மொழி பைதான், ஆனால் உங்கள் பைதான் நிறுவல் பயன்படுத்த முடியாதது. அதற்கு பதிலாக சாவாவுக்கு மாறுகிறது.

source: The default programming language is C, but your C installation is not usable. Switching to Java instead.
ta: இயல்புநிலை நிரலாக்க மொழி சி, ஆனால் உங்கள் சி நிறுவல் பயன்படுத்த முடியாதது. அதற்கு பதிலாக சாவாவுக்கு மாறுகிறது.

source: You found a bug in the PLM. Please report it with all possible details (including the stacktrace below).
ta: நீங்கள் பி.எல்.எம்மில் ஒரு பிழையைக் கண்டீர்கள். சாத்தியமான அனைத்து விவரங்களுடனும் இதைப் புகாரளிக்கவும் (கீழே உள்ள ச்டாக்ரேச் உட்பட).

source: Error {0} while retrieving the Scala version: {1}
ta: ச்கலா பதிப்பை மீட்டெடுக்கும் போது பிழை {0}: {1}

source: Scala is too ancient. Found {0} while I need 2.10 or higher.
ta: ச்கலா மிகவும் பழமையானது. எனக்கு 2.10 அல்லது அதற்கு மேற்பட்டதாக இருக்கும்போது {0} காணப்பட்டது.

source: Cannot retrieve the python ScriptEngine. Are jython.jar and its dependencies in the classpath?
ta: பைதான் ச்கிரிப்டெங்கைனை மீட்டெடுக்க முடியாது. சைதான்.சார் மற்றும் அதன் சார்புகள் வகுப்பறையில் உள்ளதா?

source: Resource {0} not found in the classpath. Is {1} in your classpath?
ta: வள {0} வகுப்பறையில் காணப்படவில்லை. உங்கள் வகுப்பறையில் {1 fra?

source: {0} received while searching for resource {1}: {2}
ta: {0} வளத்தைத் தேடும்போது பெறப்பட்டது {1}: {2}

source: Cannot switch to lesson {0}: class Main not found.
ta: பாடத்திற்கு மாற முடியாது {0}: வகுப்பு மெயின் கிடைக்கவில்லை.

source: Load lesson {0}
ta: பாடத்தை ஏற்றவும் {0}

source: The lesson {0} encountered an issue while loading its exercises, please report the issue and choose another lesson.
ta: {0} பாடம் அதன் பயிற்சிகளை ஏற்றும்போது ஒரு சிக்கலை எதிர்கொண்டது, தயவுசெய்து சிக்கலைப் புகாரளித்து மற்றொரு பாடத்தைத் தேர்வுசெய்க.

source: Broken lesson
ta: உடைந்த பாடம்

source: Exercise {0} does not support language {1}. Fallback to {2} instead. Please consider contributing to this project by adapting this exercise to this language.
ta: உடற்பயிற்சி {0} மொழியை ஆதரிக்காது {1}. அதற்கு பதிலாக {2 பெறுநர் க்கு குறைவு. இந்த பயிற்சியை இந்த மொழிக்கு மாற்றியமைப்பதன் மூலம் இந்த திட்டத்திற்கு பங்களிப்பதைக் கவனியுங்கள்.

source: Operation cancelled by the user
ta: செயல்பாடு பயனரால் ரத்து செய்யப்பட்டது

source: The lecture {0} has no world that I can select.
ta: விரிவுரை {0} நான் தேர்ந்தெடுக்கக்கூடிய உலகம் இல்லை.

source: Please install Scala version 2.11 or higher to use it in the PLM.
ta: பி.எல்.எம்மில் பயன்படுத்த ச்கலா பதிப்பு 2.11 அல்லது அதற்கு மேல் நிறுவவும்.

source: Scala is missing
ta: ச்கலா காணவில்லை

source: Please install jython and its dependencies to use the python programming language in the PLM.
ta: பி.எல்.எம்மில் பைதான் நிரலாக்க மொழியைப் பயன்படுத்த சைத்தான் மற்றும் அதன் சார்புகளை நிறுவவும்.

source: Python is missing
ta: பைத்தான் காணவில்லை

source: Please install C and its dependencies to use the C programming language in the PLM.
ta: பி.எல்.எம்மில் சி நிரலாக்க மொழியைப் பயன்படுத்த சி மற்றும் அதன் சார்புகளை நிறுவவும்.

source: C is missing
ta: சி காணவில்லை

source: The C langage is currently very experimental in the PLM. If you go for C, you may not be able to complete some exercises that are still in progress in C, although some other parts are already okay. Do you want to proceed anyway?
ta: சி லாங்கேச் தற்போது பி.எல்.எம்மில் மிகவும் சோதனைக்குரியது. நீங்கள் சி க்குச் சென்றால், நீங்கள் சில பயிற்சிகளை முடிக்க முடியாமல் போகலாம் சி இல் இன்னும் நடந்து கொண்டிருக்கிறது, இருப்பினும் வேறு சில பகுதிகள் ஏற்கனவே சரியாக உள்ளன. நீங்கள் எப்படியும் தொடர விரும்புகிறீர்களா?

source: C is still experimental
ta: சி இன்னும் சோதனை

source: Asking to the teacher for help
ta: உதவிக்காக ஆசிரியரிடம் கேட்பது

source: Cancel call for help to the teacher
ta: ஆசிரியருக்கு உதவிக்கான அழைப்பை ரத்துசெய்

source: A new PLM user has been created for you: {0}. Save directory: {1}
ta: உங்களுக்காக ஒரு புதிய பி.எல்.எம் பயனர் உருவாக்கப்பட்டுள்ளது: {0}. கோப்பகத்தை சேமிக்கவும்: {1}

source: User {0} exists already; don't add it again.
ta: பயனர் {0} ஏற்கனவே உள்ளது; அதை மீண்டும் சேர்க்க வேண்டாம்.

source: Switched to user: {0}
ta: பயனருக்கு மாறியது: {0}

source: The world ''{0}'' differs
ta: உலகம் '' {0} '' வேறுபடுகிறது

source: Source file {0}.{1} not found.
ta: மூல கோப்பு {0}. {1} காணப்படவில்லை.

source: {0}: BEGIN TEMPLATE within the template. Please fix your entity.
ta: {0}: வார்ப்புருவுக்குள் வார்ப்புருவைத் தொடங்குங்கள். உங்கள் நிறுவனத்தை சரிசெய்யவும்.

source: {0}: BEGIN SOLUTION is closed with END TEMPLATE. Please fix your entity.
ta: {0}: தொடக்க தீர்வு இறுதி வார்ப்புருவுடன் மூடப்பட்டுள்ளது. உங்கள் நிறுவனத்தை சரிசெய்யவும்.

source: {0}: END TEMPLATE with no matching BEGIN TEMPLATE. Please fix your entity.
ta: {0}: பொருந்தாத தொடக்க வார்ப்புரு இல்லாத வார்ப்புரு. உங்கள் நிறுவனத்தை சரிசெய்யவும்.

source: {0}: Begin solution in template tail. Change it to BEGIN HIDDEN.
ta: {0}: வார்ப்புரு வாலில் தீர்வைத் தொடங்குங்கள். மறைக்கத் தொடங்க அதை மாற்றவும்.

source: Parser error in file {0}. This is a parser bug (state={1}), please report.
ta: கோப்பில் பாகுபடுத்தி பிழை {0}. இது ஒரு பாகுபடுத்தி பிழை (மாநிலம் = {1}), தயவுசெய்து புகாரளிக்கவும்.

source: {0}: End of file unexpected after the solution but within the template. Please fix your entity.
ta: {0}: தீர்வுக்குப் பிறகு எதிர்பாராத கோப்பின் முடிவு ஆனால் வார்ப்புருவுக்குள். உங்கள் நிறுவனத்தை சரிசெய்யவும்.

source: {0}: End of file unexpected (state: {1}). Did you forget to close your template or solution? Please fix your entity.
ta: {0}: கோப்பின் முடிவு எதிர்பாராதது (நிலை: {1}). உங்கள் வார்ப்புரு அல்லது தீர்வை மூட மறந்துவிட்டீர்களா? உங்கள் நிறுவனத்தை சரிசெய்யவும்.

source: Exercise {0} is said to be compatible with language {1}, but there is no entity for this language: {2}
ta: உடற்பயிற்சி {0} மொழியுடன் இணக்கமாக இருப்பதாகக் கூறப்படுகிறது {1}, ஆனால் இந்த மொழிக்கு எந்த நிறுவனமும் இல்லை: {2}

source: {0}: No entity found. You should fix your paths and settings.
ta: {0}: எந்த நிறுவனமும் கிடைக்கவில்லை. உங்கள் பாதைகள் மற்றும் அமைப்புகளை சரிசெய்ய வேண்டும்.

source: World {0} is broken ({1}). Recompute all answer worlds.
ta: உலகம் {0} உடைந்துவிட்டது ({1}). எல்லா பதில் உலகங்களையும் மீண்டும் இணைக்கவும்.

source: Cache file {0} is missing. Recompute all answer worlds.
ta: கேச் கோப்பு {0} இல்லை. எல்லா பதில் உலகங்களையும் மீண்டும் இணைக்கவும்.

source: IO exception while reading world {0} ({1}). Recompute all answer worlds.
ta: உலகத்தைப் படிக்கும் போது io விதிவிலக்கு {0} ({1}). எல்லா பதில் உலகங்களையும் மீண்டும் இணைக்கவும்.

source: Recompute the answer of {0} despite the cache file, as requested by the property {1}.
ta: {0 of இன் பதிலை மீண்டும் இணைக்கவும், கேச் கோப்பு இருந்தபோதிலும், சொத்து கோரியபடி {0}.

source: Error while writing answer world of {0}:
ta: {0 of இன் பதில் உலகத்தை எழுதும் போது பிழை:

source: Cannot write answer world of {0}. Please check the permissions.
ta: {0 of இன் பதில் உலகத்தை எழுத முடியாது. அனுமதிகளை சரிபார்க்கவும்.

source: File {0}.html not found.
ta: கோப்பு {0} .html கிடைக்கவில்லை.

source: Cannot find the name of mission in {0}.html
ta: {0} .html இல் பணியின் பெயரை கண்டுபிடிக்க முடியவில்லை

source: Something weird happened. Your session was not created/reloaded properly. Please report this issue.
ta: ஏதோ வித்தியாசமானது நடந்தது. உங்கள் அமர்வு சரியாக உருவாக்கப்படவில்லை/மீண்டும் ஏற்றப்படவில்லை. இந்த சிக்கலைப் புகாரளிக்கவும்.

source: Ok, quit and lose my data.
ta: சரி, வெளியேறி எனது தரவை இழக்கவும்.

source: Please stop! I'll save it myself first.
ta: தயவுசெய்து நிறுத்துங்கள்! நான் அதை முதலில் சேமிக்கிறேன்.

source: The PLM were unable to save your session file for lesson {0} ({1}:{2}). Would you like proceed anyway? Any solution typed so far will be lost.
ta: பி.எல்.எம் உங்கள் அமர்வு கோப்பை பாடத்திற்கு {0} ({1}: {2}) சேமிக்க முடியவில்லை. எப்படியும் தொடர விரும்புகிறீர்களா? இதுவரை தட்டச்சு செய்த எந்தவொரு தீர்வும் இழக்கப்படும்.

source: Your changes are NOT saved.
ta: உங்கள் மாற்றங்கள் சேமிக்கப்படவில்லை.

source: User aborted saving on system error.
ta: கணினி பிழையில் பயனர் கைவிடப்பட்டது.

source: Proceed
ta: தொடரவும்

source: Abort
ta: கருக்கலைப்பு

source: The PLM were unable to load your code for lesson {0} ({1}:{2}). Would you like proceed anyway (and lose any solution typed previously)?
ta: பி.எல்.எம் உங்கள் குறியீட்டை பாடம் {0} ({1}: {2}) க்கு ஏற்ற முடியவில்லை. நீங்கள் எப்படியும் தொடர விரும்புகிறீர்களா (முன்பு தட்டச்சு செய்த எந்த தீர்வையும் இழக்க)?
